{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}collapse
       {txt}log:  {res}c:\git\ftools\test\benchmark_fcollapse.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res} 8 Oct 2016, 03:53:08
{txt}
{com}. include "test_utils.do"
{txt}
{com}. 
. // -------------------------
. // Programs
. 
. cap pr drop crData
{txt}
{com}. pr crData
{txt}  1{com}.         args n k
{txt}  2{com}.         clear
{txt}  3{com}.         qui set obs `n'
{txt}  4{com}.         noi di "(obs set)"
{txt}  5{com}.         loc m = ceil(`n' / 10)
{txt}  6{com}.         //set seed 234238921
.         *gen long x1 = ceil(uniform()*`m')
.         gen long x1 = ceil(uniform()*10000) * 100
{txt}  7{com}. 
.         gen int x2 = ceil(uniform()*3000)
{txt}  8{com}.         gen byte x3 = ceil(uniform()*100)
{txt}  9{com}.         gen str x4 = "u" + string(ceil(uniform()*100), "%5.0f")
{txt} 10{com}.         gen long x5 = ceil(uniform()*5000)
{txt} 11{com}.         // compress
.         noi di "(Xs set)"
{txt} 12{com}. 
.         forv i=1/`k' {c -(}
{txt} 13{com}.                 gen double y`i' = 123.456
{txt} 14{com}.         {c )-}
{txt} 15{com}. 
.         loc obs_k = ceil(`c(N)' / 1000)
{txt} 16{com}. end
{txt}
{com}. 
. cap pr drop FactorsAgree
{txt}
{com}. pr FactorsAgree, sortpreserve
{txt}  1{com}.         args id1 id2
{txt}  2{com}.         tempvar ok
{txt}  3{com}.         
.         bys `id1' (`id2'): gen byte `ok' = `id2'[1] == `id2'[_N]
{txt}  4{com}.         assert `ok' == 1
{txt}  5{com}.         drop `ok'
{txt}  6{com}.         
.         bys `id2' (`id1'): gen byte `ok' = `id1'[1] == `id1'[_N]
{txt}  7{com}.         assert `ok' == 1
{txt}  8{com}.         drop `ok'
{txt}  9{com}. end
{txt}
{com}. 
. cap pr drop ValidateFactor
{txt}
{com}. pr ValidateFactor
{txt}  1{com}.         syntax varlist [in] [if], [factor(string) method(string)]
{txt}  2{com}.         preserve
{txt}  3{com}.         di as smcl "{c -(}txt{c )-}{c -(}bf:[OPTIONS]{c )-} {c -(}res{c )-}`0'"
{txt}  4{com}.         if ("`factor'" == "") {c -(}
{txt}  5{com}.                 loc factor F
{txt}  6{com}.         {c )-}
{txt}  7{com}.         if ("`in'`if'" != "") {c -(}
{txt}  8{com}.                 marksample touse
{txt}  9{com}.                 cou if `touse'
{txt} 10{com}.                 loc num_obs = r(N)
{txt} 11{com}.         {c )-}
{txt} 12{com}.         else {c -(}
{txt} 13{com}.                 loc num_obs = c(N)
{txt} 14{com}.         {c )-}
{txt} 15{com}.         // factor(varlist, touse, verbose, method, sort_levels, count_levels, hash_ratio)
.         loc cmd mata: `factor' = factor("`varlist'", "`touse'", 1, "`method'")
{txt} 16{com}.         di as res `"          `cmd'"'
{txt} 17{com}.         `cmd'
{txt} 18{com}.         loc cmd mata: `factor'.store_levels("new_id")
{txt} 19{com}.         di as res `"          `cmd'"'
{txt} 20{com}.         `cmd'
{txt} 21{com}.         loc cmd mata: `factor'.panelsetup()
{txt} 22{com}.         di as res `"          `cmd'"'
{txt} 23{com}.         `cmd'
{txt} 24{com}. 
.         di as smcl "{c -(}txt{c )-}{c -(}bf:[TESTING] {c )-}" _c
{txt} 25{com}. 
.         // Output:
.         // num_levels num_obs touse varlist
.         // levels keys counts info p
.         di as res "F.num_obs " _c
{txt} 26{com}.         mata: assert(`factor'.num_obs == `num_obs')
{txt} 27{com}.         egen long benchmark_id = group(`varlist')
{txt} 28{com}.         di as res "F.levels " _c
{txt} 29{com}.         assert benchmark_id == new_id
{txt} 30{com}.         
.         gen long i = _n
{txt} 31{com}.         sort benchmark_id, stable
{txt} 32{com}.         mata: benchmark_id = st_data(., "benchmark_id")
{txt} 33{com}.         sort i
{txt} 34{com}.         drop i
{txt} 35{com}. 
.         gen byte counts = 1
{txt} 36{com}.         collapse (first) `varlist' (count) counts , by(benchmark_id)
{txt} 37{com}.         di as res "F.num_levels " _c
{txt} 38{com}.         loc num_levels = c(N)
{txt} 39{com}.         mata: assert(`factor'.num_levels == `num_levels')
{txt} 40{com}.         di as res "F.touse " _c
{txt} 41{com}.         mata: assert(`factor'.touse == "`touse'")
{txt} 42{com}.         di as res "F.varlist " _c
{txt} 43{com}.         mata: assert(`factor'.varlist == tokens("`varlist'"))
{txt} 44{com}.         di as res "F.keys " _c
{txt} 45{com}.         mata: benchmark_keys = __fload_data("`varlist'")
{txt} 46{com}.         mata: assert(benchmark_keys == `factor'.keys)
{txt} 47{com}.         di as res "F.counts " _c
{txt} 48{com}.         mata: benchmark_counts = st_data(., "counts")
{txt} 49{com}.         mata: assert(benchmark_counts == `factor'.counts)
{txt} 50{com}.         di as res "F.offsets "
{txt} 51{com}.         sort benchmark_id
{txt} 52{com}.         mata: assert(panelsetup(benchmark_id, 1) == `factor'.info)
{txt} 53{com}. 
.         // note: order is not a stable sort so we also sort by _n
.         mata: assert(`factor'.p == order((`factor'.levels, (1::`factor'.num_obs)), 1..2) )
{txt} 54{com}. 
.         // same for offsets, p
.         mata: mata drop `factor'
{txt} 55{com}.         di as smcl "{c -(}txt{c )-}{c -(}bf:[OK]{c )-}"
{txt} 56{com}. end
{txt}
{com}. {txt}
{com}. 
. cap ado uninstall ftools
{txt}
{com}. net install ftools, from("C:/git/ftools/src")
checking {hilite:ftools} consistency and verifying not already installed...
installing into c:\ado\plus\...
installation complete.
{txt}
{com}. ftools compile
{txt}(compiling lftools.mlib for Stata 14.2)
(library saved in c:\ado\plus/l/lftools.mlib)

{com}. 
. 
. // --------------------------------------------------
. // PROGRAMS
. // --------------------------------------------------
. 
. cap pr drop RunOne
{txt}
{com}. pr RunOne
{txt}  1{com}.         syntax, by(varlist) data(varlist) stats(namelist) method(string)
{txt}  2{com}.         assert inlist("`method'", "sumup", "collapse", "fcol", "fcolp", "tab")
{txt}  3{com}.         
.         foreach s of local stats {c -(}
{txt}  4{com}.                 loc zip `zip' (`s')
{txt}  5{com}.                 foreach var of varlist `data' {c -(}
{txt}  6{com}.                         loc zip `zip' `s'_`var'=`var'
{txt}  7{com}.                 {c )-}
{txt}  8{com}.         {c )-}
{txt}  9{com}.         di as text "clist=<`zip'>"
{txt} 10{com}. 
.         if ("`method'"=="sumup") qui sumup `data', by(`by') stat(`stats')
{txt} 11{com}.         if ("`method'"=="collapse") collapse `zip', by(`by') fast
{txt} 12{com}.         if ("`method'"=="fcol") fcollapse `zip', by(`by') fast verbose
{txt} 13{com}.         if ("`method'"=="fcolp") fcollapse `zip', by(`by') fast verbose pool(5)
{txt} 14{com}.         if ("`method'"=="tab") {c -(}
{txt} 15{com}.                 tab `by', missing nofreq nolabel matrow(foobar)
{txt} 16{com}.                 noi di rowsof(foobar)
{txt} 17{com}.         {c )-}
{txt} 18{com}. end
{txt}
{com}. 
. 
. // --------------------------------------------------
. // TESTING
. // --------------------------------------------------
. 
. // -------------------------
. // Simple commands
.         qui sysuse auto, clear
{txt}
{com}.         fcollapse (sum) price weight gear, by(turn) fast
{res}{txt}(0 observations deleted)
{res}  50:      0.00 /        1 =       0.0020
{txt}
{com}.         qui sysuse auto, clear
{txt}
{com}.         fcollapse (sum) price weight, by(turn) pool(1) fast
{res}{txt}(0 observations deleted)
{res}  50:      0.00 /        1 =       0.0010
{txt}
{com}.         qui sysuse auto, clear
{txt}
{com}.         fcollapse (sum) price weight, by(turn) pool(5)
{res}{txt}(0 observations deleted)
{res}  50:      0.00 /        1 =       0.0010
{txt}
{com}.         qui sysuse auto, clear
{txt}
{com}.         fcollapse (sum) price weight (first) make (mean) gear, by(turn) pool(2) fast
{res}{txt}(0 observations deleted)
{res}  50:      0.00 /        1 =       0.0010
{txt}
{com}.         qui sysuse auto, clear
{txt}
{com}.         fcollapse (sum) price weight (first) make (mean) gear, by(turn) pool(.)
{res}{txt}(0 observations deleted)
{res}  50:      0.00 /        1 =       0.0020
{txt}
{com}.         qui sysuse auto, clear
{txt}
{com}.         replace trunk = . if trunk == 5
{txt}(1 real change made, 1 to missing)

{com}.         fcollapse (sum) price weight (first) make p=price (last) q=price m=make (count) foreign trunk, by(turn) fast
{res}{txt}(0 observations deleted)
{res}  50:      0.00 /        1 =       0.0010
{txt}
{com}.         
. // -------------------------
. // With missing Values
.         qui sysuse auto, clear
{txt}
{com}.         replace price = . if foreign
{txt}(22 real changes made, 22 to missing)

{com}.         replace gear = . if turn == 31
{txt}(1 real change made, 1 to missing)

{com}.         gen z = 1 in 1
{txt}(73 missing values generated)

{com}.         local stats mean median p1 p2 p4 p50 p99 sum count percent max min iqr first last firstnm lastnm
{txt}
{com}.         loc i 0
{txt}
{com}.         foreach stat of local stats {c -(}
{txt}  2{com}.                 loc ++i
{txt}  3{com}.                 loc clist `clist' (`stat') x_price_`stat'=price x_gear_`stat'=gear x_z_`stat'=z
{txt}  4{com}.         {c )-}
{txt}
{com}.         preserve
{txt}
{com}.         
.         collapse `clist', by(foreign)
{txt}
{com}.         reshape long x_ , i(foreign) j(cat) string
{txt}(note: j = gear_count gear_first gear_firstnm gear_iqr gear_last gear_lastnm gear_max gear_mean gear_median gear_min gear_p1 gear_p2 gear_p4 gear_p50 gear_p99 gear_percent gear_sum price_count price_first price_firstnm price_iqr price_last price_lastnm price_max price_mean price_median price_min price_p1 price_p2 price_p4 price_p50 price_p99 price_percent price_sum z_count z_first z_firstnm z_iqr z_last z_lastnm z_max z_mean z_median z_min z_p1 z_p2 z_p4 z_p50 z_p99 z_percent z_sum)
x_gear_percent:  {res}2{txt} values would be changed; not changed
x_gear_sum:  {res}2{txt} values would be changed; not changed

Data{col 36}wide{col 43}->{col 48}long
{hline 77}
Number of obs.                 {res}       2   {txt}->{res}     102
{txt}Number of variables            {res}      52   {txt}->{res}       3
{txt}j variable (51 values)                    ->   {res}cat
{txt}xij variables:
  {res}x_gear_count x_gear_first ... x_z_sum   {txt}->   {res}x_
{txt}{hline 77}

{com}.         rename x_ collapse
{res}{txt}
{com}.         tempfile benchmark
{txt}
{com}.         save "`benchmark'", replace
{txt}(note: file C:\Users\Sergio\AppData\Local\Temp\ST_00000002.tmp not found)
file C:\Users\Sergio\AppData\Local\Temp\ST_00000002.tmp saved

{com}.         restore, preserve
{txt}
{com}.         
.         fcollapse `clist', by(foreign)
{res}{txt}(0 observations deleted)
{res}  50:      0.00 /        1 =       0.0010
{txt}
{com}.         reshape long x_ , i(foreign) j(cat) string
{txt}(note: j = gear_count gear_first gear_firstnm gear_iqr gear_last gear_lastnm gear_max gear_mean gear_median gear_min gear_p1 gear_p2 gear_p4 gear_p50 gear_p99 gear_percent gear_sum price_count price_first price_firstnm price_iqr price_last price_lastnm price_max price_mean price_median price_min price_p1 price_p2 price_p4 price_p50 price_p99 price_percent price_sum z_count z_first z_firstnm z_iqr z_last z_lastnm z_max z_mean z_median z_min z_p1 z_p2 z_p4 z_p50 z_p99 z_percent z_sum)
x_gear_mean:  {res}1{txt} value would be changed; not changed
x_gear_median:  {res}1{txt} value would be changed; not changed
x_gear_p50:  {res}1{txt} value would be changed; not changed
x_gear_percent:  {res}2{txt} values would be changed; not changed
x_gear_sum:  {res}2{txt} values would be changed; not changed
x_price_mean:  {res}1{txt} value would be changed; not changed

Data{col 36}wide{col 43}->{col 48}long
{hline 77}
Number of obs.                 {res}       2   {txt}->{res}     102
{txt}Number of variables            {res}      52   {txt}->{res}       3
{txt}j variable (51 values)                    ->   {res}cat
{txt}xij variables:
  {res}x_gear_count x_gear_first ... x_z_sum   {txt}->   {res}x_
{txt}{hline 77}

{com}.         rename x_ fcollapse
{res}{txt}
{com}.         merge 1:1 foreign cat using "`benchmark'", assert(match) nogen
{res}{txt}(label origin already defined)

{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}               0
{txt}{col 5}matched{col 30}{res}             102{txt}  
{col 5}{hline 41}

{com}.         gen double diff = reldif(fcollapse, collapse)
{txt}
{com}.         su diff

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 8}diff {c |}{res}        102    9.55e-10    5.17e-09          0   3.71e-08
{txt}
{com}.         assert diff < 1e-6
{txt}
{com}.         restore, preserve
{txt}
{com}.         
.         * repeat for a different by()
.         
.         collapse `clist', by(turn)
{txt}
{com}.         reshape long x_ , i(turn) j(cat) string
{txt}(note: j = gear_count gear_first gear_firstnm gear_iqr gear_last gear_lastnm gear_max gear_mean gear_median gear_min gear_p1 gear_p2 gear_p4 gear_p50 gear_p99 gear_percent gear_sum price_count price_first price_firstnm price_iqr price_last price_lastnm price_max price_mean price_median price_min price_p1 price_p2 price_p4 price_p50 price_p99 price_percent price_sum z_count z_first z_firstnm z_iqr z_last z_lastnm z_max z_mean z_median z_min z_p1 z_p2 z_p4 z_p50 z_p99 z_percent z_sum)
x_gear_percent:  {res}17{txt} values would be changed; not changed
x_gear_sum:  {res}9{txt} values would be changed; not changed
x_price_percent:  {res}17{txt} values would be changed; not changed

Data{col 36}wide{col 43}->{col 48}long
{hline 77}
Number of obs.                 {res}      18   {txt}->{res}     918
{txt}Number of variables            {res}      52   {txt}->{res}       3
{txt}j variable (51 values)                    ->   {res}cat
{txt}xij variables:
  {res}x_gear_count x_gear_first ... x_z_sum   {txt}->   {res}x_
{txt}{hline 77}

{com}.         rename x_ collapse
{res}{txt}
{com}.         tempfile benchmark
{txt}
{com}.         save "`benchmark'", replace
{txt}(note: file C:\Users\Sergio\AppData\Local\Temp\ST_00000003.tmp not found)
file C:\Users\Sergio\AppData\Local\Temp\ST_00000003.tmp saved

{com}.         restore, preserve
{txt}
{com}.         
.         fcollapse `clist', by(turn)
{res}{txt}(0 observations deleted)
{res}  50:      0.00 /        1 =       0.0010
{txt}
{com}.         reshape long x_ , i(turn) j(cat) string
{txt}(note: j = gear_count gear_first gear_firstnm gear_iqr gear_last gear_lastnm gear_max gear_mean gear_median gear_min gear_p1 gear_p2 gear_p4 gear_p50 gear_p99 gear_percent gear_sum price_count price_first price_firstnm price_iqr price_last price_lastnm price_max price_mean price_median price_min price_p1 price_p2 price_p4 price_p50 price_p99 price_percent price_sum z_count z_first z_firstnm z_iqr z_last z_lastnm z_max z_mean z_median z_min z_p1 z_p2 z_p4 z_p50 z_p99 z_percent z_sum)
x_gear_mean:  {res}12{txt} values would be changed; not changed
x_gear_median:  {res}6{txt} values would be changed; not changed
x_gear_p50:  {res}6{txt} values would be changed; not changed
x_gear_percent:  {res}17{txt} values would be changed; not changed
x_gear_sum:  {res}9{txt} values would be changed; not changed
x_price_mean:  {res}5{txt} values would be changed; not changed
x_price_percent:  {res}17{txt} values would be changed; not changed

Data{col 36}wide{col 43}->{col 48}long
{hline 77}
Number of obs.                 {res}      18   {txt}->{res}     918
{txt}Number of variables            {res}      52   {txt}->{res}       3
{txt}j variable (51 values)                    ->   {res}cat
{txt}xij variables:
  {res}x_gear_count x_gear_first ... x_z_sum   {txt}->   {res}x_
{txt}{hline 77}

{com}.         rename x_ fcollapse
{res}{txt}
{com}.         merge 1:1 turn cat using "`benchmark'", assert(match) nogen
{res}
{txt}{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}               0
{txt}{col 5}matched{col 30}{res}             918{txt}  
{col 5}{hline 41}

{com}.         gen double diff = reldif(fcollapse, collapse)
{txt}
{com}.         su diff

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 8}diff {c |}{res}        918    9.34e-10    5.88e-09          0   1.04e-07
{txt}
{com}.         assert diff < 1e-6
{txt}
{com}.         restore, preserve
{txt}
{com}. 
.         * repeat with no by()
.         
.         collapse `clist'
{txt}
{com}.         assert _N == 1
{txt}
{com}.         gen byte i = 1
{txt}
{com}.         reshape long x_ , i(i) j(cat) string
{txt}(note: j = gear_count gear_first gear_firstnm gear_iqr gear_last gear_lastnm gear_max gear_mean gear_median gear_min gear_p1 gear_p2 gear_p4 gear_p50 gear_p99 gear_percent gear_sum price_count price_first price_firstnm price_iqr price_last price_lastnm price_max price_mean price_median price_min price_p1 price_p2 price_p4 price_p50 price_p99 price_percent price_sum z_count z_first z_firstnm z_iqr z_last z_lastnm z_max z_mean z_median z_min z_p1 z_p2 z_p4 z_p50 z_p99 z_percent z_sum)
x_gear_sum:  {res}1{txt} value would be changed; not changed

Data{col 36}wide{col 43}->{col 48}long
{hline 77}
Number of obs.                 {res}       1   {txt}->{res}      51
{txt}Number of variables            {res}      52   {txt}->{res}       3
{txt}j variable (51 values)                    ->   {res}cat
{txt}xij variables:
  {res}x_gear_count x_gear_first ... x_z_sum   {txt}->   {res}x_
{txt}{hline 77}

{com}.         rename x_ collapse
{res}{txt}
{com}.         tempfile benchmark
{txt}
{com}.         save "`benchmark'", replace
{txt}(note: file C:\Users\Sergio\AppData\Local\Temp\ST_00000004.tmp not found)
file C:\Users\Sergio\AppData\Local\Temp\ST_00000004.tmp saved

{com}.         restore, preserve
{txt}
{com}.         
.         fcollapse `clist'
{res}{txt}(0 observations deleted)
{res}  50:      0.00 /        1 =       0.0010
{txt}
{com}.         assert _N == 1
{txt}
{com}.         gen byte i = 1
{txt}
{com}.         reshape long x_ , i(i) j(cat) string
{txt}(note: j = gear_count gear_first gear_firstnm gear_iqr gear_last gear_lastnm gear_max gear_mean gear_median gear_min gear_p1 gear_p2 gear_p4 gear_p50 gear_p99 gear_percent gear_sum price_count price_first price_firstnm price_iqr price_last price_lastnm price_max price_mean price_median price_min price_p1 price_p2 price_p4 price_p50 price_p99 price_percent price_sum z_count z_first z_firstnm z_iqr z_last z_lastnm z_max z_mean z_median z_min z_p1 z_p2 z_p4 z_p50 z_p99 z_percent z_sum)
x_gear_mean:  {res}1{txt} value would be changed; not changed
x_gear_sum:  {res}1{txt} value would be changed; not changed
x_price_mean:  {res}1{txt} value would be changed; not changed

Data{col 36}wide{col 43}->{col 48}long
{hline 77}
Number of obs.                 {res}       1   {txt}->{res}      51
{txt}Number of variables            {res}      52   {txt}->{res}       3
{txt}j variable (51 values)                    ->   {res}cat
{txt}xij variables:
  {res}x_gear_count x_gear_first ... x_z_sum   {txt}->   {res}x_
{txt}{hline 77}

{com}.         rename x_ fcollapse
{res}{txt}
{com}.         merge 1:1 cat using "`benchmark'", assert(match) nogen
{res}
{txt}{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}               0
{txt}{col 5}matched{col 30}{res}              51{txt}  
{col 5}{hline 41}

{com}.         gen double diff = reldif(fcollapse, collapse)
{txt}
{com}.         su diff

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 8}diff {c |}{res}         51    7.59e-10    5.20e-09          0   3.71e-08
{txt}
{com}.         assert diff < 1e-6
{txt}
{com}.         restore, preserve
{txt}
{com}. 
.         * repeat with no by() and one obs
.         
.         collapse `clist' in 1
{txt}
{com}.         assert _N == 1
{txt}
{com}.         gen byte i = 1
{txt}
{com}.         reshape long x_ , i(i) j(cat) string
{txt}(note: j = gear_count gear_first gear_firstnm gear_iqr gear_last gear_lastnm gear_max gear_mean gear_median gear_min gear_p1 gear_p2 gear_p4 gear_p50 gear_p99 gear_percent gear_sum price_count price_first price_firstnm price_iqr price_last price_lastnm price_max price_mean price_median price_min price_p1 price_p2 price_p4 price_p50 price_p99 price_percent price_sum z_count z_first z_firstnm z_iqr z_last z_lastnm z_max z_mean z_median z_min z_p1 z_p2 z_p4 z_p50 z_p99 z_percent z_sum)

Data{col 36}wide{col 43}->{col 48}long
{hline 77}
Number of obs.                 {res}       1   {txt}->{res}      51
{txt}Number of variables            {res}      52   {txt}->{res}       3
{txt}j variable (51 values)                    ->   {res}cat
{txt}xij variables:
  {res}x_gear_count x_gear_first ... x_z_sum   {txt}->   {res}x_
{txt}{hline 77}

{com}.         rename x_ collapse
{res}{txt}
{com}.         tempfile benchmark
{txt}
{com}.         save "`benchmark'", replace
{txt}(note: file C:\Users\Sergio\AppData\Local\Temp\ST_00000005.tmp not found)
file C:\Users\Sergio\AppData\Local\Temp\ST_00000005.tmp saved

{com}.         restore, preserve
{txt}
{com}.         
.         fcollapse `clist' in 1
{res}{txt}(73 observations deleted)
{res}  50:      0.00 /        1 =       0.0010
{txt}
{com}.         assert _N == 1
{txt}
{com}.         gen byte i = 1
{txt}
{com}.         reshape long x_ , i(i) j(cat) string
{txt}(note: j = gear_count gear_first gear_firstnm gear_iqr gear_last gear_lastnm gear_max gear_mean gear_median gear_min gear_p1 gear_p2 gear_p4 gear_p50 gear_p99 gear_percent gear_sum price_count price_first price_firstnm price_iqr price_last price_lastnm price_max price_mean price_median price_min price_p1 price_p2 price_p4 price_p50 price_p99 price_percent price_sum z_count z_first z_firstnm z_iqr z_last z_lastnm z_max z_mean z_median z_min z_p1 z_p2 z_p4 z_p50 z_p99 z_percent z_sum)

Data{col 36}wide{col 43}->{col 48}long
{hline 77}
Number of obs.                 {res}       1   {txt}->{res}      51
{txt}Number of variables            {res}      52   {txt}->{res}       3
{txt}j variable (51 values)                    ->   {res}cat
{txt}xij variables:
  {res}x_gear_count x_gear_first ... x_z_sum   {txt}->   {res}x_
{txt}{hline 77}

{com}.         rename x_ fcollapse
{res}{txt}
{com}.         merge 1:1 cat using "`benchmark'", assert(match) nogen
{res}
{txt}{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}               0
{txt}{col 5}matched{col 30}{res}              51{txt}  
{col 5}{hline 41}

{com}.         gen double diff = reldif(fcollapse, collapse)
{txt}
{com}.         su diff

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 8}diff {c |}{res}         51           0           0          0          0
{txt}
{com}.         assert diff < 1e-6
{txt}
{com}.         //restore, preserve
.         restore, not
{txt}
{com}.         
. // --------------------------------------------------
. // BENCHMARK - LARGE DATASETS
. // --------------------------------------------------
. 
. // -------------------------
. // Setup
.         cls
{txt}
{com}.         set segmentsize 128m // default 32m
{txt}
{com}.         set niceness 10, permanently // default 5
{txt}({cmd:set niceness} preference recorded)

{com}. 
.         clear
{txt}
{com}.         adopath + "./comparison"
{txt}  [1]  (BASE)      "{res}C:\Bin\Stata14\ado\base/{txt}"
  [2]  (SITE)      "{res}C:\Bin\Stata14\ado\site/{txt}"
  [3]              "{res}.{txt}"
  [4]  (PERSONAL)  "{res}c:\ado\personal/{txt}"
  [5]  (PLUS)      "{res}c:\ado\plus/{txt}"
  [6]  (OLDPLACE)  "{res}c:\ado/{txt}"
  [7]              "{res}./comparison{txt}"

{com}.         timer clear
{txt}
{com}.         loc n = 20 * 1000 * 1000
{txt}
{com}.         //loc n = 1 * 1000 * 1000
.         crData `n' 15 // x1 ... x5; y1..
(obs set)
{err}{hline 2}Break{hline 2}
{txt}{search r(1), local:r(1);}

end of do-file

{err}{hline 2}Break{hline 2}
{txt}{search r(1), local:r(1);}

{com}. sysuse auto
{err}no; data in memory would be lost
{txt}{search r(4), local:r(4);}

{com}. clear

. sysuse auto
{txt}(1978 Automobile Data)

{com}. fcollapse (sum) turn, by(forei)
{res}{txt}(0 observations deleted)
{res}  50:      0.00 /        1 =       0.0010

{com}. l
{txt}
     {c TLC}{hline 10}{c -}{hline 6}{c TRC}
     {c |} {res} foreign   turn {txt}{c |}
     {c LT}{hline 10}{c -}{hline 6}{c RT}
  1. {c |} {res}Domestic   2155 {txt}{c |}
  2. {c |} {res} Foreign    779 {txt}{c |}
     {c BLC}{hline 10}{c -}{hline 6}{c BRC}

{com}. h st_data

. do demo_fcollapse_merge
{txt}
{com}. cap ado uninstall ftools
{txt}
{com}. net install ftools, from("C:/git/ftools/src")
checking {hilite:ftools} consistency and verifying not already installed...
installing into c:\ado\plus\...
installation complete.
{txt}
{com}. ftools compile
{txt}(compiling lftools.mlib for Stata 14.2)
(library saved in c:\ado\plus/l/lftools.mlib)

{com}. discard
{txt}
{com}. 
. clear all
{txt}
{com}. cls
{txt}
{com}. set more off
{txt}
{com}. 
. * benchmark
. sysuse auto
{txt}(1978 Automobile Data)

{com}. egen double sum_foreign = sum(foreign), by(turn)
{txt}
{com}. egen byte max_foreign = max(foreign), by(turn)
{txt}
{com}. egen int MAX_PRICE = max(price), by(turn)
{txt}
{com}. egen int _freq = count(turn), by(turn)
{txt}
{com}. 
. de *_*

              {txt}storage   display    value
variable name   type    format     label      variable label
{hline}
{p 0 48}{res}{bind:gear_ratio     }{txt}{bind: float   }{bind:{txt}%6.2f     }{space 1}{bind:         }{bind:  }{res}{res}Gear Ratio{p_end}
{p 0 48}{bind:sum_foreign    }{txt}{bind: double  }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:max_foreign    }{txt}{bind: byte    }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:MAX_PRICE      }{txt}{bind: int     }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:_freq          }{txt}{bind: int     }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{txt}
{com}. drop make
{txt}
{com}. mata: bench = hash1(st_data(., "_all"))
{res}{txt}
{com}. mata: bench
{res}  3965372940
{txt}
{com}. li in 1/10
{txt}
     {c TLC}{hline 8}{c -}{hline 5}{c -}{hline 7}{c -}{hline 10}{c -}{hline 7}{c -}{hline 8}{c -}{hline 8}{c -}{hline 6}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 7}{c TRC}
     {c |} {res} price   mpg   rep78   headroom   trunk   weight   length   turn   displa~t   gear_r~o    foreign   sum_fo~n   max_fo~n   MAX_PR~E   _freq {txt}{c |}
     {c LT}{hline 8}{c -}{hline 5}{c -}{hline 7}{c -}{hline 10}{c -}{hline 7}{c -}{hline 8}{c -}{hline 8}{c -}{hline 6}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 7}{c RT}
  1. {c |} {res} 4,099    22       3        2.5      11    2,930      186     40        121       3.58   Domestic          0          0       4816       6 {txt}{c |}
  2. {c |} {res} 4,749    17       3        3.0      11    3,350      173     40        258       2.53   Domestic          0          0       4816       6 {txt}{c |}
  3. {c |} {res} 3,799    22       .        3.0      12    2,640      168     35        121       3.08   Domestic          4          1       6229       6 {txt}{c |}
  4. {c |} {res} 4,816    20       3        4.5      16    3,250      196     40        196       2.93   Domestic          0          0       4816       6 {txt}{c |}
  5. {c |} {res} 7,827    15       4        4.0      20    4,080      222     43        350       2.41   Domestic          0          0      14500      12 {txt}{c |}
     {c LT}{hline 8}{c -}{hline 5}{c -}{hline 7}{c -}{hline 10}{c -}{hline 7}{c -}{hline 8}{c -}{hline 8}{c -}{hline 6}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 7}{c RT}
  6. {c |} {res} 5,788    18       3        4.0      21    3,670      218     43        231       2.73   Domestic          0          0      14500      12 {txt}{c |}
  7. {c |} {res} 4,453    26       .        3.0      10    2,230      170     34        304       2.87   Domestic          4          1       9735       6 {txt}{c |}
  8. {c |} {res} 5,189    20       3        2.0      16    3,280      200     42        196       2.93   Domestic          0          0       5798       7 {txt}{c |}
  9. {c |} {res}10,372    16       3        3.5      17    3,880      207     43        231       2.93   Domestic          0          0      14500      12 {txt}{c |}
 10. {c |} {res} 4,082    19       3        3.5      13    3,400      200     42        231       3.08   Domestic          0          0       5798       7 {txt}{c |}
     {c BLC}{hline 8}{c -}{hline 5}{c -}{hline 7}{c -}{hline 10}{c -}{hline 7}{c -}{hline 8}{c -}{hline 8}{c -}{hline 6}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 7}{c BRC}

{com}. 
. sysuse auto, clear
{txt}(1978 Automobile Data)

{com}. // fcollapse (sum) foreign (max) MAX_PRICE=price foreign, by(turn) merge freq v
. 
. de *_*

              {txt}storage   display    value
variable name   type    format     label      variable label
{hline}
{p 0 48}{res}{bind:gear_ratio     }{txt}{bind: float   }{bind:{txt}%6.2f     }{space 1}{bind:         }{bind:  }{res}{res}Gear Ratio{p_end}
{txt}
{com}. drop make
{txt}
{com}. mata: ftools = hash1(st_data(., "_all"))
{res}{txt}
{com}. mata: ftools
{res}  3932563324
{txt}
{com}. mata: bench == ftools
{res}  0
{txt}
{com}. li in 1/10
{txt}
     {c TLC}{hline 8}{c -}{hline 5}{c -}{hline 7}{c -}{hline 10}{c -}{hline 7}{c -}{hline 8}{c -}{hline 8}{c -}{hline 6}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c TRC}
     {c |} {res} price   mpg   rep78   headroom   trunk   weight   length   turn   displa~t   gear_r~o    foreign {txt}{c |}
     {c LT}{hline 8}{c -}{hline 5}{c -}{hline 7}{c -}{hline 10}{c -}{hline 7}{c -}{hline 8}{c -}{hline 8}{c -}{hline 6}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c RT}
  1. {c |} {res} 4,099    22       3        2.5      11    2,930      186     40        121       3.58   Domestic {txt}{c |}
  2. {c |} {res} 4,749    17       3        3.0      11    3,350      173     40        258       2.53   Domestic {txt}{c |}
  3. {c |} {res} 3,799    22       .        3.0      12    2,640      168     35        121       3.08   Domestic {txt}{c |}
  4. {c |} {res} 4,816    20       3        4.5      16    3,250      196     40        196       2.93   Domestic {txt}{c |}
  5. {c |} {res} 7,827    15       4        4.0      20    4,080      222     43        350       2.41   Domestic {txt}{c |}
     {c LT}{hline 8}{c -}{hline 5}{c -}{hline 7}{c -}{hline 10}{c -}{hline 7}{c -}{hline 8}{c -}{hline 8}{c -}{hline 6}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c RT}
  6. {c |} {res} 5,788    18       3        4.0      21    3,670      218     43        231       2.73   Domestic {txt}{c |}
  7. {c |} {res} 4,453    26       .        3.0      10    2,230      170     34        304       2.87   Domestic {txt}{c |}
  8. {c |} {res} 5,189    20       3        2.0      16    3,280      200     42        196       2.93   Domestic {txt}{c |}
  9. {c |} {res}10,372    16       3        3.5      17    3,880      207     43        231       2.93   Domestic {txt}{c |}
 10. {c |} {res} 4,082    19       3        3.5      13    3,400      200     42        231       3.08   Domestic {txt}{c |}
     {c BLC}{hline 8}{c -}{hline 5}{c -}{hline 7}{c -}{hline 10}{c -}{hline 7}{c -}{hline 8}{c -}{hline 8}{c -}{hline 6}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c BRC}

{com}. 
. * TEST SPEED
. clear all
{txt}
{com}. 
. set obs 2000000
{txt}{p}
number of observations (_N)  was 0,
now 2,000,000
{p_end}

{com}. gen long firm = ceil(runiform() * c(N) / 10)
{txt}
{com}. bys firm: gen year = _n
{txt}
{com}. xtset firm year
{res}{txt}{col 8}panel variable:  {res}firm (unbalanced)
{txt}{col 9}time variable:  {res}{col 25}year, 1 to 26
{txt}{col 17}delta:  {res}1 unit
{txt}
{com}. gen double x = rnormal()
{txt}
{com}. gen int y = ceil(runiform() * 10)
{txt}
{com}. 
. // sort year
. loc by year // firm
{txt}
{com}. 
. timer clear
{txt}
{com}. timer on 1
{txt}
{com}. egen double mean_x = mean(x), by(`by')
{txt}
{com}. //egen int max_y = max(y), by(`by')
. timer off 1
{txt}
{com}. 
. //de
. //li in 1/10
. //drop mean_x
. //mata: bench = hash1(st_data(., "_all"))
. //mata: bench
. 
. drop *_*
{txt}
{com}. 
. set trace off
{txt}
{com}. timer on 2
{txt}
{com}. fcollapse (mean) x /*(max) y*/, by(`by') merge fast verbose
{res}{txt}(0 observations deleted)
{res}{txt}(0 hash collisions - 0.00{txt}%)
{txt}(obs: {res}2000000{txt}; levels: {res}26{txt};{txt} method: {res}hash1{txt}; dict size: {res}3000000{txt})
{res}  50:      1.30 /        1 =       1.2980
{txt}
{com}. timer off 2
{txt}
{com}. de, short

{txt}Contains data
  obs:{res}            26                          
{txt} vars:{res}             2                          
{txt} size:{res}           312                          
{txt}Sorted by: {res}year
     Note: Dataset has changed since last saved.
{txt}
{com}. 
. //de
. //li in 1/10
. //drop mean_x
. //mata: ftools = hash1(st_data(., "_all"))
. //mata: ftools
. //mata: bench == ftools
. 
. drop *_*
{txt}
{com}. // this is overoptimistic b/c it doesnt sort back or count MVs...
. timer on 3
{txt}
{com}. bys `by': gen double mean_x = sum(x)
{err}x not found
{txt}{search r(111), local:r(111);}

end of do-file

{search r(111), local:r(111);}

{com}. do demo_fcollapse_merge
{txt}
{com}. cap ado uninstall ftools
{txt}
{com}. net install ftools, from("C:/git/ftools/source")
checking {hilite:ftools} consistency and verifying not already installed...
installing into c:\ado\plus\...
installation complete.
{txt}
{com}. ftools compile
{txt}(compiling lftools.mlib for Stata 14.2)
(library saved in c:\ado\plus/l/lftools.mlib)

{com}. discard
{txt}
{com}. 
. clear all
{txt}
{com}. cls
{txt}
{com}. set more off
{txt}
{com}. 
. * benchmark
. sysuse auto
{txt}(1978 Automobile Data)

{com}. egen double sum_foreign = sum(foreign), by(turn)
{txt}
{com}. egen byte max_foreign = max(foreign), by(turn)
{txt}
{com}. egen int MAX_PRICE = max(price), by(turn)
{txt}
{com}. egen int _freq = count(turn), by(turn)
{txt}
{com}. 
. de *_*

              {txt}storage   display    value
variable name   type    format     label      variable label
{hline}
{p 0 48}{res}{bind:gear_ratio     }{txt}{bind: float   }{bind:{txt}%6.2f     }{space 1}{bind:         }{bind:  }{res}{res}Gear Ratio{p_end}
{p 0 48}{bind:sum_foreign    }{txt}{bind: double  }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:max_foreign    }{txt}{bind: byte    }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:MAX_PRICE      }{txt}{bind: int     }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:_freq          }{txt}{bind: int     }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{txt}
{com}. drop make
{txt}
{com}. mata: bench = hash1(st_data(., "_all"))
{res}{txt}
{com}. mata: bench
{res}  3965372940
{txt}
{com}. li in 1/10
{txt}
     {c TLC}{hline 8}{c -}{hline 5}{c -}{hline 7}{c -}{hline 10}{c -}{hline 7}{c -}{hline 8}{c -}{hline 8}{c -}{hline 6}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 7}{c TRC}
     {c |} {res} price   mpg   rep78   headroom   trunk   weight   length   turn   displa~t   gear_r~o    foreign   sum_fo~n   max_fo~n   MAX_PR~E   _freq {txt}{c |}
     {c LT}{hline 8}{c -}{hline 5}{c -}{hline 7}{c -}{hline 10}{c -}{hline 7}{c -}{hline 8}{c -}{hline 8}{c -}{hline 6}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 7}{c RT}
  1. {c |} {res} 4,099    22       3        2.5      11    2,930      186     40        121       3.58   Domestic          0          0       4816       6 {txt}{c |}
  2. {c |} {res} 4,749    17       3        3.0      11    3,350      173     40        258       2.53   Domestic          0          0       4816       6 {txt}{c |}
  3. {c |} {res} 3,799    22       .        3.0      12    2,640      168     35        121       3.08   Domestic          4          1       6229       6 {txt}{c |}
  4. {c |} {res} 4,816    20       3        4.5      16    3,250      196     40        196       2.93   Domestic          0          0       4816       6 {txt}{c |}
  5. {c |} {res} 7,827    15       4        4.0      20    4,080      222     43        350       2.41   Domestic          0          0      14500      12 {txt}{c |}
     {c LT}{hline 8}{c -}{hline 5}{c -}{hline 7}{c -}{hline 10}{c -}{hline 7}{c -}{hline 8}{c -}{hline 8}{c -}{hline 6}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 7}{c RT}
  6. {c |} {res} 5,788    18       3        4.0      21    3,670      218     43        231       2.73   Domestic          0          0      14500      12 {txt}{c |}
  7. {c |} {res} 4,453    26       .        3.0      10    2,230      170     34        304       2.87   Domestic          4          1       9735       6 {txt}{c |}
  8. {c |} {res} 5,189    20       3        2.0      16    3,280      200     42        196       2.93   Domestic          0          0       5798       7 {txt}{c |}
  9. {c |} {res}10,372    16       3        3.5      17    3,880      207     43        231       2.93   Domestic          0          0      14500      12 {txt}{c |}
 10. {c |} {res} 4,082    19       3        3.5      13    3,400      200     42        231       3.08   Domestic          0          0       5798       7 {txt}{c |}
     {c BLC}{hline 8}{c -}{hline 5}{c -}{hline 7}{c -}{hline 10}{c -}{hline 7}{c -}{hline 8}{c -}{hline 8}{c -}{hline 6}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 7}{c BRC}

{com}. 
. sysuse auto, clear
{txt}(1978 Automobile Data)

{com}. // fcollapse (sum) foreign (max) MAX_PRICE=price foreign, by(turn) merge freq v
. 
. de *_*

              {txt}storage   display    value
variable name   type    format     label      variable label
{hline}
{p 0 48}{res}{bind:gear_ratio     }{txt}{bind: float   }{bind:{txt}%6.2f     }{space 1}{bind:         }{bind:  }{res}{res}Gear Ratio{p_end}
{txt}
{com}. drop make
{txt}
{com}. mata: ftools = hash1(st_data(., "_all"))
{res}{txt}
{com}. mata: ftools
{res}  3932563324
{txt}
{com}. mata: bench == ftools
{res}  0
{txt}
{com}. li in 1/10
{txt}
     {c TLC}{hline 8}{c -}{hline 5}{c -}{hline 7}{c -}{hline 10}{c -}{hline 7}{c -}{hline 8}{c -}{hline 8}{c -}{hline 6}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c TRC}
     {c |} {res} price   mpg   rep78   headroom   trunk   weight   length   turn   displa~t   gear_r~o    foreign {txt}{c |}
     {c LT}{hline 8}{c -}{hline 5}{c -}{hline 7}{c -}{hline 10}{c -}{hline 7}{c -}{hline 8}{c -}{hline 8}{c -}{hline 6}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c RT}
  1. {c |} {res} 4,099    22       3        2.5      11    2,930      186     40        121       3.58   Domestic {txt}{c |}
  2. {c |} {res} 4,749    17       3        3.0      11    3,350      173     40        258       2.53   Domestic {txt}{c |}
  3. {c |} {res} 3,799    22       .        3.0      12    2,640      168     35        121       3.08   Domestic {txt}{c |}
  4. {c |} {res} 4,816    20       3        4.5      16    3,250      196     40        196       2.93   Domestic {txt}{c |}
  5. {c |} {res} 7,827    15       4        4.0      20    4,080      222     43        350       2.41   Domestic {txt}{c |}
     {c LT}{hline 8}{c -}{hline 5}{c -}{hline 7}{c -}{hline 10}{c -}{hline 7}{c -}{hline 8}{c -}{hline 8}{c -}{hline 6}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c RT}
  6. {c |} {res} 5,788    18       3        4.0      21    3,670      218     43        231       2.73   Domestic {txt}{c |}
  7. {c |} {res} 4,453    26       .        3.0      10    2,230      170     34        304       2.87   Domestic {txt}{c |}
  8. {c |} {res} 5,189    20       3        2.0      16    3,280      200     42        196       2.93   Domestic {txt}{c |}
  9. {c |} {res}10,372    16       3        3.5      17    3,880      207     43        231       2.93   Domestic {txt}{c |}
 10. {c |} {res} 4,082    19       3        3.5      13    3,400      200     42        231       3.08   Domestic {txt}{c |}
     {c BLC}{hline 8}{c -}{hline 5}{c -}{hline 7}{c -}{hline 10}{c -}{hline 7}{c -}{hline 8}{c -}{hline 8}{c -}{hline 6}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c BRC}

{com}. 
. * TEST SPEED
. clear all
{txt}
{com}. 
. set obs 1000000
{txt}{p}
number of observations (_N)  was 0,
now 1,000,000
{p_end}

{com}. gen long firm = ceil(runiform() * c(N) / 10)
{txt}
{com}. bys firm: gen year = _n
{txt}
{com}. xtset firm year
{res}{txt}{col 8}panel variable:  {res}firm (unbalanced)
{txt}{col 9}time variable:  {res}{col 25}year, 1 to 27
{txt}{col 17}delta:  {res}1 unit
{txt}
{com}. gen double x = rnormal()
{txt}
{com}. gen int y = ceil(runiform() * 10)
{txt}
{com}. 
. // sort year
. loc by year // firm
{txt}
{com}. 
. timer clear
{txt}
{com}. timer on 1
{txt}
{com}. egen double mean_x = mean(x), by(`by')
{txt}
{com}. //egen int max_y = max(y), by(`by')
. timer off 1
{txt}
{com}. 
. //de
. //li in 1/10
. //drop mean_x
. //mata: bench = hash1(st_data(., "_all"))
. //mata: bench
. 
. drop *_*
{txt}
{com}. 
. set trace off
{txt}
{com}. timer on 2
{txt}
{com}. fcollapse (mean) x /*(max) y*/, by(`by') merge fast verbose
{res}{txt}(0 observations deleted)
{res}{txt}(0 hash collisions - 0.00{txt}%)
{txt}(obs: {res}1000000{txt}; levels: {res}27{txt};{txt} method: {res}hash1{txt}; dict size: {res}1500000{txt})
{res}  50:      0.64 /        1 =       0.6380
{txt}
{com}. timer off 2
{txt}
{com}. de, short

{txt}Contains data
  obs:{res}            27                          
{txt} vars:{res}             2                          
{txt} size:{res}           324                          
{txt}Sorted by: {res}year
     Note: Dataset has changed since last saved.
{txt}
{com}. 
. //de
. //li in 1/10
. //drop mean_x
. //mata: ftools = hash1(st_data(., "_all"))
. //mata: ftools
. //mata: bench == ftools
. 
. drop *_*
{txt}
{com}. // this is overoptimistic b/c it doesnt sort back or count MVs...
. timer on 3
{txt}
{com}. bys `by': gen double mean_x = sum(x)
{err}x not found
{txt}{search r(111), local:r(111);}

end of do-file

{search r(111), local:r(111);}

{com}. do demo_fcollapse_merge
{txt}
{com}. cap ado uninstall ftools
{txt}
{com}. net install ftools, from("C:/git/ftools/source")
checking {hilite:ftools} consistency and verifying not already installed...
installing into c:\ado\plus\...
installation complete.
{txt}
{com}. ftools compile
{txt}(compiling lftools.mlib for Stata 14.2)
(library saved in c:\ado\plus/l/lftools.mlib)

{com}. discard
{txt}
{com}. 
. clear all
{txt}
{com}. cls
{txt}
{com}. set more off
{txt}
{com}. 
. * benchmark
. sysuse auto
{txt}(1978 Automobile Data)

{com}. egen double sum_foreign = sum(foreign), by(turn)
{txt}
{com}. egen byte max_foreign = max(foreign), by(turn)
{txt}
{com}. egen int MAX_PRICE = max(price), by(turn)
{txt}
{com}. egen int _freq = count(turn), by(turn)
{txt}
{com}. 
. de *_*

              {txt}storage   display    value
variable name   type    format     label      variable label
{hline}
{p 0 48}{res}{bind:gear_ratio     }{txt}{bind: float   }{bind:{txt}%6.2f     }{space 1}{bind:         }{bind:  }{res}{res}Gear Ratio{p_end}
{p 0 48}{bind:sum_foreign    }{txt}{bind: double  }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:max_foreign    }{txt}{bind: byte    }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:MAX_PRICE      }{txt}{bind: int     }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:_freq          }{txt}{bind: int     }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{txt}
{com}. drop make
{txt}
{com}. mata: bench = hash1(st_data(., "_all"))
{res}{txt}
{com}. mata: bench
{res}  3965372940
{txt}
{com}. li in 1/10
{txt}
     {c TLC}{hline 8}{c -}{hline 5}{c -}{hline 7}{c -}{hline 10}{c -}{hline 7}{c -}{hline 8}{c -}{hline 8}{c -}{hline 6}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 7}{c TRC}
     {c |} {res} price   mpg   rep78   headroom   trunk   weight   length   turn   displa~t   gear_r~o    foreign   sum_fo~n   max_fo~n   MAX_PR~E   _freq {txt}{c |}
     {c LT}{hline 8}{c -}{hline 5}{c -}{hline 7}{c -}{hline 10}{c -}{hline 7}{c -}{hline 8}{c -}{hline 8}{c -}{hline 6}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 7}{c RT}
  1. {c |} {res} 4,099    22       3        2.5      11    2,930      186     40        121       3.58   Domestic          0          0       4816       6 {txt}{c |}
  2. {c |} {res} 4,749    17       3        3.0      11    3,350      173     40        258       2.53   Domestic          0          0       4816       6 {txt}{c |}
  3. {c |} {res} 3,799    22       .        3.0      12    2,640      168     35        121       3.08   Domestic          4          1       6229       6 {txt}{c |}
  4. {c |} {res} 4,816    20       3        4.5      16    3,250      196     40        196       2.93   Domestic          0          0       4816       6 {txt}{c |}
  5. {c |} {res} 7,827    15       4        4.0      20    4,080      222     43        350       2.41   Domestic          0          0      14500      12 {txt}{c |}
     {c LT}{hline 8}{c -}{hline 5}{c -}{hline 7}{c -}{hline 10}{c -}{hline 7}{c -}{hline 8}{c -}{hline 8}{c -}{hline 6}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 7}{c RT}
  6. {c |} {res} 5,788    18       3        4.0      21    3,670      218     43        231       2.73   Domestic          0          0      14500      12 {txt}{c |}
  7. {c |} {res} 4,453    26       .        3.0      10    2,230      170     34        304       2.87   Domestic          4          1       9735       6 {txt}{c |}
  8. {c |} {res} 5,189    20       3        2.0      16    3,280      200     42        196       2.93   Domestic          0          0       5798       7 {txt}{c |}
  9. {c |} {res}10,372    16       3        3.5      17    3,880      207     43        231       2.93   Domestic          0          0      14500      12 {txt}{c |}
 10. {c |} {res} 4,082    19       3        3.5      13    3,400      200     42        231       3.08   Domestic          0          0       5798       7 {txt}{c |}
     {c BLC}{hline 8}{c -}{hline 5}{c -}{hline 7}{c -}{hline 10}{c -}{hline 7}{c -}{hline 8}{c -}{hline 8}{c -}{hline 6}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 7}{c BRC}

{com}. 
. sysuse auto, clear
{txt}(1978 Automobile Data)

{com}. // fcollapse (sum) foreign (max) MAX_PRICE=price foreign, by(turn) merge freq v
. 
. de *_*

              {txt}storage   display    value
variable name   type    format     label      variable label
{hline}
{p 0 48}{res}{bind:gear_ratio     }{txt}{bind: float   }{bind:{txt}%6.2f     }{space 1}{bind:         }{bind:  }{res}{res}Gear Ratio{p_end}
{txt}
{com}. drop make
{txt}
{com}. mata: ftools = hash1(st_data(., "_all"))
{res}{txt}
{com}. mata: ftools
{res}  3932563324
{txt}
{com}. mata: bench == ftools
{res}  0
{txt}
{com}. li in 1/10
{txt}
     {c TLC}{hline 8}{c -}{hline 5}{c -}{hline 7}{c -}{hline 10}{c -}{hline 7}{c -}{hline 8}{c -}{hline 8}{c -}{hline 6}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c TRC}
     {c |} {res} price   mpg   rep78   headroom   trunk   weight   length   turn   displa~t   gear_r~o    foreign {txt}{c |}
     {c LT}{hline 8}{c -}{hline 5}{c -}{hline 7}{c -}{hline 10}{c -}{hline 7}{c -}{hline 8}{c -}{hline 8}{c -}{hline 6}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c RT}
  1. {c |} {res} 4,099    22       3        2.5      11    2,930      186     40        121       3.58   Domestic {txt}{c |}
  2. {c |} {res} 4,749    17       3        3.0      11    3,350      173     40        258       2.53   Domestic {txt}{c |}
  3. {c |} {res} 3,799    22       .        3.0      12    2,640      168     35        121       3.08   Domestic {txt}{c |}
  4. {c |} {res} 4,816    20       3        4.5      16    3,250      196     40        196       2.93   Domestic {txt}{c |}
  5. {c |} {res} 7,827    15       4        4.0      20    4,080      222     43        350       2.41   Domestic {txt}{c |}
     {c LT}{hline 8}{c -}{hline 5}{c -}{hline 7}{c -}{hline 10}{c -}{hline 7}{c -}{hline 8}{c -}{hline 8}{c -}{hline 6}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c RT}
  6. {c |} {res} 5,788    18       3        4.0      21    3,670      218     43        231       2.73   Domestic {txt}{c |}
  7. {c |} {res} 4,453    26       .        3.0      10    2,230      170     34        304       2.87   Domestic {txt}{c |}
  8. {c |} {res} 5,189    20       3        2.0      16    3,280      200     42        196       2.93   Domestic {txt}{c |}
  9. {c |} {res}10,372    16       3        3.5      17    3,880      207     43        231       2.93   Domestic {txt}{c |}
 10. {c |} {res} 4,082    19       3        3.5      13    3,400      200     42        231       3.08   Domestic {txt}{c |}
     {c BLC}{hline 8}{c -}{hline 5}{c -}{hline 7}{c -}{hline 10}{c -}{hline 7}{c -}{hline 8}{c -}{hline 8}{c -}{hline 6}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c BRC}

{com}. 
. * TEST SPEED
. clear all
{txt}
{com}. 
. set obs 100 // 1000000
{txt}{p}
number of observations (_N)  was 0,
now 100
{p_end}

{com}. gen long firm = ceil(runiform() * c(N) / 10)
{txt}
{com}. bys firm: gen year = _n
{txt}
{com}. xtset firm year
{res}{txt}{col 8}panel variable:  {res}firm (unbalanced)
{txt}{col 9}time variable:  {res}{col 25}year, 1 to 17
{txt}{col 17}delta:  {res}1 unit
{txt}
{com}. gen double x = rnormal()
{txt}
{com}. gen int y = ceil(runiform() * 10)
{txt}
{com}. 
. // sort year
. loc by year // firm
{txt}
{com}. 
. timer clear
{txt}
{com}. timer on 1
{txt}
{com}. egen double mean_x = mean(x), by(`by')
{txt}
{com}. //egen int max_y = max(y), by(`by')
. timer off 1
{txt}
{com}. 
. //de
. //li in 1/10
. //drop mean_x
. //mata: bench = hash1(st_data(., "_all"))
. //mata: bench
. 
. drop *_*
{txt}
{com}. 
. set trace off
{txt}
{com}. timer on 2
{txt}
{com}. fcollapse (mean) x /*(max) y*/, by(`by') merge fast verbose
{res}{txt}(0 observations deleted)
{res}{txt}(14 hash collisions - 14.00{txt}%)
{txt}(obs: {res}100{txt}; levels: {res}17{txt};{txt} method: {res}hash1{txt}; dict size: {res}150{txt})
{res}  50:      0.09 /        1 =       0.0890
{txt}
{com}. timer off 2
{txt}
{com}. de, short

{txt}Contains data
  obs:{res}            17                          
{txt} vars:{res}             2                          
{txt} size:{res}           204                          
{txt}Sorted by: {res}year
     Note: Dataset has changed since last saved.
{txt}
{com}. 
. //de
. //li in 1/10
. //drop mean_x
. //mata: ftools = hash1(st_data(., "_all"))
. //mata: ftools
. //mata: bench == ftools
. 
. drop *_*
{txt}
{com}. // this is overoptimistic b/c it doesnt sort back or count MVs...
. timer on 3
{txt}
{com}. bys `by': gen double mean_x = sum(x)
{err}x not found
{txt}{search r(111), local:r(111);}

end of do-file

{search r(111), local:r(111);}

{com}. de

{txt}Contains data
  obs:{res}            17                          
{txt} vars:{res}             1                          
{txt} size:{res}            68                          
{txt}{hline}
              storage   display    value
variable name   type    format     label      variable label
{hline}
{p 0 48}{res}{bind:year           }{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{txt}{hline}
Sorted by: {res}year
     Note: Dataset has changed since last saved.

{com}. de

{txt}Contains data
  obs:{res}            17                          
{txt} vars:{res}             1                          
{txt} size:{res}            68                          
{txt}{hline}
              storage   display    value
variable name   type    format     label      variable label
{hline}
{p 0 48}{res}{bind:year           }{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{txt}{hline}
Sorted by: {res}year
     Note: Dataset has changed since last saved.

{com}. do demo_fcollapse_merge
{txt}
{com}. cap ado uninstall ftools
{txt}
{com}. net install ftools, from("C:/git/ftools/source")
checking {hilite:ftools} consistency and verifying not already installed...
installing into c:\ado\plus\...
installation complete.
{txt}
{com}. ftools compile
{txt}(compiling lftools.mlib for Stata 14.2)
(library saved in c:\ado\plus/l/lftools.mlib)

{com}. discard
{txt}
{com}. 
. clear all
{txt}
{com}. cls
{txt}
{com}. set more off
{txt}
{com}. 
. * benchmark
. sysuse auto
{txt}(1978 Automobile Data)

{com}. egen double sum_foreign = sum(foreign), by(turn)
{txt}
{com}. egen byte max_foreign = max(foreign), by(turn)
{txt}
{com}. egen int MAX_PRICE = max(price), by(turn)
{txt}
{com}. egen int _freq = count(turn), by(turn)
{txt}
{com}. 
. de *_*

              {txt}storage   display    value
variable name   type    format     label      variable label
{hline}
{p 0 48}{res}{bind:gear_ratio     }{txt}{bind: float   }{bind:{txt}%6.2f     }{space 1}{bind:         }{bind:  }{res}{res}Gear Ratio{p_end}
{p 0 48}{bind:sum_foreign    }{txt}{bind: double  }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:max_foreign    }{txt}{bind: byte    }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:MAX_PRICE      }{txt}{bind: int     }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:_freq          }{txt}{bind: int     }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{txt}
{com}. drop make
{txt}
{com}. mata: bench = hash1(st_data(., "_all"))
{res}{txt}
{com}. mata: bench
{res}  3965372940
{txt}
{com}. li in 1/10
{txt}
     {c TLC}{hline 8}{c -}{hline 5}{c -}{hline 7}{c -}{hline 10}{c -}{hline 7}{c -}{hline 8}{c -}{hline 8}{c -}{hline 6}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 7}{c TRC}
     {c |} {res} price   mpg   rep78   headroom   trunk   weight   length   turn   displa~t   gear_r~o    foreign   sum_fo~n   max_fo~n   MAX_PR~E   _freq {txt}{c |}
     {c LT}{hline 8}{c -}{hline 5}{c -}{hline 7}{c -}{hline 10}{c -}{hline 7}{c -}{hline 8}{c -}{hline 8}{c -}{hline 6}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 7}{c RT}
  1. {c |} {res} 4,099    22       3        2.5      11    2,930      186     40        121       3.58   Domestic          0          0       4816       6 {txt}{c |}
  2. {c |} {res} 4,749    17       3        3.0      11    3,350      173     40        258       2.53   Domestic          0          0       4816       6 {txt}{c |}
  3. {c |} {res} 3,799    22       .        3.0      12    2,640      168     35        121       3.08   Domestic          4          1       6229       6 {txt}{c |}
  4. {c |} {res} 4,816    20       3        4.5      16    3,250      196     40        196       2.93   Domestic          0          0       4816       6 {txt}{c |}
  5. {c |} {res} 7,827    15       4        4.0      20    4,080      222     43        350       2.41   Domestic          0          0      14500      12 {txt}{c |}
     {c LT}{hline 8}{c -}{hline 5}{c -}{hline 7}{c -}{hline 10}{c -}{hline 7}{c -}{hline 8}{c -}{hline 8}{c -}{hline 6}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 7}{c RT}
  6. {c |} {res} 5,788    18       3        4.0      21    3,670      218     43        231       2.73   Domestic          0          0      14500      12 {txt}{c |}
  7. {c |} {res} 4,453    26       .        3.0      10    2,230      170     34        304       2.87   Domestic          4          1       9735       6 {txt}{c |}
  8. {c |} {res} 5,189    20       3        2.0      16    3,280      200     42        196       2.93   Domestic          0          0       5798       7 {txt}{c |}
  9. {c |} {res}10,372    16       3        3.5      17    3,880      207     43        231       2.93   Domestic          0          0      14500      12 {txt}{c |}
 10. {c |} {res} 4,082    19       3        3.5      13    3,400      200     42        231       3.08   Domestic          0          0       5798       7 {txt}{c |}
     {c BLC}{hline 8}{c -}{hline 5}{c -}{hline 7}{c -}{hline 10}{c -}{hline 7}{c -}{hline 8}{c -}{hline 8}{c -}{hline 6}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 7}{c BRC}

{com}. 
. sysuse auto, clear
{txt}(1978 Automobile Data)

{com}. // fcollapse (sum) foreign (max) MAX_PRICE=price foreign, by(turn) merge freq v
. 
. de *_*

              {txt}storage   display    value
variable name   type    format     label      variable label
{hline}
{p 0 48}{res}{bind:gear_ratio     }{txt}{bind: float   }{bind:{txt}%6.2f     }{space 1}{bind:         }{bind:  }{res}{res}Gear Ratio{p_end}
{txt}
{com}. drop make
{txt}
{com}. mata: ftools = hash1(st_data(., "_all"))
{res}{txt}
{com}. mata: ftools
{res}  3932563324
{txt}
{com}. mata: bench == ftools
{res}  0
{txt}
{com}. li in 1/10
{txt}
     {c TLC}{hline 8}{c -}{hline 5}{c -}{hline 7}{c -}{hline 10}{c -}{hline 7}{c -}{hline 8}{c -}{hline 8}{c -}{hline 6}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c TRC}
     {c |} {res} price   mpg   rep78   headroom   trunk   weight   length   turn   displa~t   gear_r~o    foreign {txt}{c |}
     {c LT}{hline 8}{c -}{hline 5}{c -}{hline 7}{c -}{hline 10}{c -}{hline 7}{c -}{hline 8}{c -}{hline 8}{c -}{hline 6}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c RT}
  1. {c |} {res} 4,099    22       3        2.5      11    2,930      186     40        121       3.58   Domestic {txt}{c |}
  2. {c |} {res} 4,749    17       3        3.0      11    3,350      173     40        258       2.53   Domestic {txt}{c |}
  3. {c |} {res} 3,799    22       .        3.0      12    2,640      168     35        121       3.08   Domestic {txt}{c |}
  4. {c |} {res} 4,816    20       3        4.5      16    3,250      196     40        196       2.93   Domestic {txt}{c |}
  5. {c |} {res} 7,827    15       4        4.0      20    4,080      222     43        350       2.41   Domestic {txt}{c |}
     {c LT}{hline 8}{c -}{hline 5}{c -}{hline 7}{c -}{hline 10}{c -}{hline 7}{c -}{hline 8}{c -}{hline 8}{c -}{hline 6}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c RT}
  6. {c |} {res} 5,788    18       3        4.0      21    3,670      218     43        231       2.73   Domestic {txt}{c |}
  7. {c |} {res} 4,453    26       .        3.0      10    2,230      170     34        304       2.87   Domestic {txt}{c |}
  8. {c |} {res} 5,189    20       3        2.0      16    3,280      200     42        196       2.93   Domestic {txt}{c |}
  9. {c |} {res}10,372    16       3        3.5      17    3,880      207     43        231       2.93   Domestic {txt}{c |}
 10. {c |} {res} 4,082    19       3        3.5      13    3,400      200     42        231       3.08   Domestic {txt}{c |}
     {c BLC}{hline 8}{c -}{hline 5}{c -}{hline 7}{c -}{hline 10}{c -}{hline 7}{c -}{hline 8}{c -}{hline 8}{c -}{hline 6}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c BRC}

{com}. 
. * TEST SPEED
. clear all
{txt}
{com}. 
. set obs 100 // 1000000
{txt}{p}
number of observations (_N)  was 0,
now 100
{p_end}

{com}. gen long firm = ceil(runiform() * c(N) / 10)
{txt}
{com}. bys firm: gen year = _n
{txt}
{com}. xtset firm year
{res}{txt}{col 8}panel variable:  {res}firm (unbalanced)
{txt}{col 9}time variable:  {res}{col 25}year, 1 to 17
{txt}{col 17}delta:  {res}1 unit
{txt}
{com}. gen double x = rnormal()
{txt}
{com}. gen int y = ceil(runiform() * 10)
{txt}
{com}. 
. // sort year
. loc by year // firm
{txt}
{com}. 
. timer clear
{txt}
{com}. timer on 1
{txt}
{com}. egen double mean_x = mean(x), by(`by')
{txt}
{com}. //egen int max_y = max(y), by(`by')
. timer off 1
{txt}
{com}. 
. //de
. //li in 1/10
. //drop mean_x
. //mata: bench = hash1(st_data(., "_all"))
. //mata: bench
. 
. drop *_*
{txt}
{com}. 
. set trace off
{txt}
{com}. timer on 2
{txt}
{com}. fcollapse (mean) x /*(max) y*/, by(`by') merge fast verbose
{res}{txt}(0 observations deleted)
{res}{txt}(11 hash collisions - 11.00{txt}%)
{txt}(obs: {res}100{txt}; levels: {res}17{txt};{txt} method: {res}hash1{txt}; dict size: {res}150{txt})
{res}  50:      0.08 /        1 =       0.0780
{txt}
{com}. timer off 2
{txt}
{com}. de, short

{txt}Contains data
  obs:{res}            17                          
{txt} vars:{res}             2                          
{txt} size:{res}           204                          
{txt}Sorted by: {res}year
     Note: Dataset has changed since last saved.
{txt}
{com}. 
. de

{txt}Contains data
  obs:{res}            17                          
{txt} vars:{res}             2                          
{txt} size:{res}           204                          
{txt}{hline}
              storage   display    value
variable name   type    format     label      variable label
{hline}
{p 0 48}{res}{bind:year           }{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:mean_x         }{txt}{bind: double  }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}(mean) x{p_end}
{txt}{hline}
Sorted by: {res}year
     Note: Dataset has changed since last saved.
{txt}
{com}. 
. //de
. //li in 1/10
. //drop mean_x
. //mata: ftools = hash1(st_data(., "_all"))
. //mata: ftools
. //mata: bench == ftools
. 
. drop *_*
{txt}
{com}. // this is overoptimistic b/c it doesnt sort back or count MVs...
. timer on 3
{txt}
{com}. bys `by': gen double mean_x = sum(x)
{err}x not found
{txt}{search r(111), local:r(111);}

end of do-file

{search r(111), local:r(111);}

{com}. de

{txt}Contains data
  obs:{res}            17                          
{txt} vars:{res}             1                          
{txt} size:{res}            68                          
{txt}{hline}
              storage   display    value
variable name   type    format     label      variable label
{hline}
{p 0 48}{res}{bind:year           }{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{txt}{hline}
Sorted by: {res}year
     Note: Dataset has changed since last saved.

{com}. do demo_fcollapse_merge
{txt}
{com}. cap ado uninstall ftools
{txt}
{com}. net install ftools, from("C:/git/ftools/source")
checking {hilite:ftools} consistency and verifying not already installed...
installing into c:\ado\plus\...
installation complete.
{txt}
{com}. ftools compile
{txt}(compiling lftools.mlib for Stata 14.2)
(library saved in c:\ado\plus/l/lftools.mlib)

{com}. discard
{txt}
{com}. 
. clear all
{txt}
{com}. cls
{txt}
{com}. set more off
{txt}
{com}. 
. * benchmark
. sysuse auto
{txt}(1978 Automobile Data)

{com}. egen double sum_foreign = sum(foreign), by(turn)
{txt}
{com}. egen byte max_foreign = max(foreign), by(turn)
{txt}
{com}. egen int MAX_PRICE = max(price), by(turn)
{txt}
{com}. egen int _freq = count(turn), by(turn)
{txt}
{com}. 
. de *_*

              {txt}storage   display    value
variable name   type    format     label      variable label
{hline}
{p 0 48}{res}{bind:gear_ratio     }{txt}{bind: float   }{bind:{txt}%6.2f     }{space 1}{bind:         }{bind:  }{res}{res}Gear Ratio{p_end}
{p 0 48}{bind:sum_foreign    }{txt}{bind: double  }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:max_foreign    }{txt}{bind: byte    }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:MAX_PRICE      }{txt}{bind: int     }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:_freq          }{txt}{bind: int     }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{txt}
{com}. drop make
{txt}
{com}. mata: bench = hash1(st_data(., "_all"))
{res}{txt}
{com}. mata: bench
{res}  3965372940
{txt}
{com}. li in 1/10
{txt}
     {c TLC}{hline 8}{c -}{hline 5}{c -}{hline 7}{c -}{hline 10}{c -}{hline 7}{c -}{hline 8}{c -}{hline 8}{c -}{hline 6}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 7}{c TRC}
     {c |} {res} price   mpg   rep78   headroom   trunk   weight   length   turn   displa~t   gear_r~o    foreign   sum_fo~n   max_fo~n   MAX_PR~E   _freq {txt}{c |}
     {c LT}{hline 8}{c -}{hline 5}{c -}{hline 7}{c -}{hline 10}{c -}{hline 7}{c -}{hline 8}{c -}{hline 8}{c -}{hline 6}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 7}{c RT}
  1. {c |} {res} 4,099    22       3        2.5      11    2,930      186     40        121       3.58   Domestic          0          0       4816       6 {txt}{c |}
  2. {c |} {res} 4,749    17       3        3.0      11    3,350      173     40        258       2.53   Domestic          0          0       4816       6 {txt}{c |}
  3. {c |} {res} 3,799    22       .        3.0      12    2,640      168     35        121       3.08   Domestic          4          1       6229       6 {txt}{c |}
  4. {c |} {res} 4,816    20       3        4.5      16    3,250      196     40        196       2.93   Domestic          0          0       4816       6 {txt}{c |}
  5. {c |} {res} 7,827    15       4        4.0      20    4,080      222     43        350       2.41   Domestic          0          0      14500      12 {txt}{c |}
     {c LT}{hline 8}{c -}{hline 5}{c -}{hline 7}{c -}{hline 10}{c -}{hline 7}{c -}{hline 8}{c -}{hline 8}{c -}{hline 6}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 7}{c RT}
  6. {c |} {res} 5,788    18       3        4.0      21    3,670      218     43        231       2.73   Domestic          0          0      14500      12 {txt}{c |}
  7. {c |} {res} 4,453    26       .        3.0      10    2,230      170     34        304       2.87   Domestic          4          1       9735       6 {txt}{c |}
  8. {c |} {res} 5,189    20       3        2.0      16    3,280      200     42        196       2.93   Domestic          0          0       5798       7 {txt}{c |}
  9. {c |} {res}10,372    16       3        3.5      17    3,880      207     43        231       2.93   Domestic          0          0      14500      12 {txt}{c |}
 10. {c |} {res} 4,082    19       3        3.5      13    3,400      200     42        231       3.08   Domestic          0          0       5798       7 {txt}{c |}
     {c BLC}{hline 8}{c -}{hline 5}{c -}{hline 7}{c -}{hline 10}{c -}{hline 7}{c -}{hline 8}{c -}{hline 8}{c -}{hline 6}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 7}{c BRC}

{com}. 
. sysuse auto, clear
{txt}(1978 Automobile Data)

{com}. // fcollapse (sum) foreign (max) MAX_PRICE=price foreign, by(turn) merge freq v
. 
. de *_*

              {txt}storage   display    value
variable name   type    format     label      variable label
{hline}
{p 0 48}{res}{bind:gear_ratio     }{txt}{bind: float   }{bind:{txt}%6.2f     }{space 1}{bind:         }{bind:  }{res}{res}Gear Ratio{p_end}
{txt}
{com}. drop make
{txt}
{com}. mata: ftools = hash1(st_data(., "_all"))
{res}{txt}
{com}. mata: ftools
{res}  3932563324
{txt}
{com}. mata: bench == ftools
{res}  0
{txt}
{com}. li in 1/10
{txt}
     {c TLC}{hline 8}{c -}{hline 5}{c -}{hline 7}{c -}{hline 10}{c -}{hline 7}{c -}{hline 8}{c -}{hline 8}{c -}{hline 6}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c TRC}
     {c |} {res} price   mpg   rep78   headroom   trunk   weight   length   turn   displa~t   gear_r~o    foreign {txt}{c |}
     {c LT}{hline 8}{c -}{hline 5}{c -}{hline 7}{c -}{hline 10}{c -}{hline 7}{c -}{hline 8}{c -}{hline 8}{c -}{hline 6}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c RT}
  1. {c |} {res} 4,099    22       3        2.5      11    2,930      186     40        121       3.58   Domestic {txt}{c |}
  2. {c |} {res} 4,749    17       3        3.0      11    3,350      173     40        258       2.53   Domestic {txt}{c |}
  3. {c |} {res} 3,799    22       .        3.0      12    2,640      168     35        121       3.08   Domestic {txt}{c |}
  4. {c |} {res} 4,816    20       3        4.5      16    3,250      196     40        196       2.93   Domestic {txt}{c |}
  5. {c |} {res} 7,827    15       4        4.0      20    4,080      222     43        350       2.41   Domestic {txt}{c |}
     {c LT}{hline 8}{c -}{hline 5}{c -}{hline 7}{c -}{hline 10}{c -}{hline 7}{c -}{hline 8}{c -}{hline 8}{c -}{hline 6}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c RT}
  6. {c |} {res} 5,788    18       3        4.0      21    3,670      218     43        231       2.73   Domestic {txt}{c |}
  7. {c |} {res} 4,453    26       .        3.0      10    2,230      170     34        304       2.87   Domestic {txt}{c |}
  8. {c |} {res} 5,189    20       3        2.0      16    3,280      200     42        196       2.93   Domestic {txt}{c |}
  9. {c |} {res}10,372    16       3        3.5      17    3,880      207     43        231       2.93   Domestic {txt}{c |}
 10. {c |} {res} 4,082    19       3        3.5      13    3,400      200     42        231       3.08   Domestic {txt}{c |}
     {c BLC}{hline 8}{c -}{hline 5}{c -}{hline 7}{c -}{hline 10}{c -}{hline 7}{c -}{hline 8}{c -}{hline 8}{c -}{hline 6}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c BRC}

{com}. 
. * TEST SPEED
. clear all
{txt}
{com}. 
. set obs 100 // 1000000
{txt}{p}
number of observations (_N)  was 0,
now 100
{p_end}

{com}. gen long firm = ceil(runiform() * c(N) / 10)
{txt}
{com}. bys firm: gen year = _n
{txt}
{com}. xtset firm year
{res}{txt}{col 8}panel variable:  {res}firm (unbalanced)
{txt}{col 9}time variable:  {res}{col 25}year, 1 to 17
{txt}{col 17}delta:  {res}1 unit
{txt}
{com}. gen double x = rnormal()
{txt}
{com}. gen int y = ceil(runiform() * 10)
{txt}
{com}. 
. // sort year
. loc by year // firm
{txt}
{com}. 
. timer clear
{txt}
{com}. timer on 1
{txt}
{com}. egen double mean_x = mean(x), by(`by')
{txt}
{com}. //egen int max_y = max(y), by(`by')
. timer off 1
{txt}
{com}. 
. //de
. //li in 1/10
. //drop mean_x
. //mata: bench = hash1(st_data(., "_all"))
. //mata: bench
. 
. drop *_*
{txt}
{com}. 
. set trace off
{txt}
{com}. timer on 2
{txt}
{com}. fcollapse (mean) x /*(max) y*/, by(`by') merge fast verbose
{res}{txt}(11 hash collisions - 11.00{txt}%)
{txt}(obs: {res}100{txt}; levels: {res}17{txt};{txt} method: {res}hash1{txt}; dict size: {res}150{txt})
{res}  50:      0.07 /        1 =       0.0720
{txt}
{com}. timer off 2
{txt}
{com}. de, short

{txt}Contains data
  obs:{res}            17                          
{txt} vars:{res}             2                          
{txt} size:{res}           204                          
{txt}Sorted by: {res}year
     Note: Dataset has changed since last saved.
{txt}
{com}. 
. //de
. //li in 1/10
. //drop mean_x
. //mata: ftools = hash1(st_data(., "_all"))
. //mata: ftools
. //mata: bench == ftools
. 
. drop *_*
{txt}
{com}. // this is overoptimistic b/c it doesnt sort back or count MVs...
. timer on 3
{txt}
{com}. bys `by': gen double mean_x = sum(x)
{err}x not found
{txt}{search r(111), local:r(111);}

end of do-file

{search r(111), local:r(111);}

{com}. do demo_fcollapse_merge
{txt}
{com}. cap ado uninstall ftools
{txt}
{com}. net install ftools, from("C:/git/ftools/source")
checking {hilite:ftools} consistency and verifying not already installed...
installing into c:\ado\plus\...
installation complete.
{txt}
{com}. ftools compile
{txt}(compiling lftools.mlib for Stata 14.2)
(library saved in c:\ado\plus/l/lftools.mlib)

{com}. discard
{txt}
{com}. 
. clear all
{txt}
{com}. cls
{txt}
{com}. set more off
{txt}
{com}. 
. * benchmark
. sysuse auto
{txt}(1978 Automobile Data)

{com}. egen double sum_foreign = sum(foreign), by(turn)
{txt}
{com}. egen byte max_foreign = max(foreign), by(turn)
{txt}
{com}. egen int MAX_PRICE = max(price), by(turn)
{txt}
{com}. egen int _freq = count(turn), by(turn)
{txt}
{com}. 
. de *_*

              {txt}storage   display    value
variable name   type    format     label      variable label
{hline}
{p 0 48}{res}{bind:gear_ratio     }{txt}{bind: float   }{bind:{txt}%6.2f     }{space 1}{bind:         }{bind:  }{res}{res}Gear Ratio{p_end}
{p 0 48}{bind:sum_foreign    }{txt}{bind: double  }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:max_foreign    }{txt}{bind: byte    }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:MAX_PRICE      }{txt}{bind: int     }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:_freq          }{txt}{bind: int     }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{txt}
{com}. drop make
{txt}
{com}. mata: bench = hash1(st_data(., "_all"))
{res}{txt}
{com}. mata: bench
{res}  3965372940
{txt}
{com}. li in 1/10
{txt}
     {c TLC}{hline 8}{c -}{hline 5}{c -}{hline 7}{c -}{hline 10}{c -}{hline 7}{c -}{hline 8}{c -}{hline 8}{c -}{hline 6}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 7}{c TRC}
     {c |} {res} price   mpg   rep78   headroom   trunk   weight   length   turn   displa~t   gear_r~o    foreign   sum_fo~n   max_fo~n   MAX_PR~E   _freq {txt}{c |}
     {c LT}{hline 8}{c -}{hline 5}{c -}{hline 7}{c -}{hline 10}{c -}{hline 7}{c -}{hline 8}{c -}{hline 8}{c -}{hline 6}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 7}{c RT}
  1. {c |} {res} 4,099    22       3        2.5      11    2,930      186     40        121       3.58   Domestic          0          0       4816       6 {txt}{c |}
  2. {c |} {res} 4,749    17       3        3.0      11    3,350      173     40        258       2.53   Domestic          0          0       4816       6 {txt}{c |}
  3. {c |} {res} 3,799    22       .        3.0      12    2,640      168     35        121       3.08   Domestic          4          1       6229       6 {txt}{c |}
  4. {c |} {res} 4,816    20       3        4.5      16    3,250      196     40        196       2.93   Domestic          0          0       4816       6 {txt}{c |}
  5. {c |} {res} 7,827    15       4        4.0      20    4,080      222     43        350       2.41   Domestic          0          0      14500      12 {txt}{c |}
     {c LT}{hline 8}{c -}{hline 5}{c -}{hline 7}{c -}{hline 10}{c -}{hline 7}{c -}{hline 8}{c -}{hline 8}{c -}{hline 6}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 7}{c RT}
  6. {c |} {res} 5,788    18       3        4.0      21    3,670      218     43        231       2.73   Domestic          0          0      14500      12 {txt}{c |}
  7. {c |} {res} 4,453    26       .        3.0      10    2,230      170     34        304       2.87   Domestic          4          1       9735       6 {txt}{c |}
  8. {c |} {res} 5,189    20       3        2.0      16    3,280      200     42        196       2.93   Domestic          0          0       5798       7 {txt}{c |}
  9. {c |} {res}10,372    16       3        3.5      17    3,880      207     43        231       2.93   Domestic          0          0      14500      12 {txt}{c |}
 10. {c |} {res} 4,082    19       3        3.5      13    3,400      200     42        231       3.08   Domestic          0          0       5798       7 {txt}{c |}
     {c BLC}{hline 8}{c -}{hline 5}{c -}{hline 7}{c -}{hline 10}{c -}{hline 7}{c -}{hline 8}{c -}{hline 8}{c -}{hline 6}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 7}{c BRC}

{com}. 
. sysuse auto, clear
{txt}(1978 Automobile Data)

{com}. // fcollapse (sum) foreign (max) MAX_PRICE=price foreign, by(turn) merge freq v
. 
. de *_*

              {txt}storage   display    value
variable name   type    format     label      variable label
{hline}
{p 0 48}{res}{bind:gear_ratio     }{txt}{bind: float   }{bind:{txt}%6.2f     }{space 1}{bind:         }{bind:  }{res}{res}Gear Ratio{p_end}
{txt}
{com}. drop make
{txt}
{com}. mata: ftools = hash1(st_data(., "_all"))
{res}{txt}
{com}. mata: ftools
{res}  3932563324
{txt}
{com}. mata: bench == ftools
{res}  0
{txt}
{com}. li in 1/10
{txt}
     {c TLC}{hline 8}{c -}{hline 5}{c -}{hline 7}{c -}{hline 10}{c -}{hline 7}{c -}{hline 8}{c -}{hline 8}{c -}{hline 6}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c TRC}
     {c |} {res} price   mpg   rep78   headroom   trunk   weight   length   turn   displa~t   gear_r~o    foreign {txt}{c |}
     {c LT}{hline 8}{c -}{hline 5}{c -}{hline 7}{c -}{hline 10}{c -}{hline 7}{c -}{hline 8}{c -}{hline 8}{c -}{hline 6}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c RT}
  1. {c |} {res} 4,099    22       3        2.5      11    2,930      186     40        121       3.58   Domestic {txt}{c |}
  2. {c |} {res} 4,749    17       3        3.0      11    3,350      173     40        258       2.53   Domestic {txt}{c |}
  3. {c |} {res} 3,799    22       .        3.0      12    2,640      168     35        121       3.08   Domestic {txt}{c |}
  4. {c |} {res} 4,816    20       3        4.5      16    3,250      196     40        196       2.93   Domestic {txt}{c |}
  5. {c |} {res} 7,827    15       4        4.0      20    4,080      222     43        350       2.41   Domestic {txt}{c |}
     {c LT}{hline 8}{c -}{hline 5}{c -}{hline 7}{c -}{hline 10}{c -}{hline 7}{c -}{hline 8}{c -}{hline 8}{c -}{hline 6}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c RT}
  6. {c |} {res} 5,788    18       3        4.0      21    3,670      218     43        231       2.73   Domestic {txt}{c |}
  7. {c |} {res} 4,453    26       .        3.0      10    2,230      170     34        304       2.87   Domestic {txt}{c |}
  8. {c |} {res} 5,189    20       3        2.0      16    3,280      200     42        196       2.93   Domestic {txt}{c |}
  9. {c |} {res}10,372    16       3        3.5      17    3,880      207     43        231       2.93   Domestic {txt}{c |}
 10. {c |} {res} 4,082    19       3        3.5      13    3,400      200     42        231       3.08   Domestic {txt}{c |}
     {c BLC}{hline 8}{c -}{hline 5}{c -}{hline 7}{c -}{hline 10}{c -}{hline 7}{c -}{hline 8}{c -}{hline 8}{c -}{hline 6}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c BRC}

{com}. 
. * TEST SPEED
. clear all
{txt}
{com}. 
. set obs 100 // 1000000
{txt}{p}
number of observations (_N)  was 0,
now 100
{p_end}

{com}. gen long firm = ceil(runiform() * c(N) / 10)
{txt}
{com}. bys firm: gen year = _n
{txt}
{com}. xtset firm year
{res}{txt}{col 8}panel variable:  {res}firm (unbalanced)
{txt}{col 9}time variable:  {res}{col 25}year, 1 to 14
{txt}{col 17}delta:  {res}1 unit
{txt}
{com}. gen double x = rnormal()
{txt}
{com}. gen int y = ceil(runiform() * 10)
{txt}
{com}. 
. // sort year
. loc by year // firm
{txt}
{com}. 
. timer clear
{txt}
{com}. timer on 1
{txt}
{com}. egen double mean_x = mean(x), by(`by')
{txt}
{com}. //egen int max_y = max(y), by(`by')
. timer off 1
{txt}
{com}. 
. //de
. //li in 1/10
. //drop mean_x
. //mata: bench = hash1(st_data(., "_all"))
. //mata: bench
. 
. drop *_*
{txt}
{com}. 
. set trace off
{txt}
{com}. timer on 2
{txt}
{com}. fcollapse (mean) x /*(max) y*/, by(`by') merge fast verbose
{res}{txt}(0 observations deleted)
{res}{txt}(10 hash collisions - 10.00{txt}%)
{txt}(obs: {res}100{txt}; levels: {res}14{txt};{txt} method: {res}hash1{txt}; dict size: {res}150{txt})
{res}  50:      0.08 /        1 =       0.0790
{txt}
{com}. timer off 2
{txt}
{com}. de, short

{txt}Contains data
  obs:{res}            14                          
{txt} vars:{res}             2                          
{txt} size:{res}           168                          
{txt}Sorted by: {res}year
     Note: Dataset has changed since last saved.
{txt}
{com}. 
. //de
. //li in 1/10
. //drop mean_x
. //mata: ftools = hash1(st_data(., "_all"))
. //mata: ftools
. //mata: bench == ftools
. 
. drop *_*
{txt}
{com}. // this is overoptimistic b/c it doesnt sort back or count MVs...
. timer on 3
{txt}
{com}. bys `by': gen double mean_x = sum(x)
{err}x not found
{txt}{search r(111), local:r(111);}

end of do-file

{search r(111), local:r(111);}

{com}. do demo_fcollapse_merge
{txt}
{com}. cap ado uninstall ftools
{txt}
{com}. net install ftools, from("C:/git/ftools/source")
checking {hilite:ftools} consistency and verifying not already installed...
installing into c:\ado\plus\...
installation complete.
{txt}
{com}. ftools compile
{txt}(compiling lftools.mlib for Stata 14.2)
(library saved in c:\ado\plus/l/lftools.mlib)

{com}. discard
{txt}
{com}. 
. clear all
{txt}
{com}. cls
{txt}
{com}. set more off
{txt}
{com}. 
. * benchmark
. sysuse auto
{txt}(1978 Automobile Data)

{com}. egen double sum_foreign = sum(foreign), by(turn)
{txt}
{com}. egen byte max_foreign = max(foreign), by(turn)
{txt}
{com}. egen int MAX_PRICE = max(price), by(turn)
{txt}
{com}. egen int _freq = count(turn), by(turn)
{txt}
{com}. 
. de *_*

              {txt}storage   display    value
variable name   type    format     label      variable label
{hline}
{p 0 48}{res}{bind:gear_ratio     }{txt}{bind: float   }{bind:{txt}%6.2f     }{space 1}{bind:         }{bind:  }{res}{res}Gear Ratio{p_end}
{p 0 48}{bind:sum_foreign    }{txt}{bind: double  }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:max_foreign    }{txt}{bind: byte    }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:MAX_PRICE      }{txt}{bind: int     }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:_freq          }{txt}{bind: int     }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{txt}
{com}. drop make
{txt}
{com}. mata: bench = hash1(st_data(., "_all"))
{res}{txt}
{com}. mata: bench
{res}  3965372940
{txt}
{com}. li in 1/10
{txt}
     {c TLC}{hline 8}{c -}{hline 5}{c -}{hline 7}{c -}{hline 10}{c -}{hline 7}{c -}{hline 8}{c -}{hline 8}{c -}{hline 6}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 7}{c TRC}
     {c |} {res} price   mpg   rep78   headroom   trunk   weight   length   turn   displa~t   gear_r~o    foreign   sum_fo~n   max_fo~n   MAX_PR~E   _freq {txt}{c |}
     {c LT}{hline 8}{c -}{hline 5}{c -}{hline 7}{c -}{hline 10}{c -}{hline 7}{c -}{hline 8}{c -}{hline 8}{c -}{hline 6}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 7}{c RT}
  1. {c |} {res} 4,099    22       3        2.5      11    2,930      186     40        121       3.58   Domestic          0          0       4816       6 {txt}{c |}
  2. {c |} {res} 4,749    17       3        3.0      11    3,350      173     40        258       2.53   Domestic          0          0       4816       6 {txt}{c |}
  3. {c |} {res} 3,799    22       .        3.0      12    2,640      168     35        121       3.08   Domestic          4          1       6229       6 {txt}{c |}
  4. {c |} {res} 4,816    20       3        4.5      16    3,250      196     40        196       2.93   Domestic          0          0       4816       6 {txt}{c |}
  5. {c |} {res} 7,827    15       4        4.0      20    4,080      222     43        350       2.41   Domestic          0          0      14500      12 {txt}{c |}
     {c LT}{hline 8}{c -}{hline 5}{c -}{hline 7}{c -}{hline 10}{c -}{hline 7}{c -}{hline 8}{c -}{hline 8}{c -}{hline 6}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 7}{c RT}
  6. {c |} {res} 5,788    18       3        4.0      21    3,670      218     43        231       2.73   Domestic          0          0      14500      12 {txt}{c |}
  7. {c |} {res} 4,453    26       .        3.0      10    2,230      170     34        304       2.87   Domestic          4          1       9735       6 {txt}{c |}
  8. {c |} {res} 5,189    20       3        2.0      16    3,280      200     42        196       2.93   Domestic          0          0       5798       7 {txt}{c |}
  9. {c |} {res}10,372    16       3        3.5      17    3,880      207     43        231       2.93   Domestic          0          0      14500      12 {txt}{c |}
 10. {c |} {res} 4,082    19       3        3.5      13    3,400      200     42        231       3.08   Domestic          0          0       5798       7 {txt}{c |}
     {c BLC}{hline 8}{c -}{hline 5}{c -}{hline 7}{c -}{hline 10}{c -}{hline 7}{c -}{hline 8}{c -}{hline 8}{c -}{hline 6}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 7}{c BRC}

{com}. 
. sysuse auto, clear
{txt}(1978 Automobile Data)

{com}. // fcollapse (sum) foreign (max) MAX_PRICE=price foreign, by(turn) merge freq v
. 
. de *_*

              {txt}storage   display    value
variable name   type    format     label      variable label
{hline}
{p 0 48}{res}{bind:gear_ratio     }{txt}{bind: float   }{bind:{txt}%6.2f     }{space 1}{bind:         }{bind:  }{res}{res}Gear Ratio{p_end}
{txt}
{com}. drop make
{txt}
{com}. mata: ftools = hash1(st_data(., "_all"))
{res}{txt}
{com}. mata: ftools
{res}  3932563324
{txt}
{com}. mata: bench == ftools
{res}  0
{txt}
{com}. li in 1/10
{txt}
     {c TLC}{hline 8}{c -}{hline 5}{c -}{hline 7}{c -}{hline 10}{c -}{hline 7}{c -}{hline 8}{c -}{hline 8}{c -}{hline 6}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c TRC}
     {c |} {res} price   mpg   rep78   headroom   trunk   weight   length   turn   displa~t   gear_r~o    foreign {txt}{c |}
     {c LT}{hline 8}{c -}{hline 5}{c -}{hline 7}{c -}{hline 10}{c -}{hline 7}{c -}{hline 8}{c -}{hline 8}{c -}{hline 6}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c RT}
  1. {c |} {res} 4,099    22       3        2.5      11    2,930      186     40        121       3.58   Domestic {txt}{c |}
  2. {c |} {res} 4,749    17       3        3.0      11    3,350      173     40        258       2.53   Domestic {txt}{c |}
  3. {c |} {res} 3,799    22       .        3.0      12    2,640      168     35        121       3.08   Domestic {txt}{c |}
  4. {c |} {res} 4,816    20       3        4.5      16    3,250      196     40        196       2.93   Domestic {txt}{c |}
  5. {c |} {res} 7,827    15       4        4.0      20    4,080      222     43        350       2.41   Domestic {txt}{c |}
     {c LT}{hline 8}{c -}{hline 5}{c -}{hline 7}{c -}{hline 10}{c -}{hline 7}{c -}{hline 8}{c -}{hline 8}{c -}{hline 6}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c RT}
  6. {c |} {res} 5,788    18       3        4.0      21    3,670      218     43        231       2.73   Domestic {txt}{c |}
  7. {c |} {res} 4,453    26       .        3.0      10    2,230      170     34        304       2.87   Domestic {txt}{c |}
  8. {c |} {res} 5,189    20       3        2.0      16    3,280      200     42        196       2.93   Domestic {txt}{c |}
  9. {c |} {res}10,372    16       3        3.5      17    3,880      207     43        231       2.93   Domestic {txt}{c |}
 10. {c |} {res} 4,082    19       3        3.5      13    3,400      200     42        231       3.08   Domestic {txt}{c |}
     {c BLC}{hline 8}{c -}{hline 5}{c -}{hline 7}{c -}{hline 10}{c -}{hline 7}{c -}{hline 8}{c -}{hline 8}{c -}{hline 6}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c BRC}

{com}. 
. * TEST SPEED
. clear all
{txt}
{com}. 
. set obs 100 // 1000000
{txt}{p}
number of observations (_N)  was 0,
now 100
{p_end}

{com}. gen long firm = ceil(runiform() * c(N) / 10)
{txt}
{com}. bys firm: gen year = _n
{txt}
{com}. xtset firm year
{res}{txt}{col 8}panel variable:  {res}firm (unbalanced)
{txt}{col 9}time variable:  {res}{col 25}year, 1 to 15
{txt}{col 17}delta:  {res}1 unit
{txt}
{com}. gen double x = rnormal()
{txt}
{com}. gen int y = ceil(runiform() * 10)
{txt}
{com}. 
. // sort year
. loc by year // firm
{txt}
{com}. 
. timer clear
{txt}
{com}. timer on 1
{txt}
{com}. egen double mean_x = mean(x), by(`by')
{txt}
{com}. //egen int max_y = max(y), by(`by')
. timer off 1
{txt}
{com}. 
. //de
. //li in 1/10
. //drop mean_x
. //mata: bench = hash1(st_data(., "_all"))
. //mata: bench
. 
. drop *_*
{txt}
{com}. 
. set trace off
{txt}
{com}. timer on 2
{txt}
{com}. fcollapse (mean) x /*(max) y*/, by(`by') merge fast verbose
{res}{txt}(0 observations deleted)
{res}{txt}(11 hash collisions - 11.00{txt}%)
{txt}(obs: {res}100{txt}; levels: {res}15{txt};{txt} method: {res}hash1{txt}; dict size: {res}150{txt})
{res}  50:      0.08 /        1 =       0.0780
{txt}
{com}. timer off 2
{txt}
{com}. de, short

{txt}Contains data
  obs:{res}            15                          
{txt} vars:{res}             2                          
{txt} size:{res}           180                          
{txt}Sorted by: {res}year
     Note: Dataset has changed since last saved.
{txt}
{com}. 
. //de
. //li in 1/10
. //drop mean_x
. //mata: ftools = hash1(st_data(., "_all"))
. //mata: ftools
. //mata: bench == ftools
. 
. drop *_*
{txt}
{com}. // this is overoptimistic b/c it doesnt sort back or count MVs...
. timer on 3
{txt}
{com}. bys `by': gen double mean_x = sum(x)
{err}x not found
{txt}{search r(111), local:r(111);}

end of do-file

{search r(111), local:r(111);}

{com}. do demo_fcollapse_merge
{txt}
{com}. cap ado uninstall ftools
{txt}
{com}. net install ftools, from("C:/git/ftools/source")
checking {hilite:ftools} consistency and verifying not already installed...
installing into c:\ado\plus\...
installation complete.
{txt}
{com}. ftools compile
{txt}(compiling lftools.mlib for Stata 14.2)
(library saved in c:\ado\plus/l/lftools.mlib)

{com}. discard
{txt}
{com}. 
. clear all
{txt}
{com}. cls
{txt}
{com}. set more off
{txt}
{com}. 
. * benchmark
. sysuse auto
{txt}(1978 Automobile Data)

{com}. egen double sum_foreign = sum(foreign), by(turn)
{txt}
{com}. egen byte max_foreign = max(foreign), by(turn)
{txt}
{com}. egen int MAX_PRICE = max(price), by(turn)
{txt}
{com}. egen int _freq = count(turn), by(turn)
{txt}
{com}. 
. de *_*

              {txt}storage   display    value
variable name   type    format     label      variable label
{hline}
{p 0 48}{res}{bind:gear_ratio     }{txt}{bind: float   }{bind:{txt}%6.2f     }{space 1}{bind:         }{bind:  }{res}{res}Gear Ratio{p_end}
{p 0 48}{bind:sum_foreign    }{txt}{bind: double  }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:max_foreign    }{txt}{bind: byte    }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:MAX_PRICE      }{txt}{bind: int     }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:_freq          }{txt}{bind: int     }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{txt}
{com}. drop make
{txt}
{com}. mata: bench = hash1(st_data(., "_all"))
{res}{txt}
{com}. mata: bench
{res}  3965372940
{txt}
{com}. li in 1/10
{txt}
     {c TLC}{hline 8}{c -}{hline 5}{c -}{hline 7}{c -}{hline 10}{c -}{hline 7}{c -}{hline 8}{c -}{hline 8}{c -}{hline 6}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 7}{c TRC}
     {c |} {res} price   mpg   rep78   headroom   trunk   weight   length   turn   displa~t   gear_r~o    foreign   sum_fo~n   max_fo~n   MAX_PR~E   _freq {txt}{c |}
     {c LT}{hline 8}{c -}{hline 5}{c -}{hline 7}{c -}{hline 10}{c -}{hline 7}{c -}{hline 8}{c -}{hline 8}{c -}{hline 6}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 7}{c RT}
  1. {c |} {res} 4,099    22       3        2.5      11    2,930      186     40        121       3.58   Domestic          0          0       4816       6 {txt}{c |}
  2. {c |} {res} 4,749    17       3        3.0      11    3,350      173     40        258       2.53   Domestic          0          0       4816       6 {txt}{c |}
  3. {c |} {res} 3,799    22       .        3.0      12    2,640      168     35        121       3.08   Domestic          4          1       6229       6 {txt}{c |}
  4. {c |} {res} 4,816    20       3        4.5      16    3,250      196     40        196       2.93   Domestic          0          0       4816       6 {txt}{c |}
  5. {c |} {res} 7,827    15       4        4.0      20    4,080      222     43        350       2.41   Domestic          0          0      14500      12 {txt}{c |}
     {c LT}{hline 8}{c -}{hline 5}{c -}{hline 7}{c -}{hline 10}{c -}{hline 7}{c -}{hline 8}{c -}{hline 8}{c -}{hline 6}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 7}{c RT}
  6. {c |} {res} 5,788    18       3        4.0      21    3,670      218     43        231       2.73   Domestic          0          0      14500      12 {txt}{c |}
  7. {c |} {res} 4,453    26       .        3.0      10    2,230      170     34        304       2.87   Domestic          4          1       9735       6 {txt}{c |}
  8. {c |} {res} 5,189    20       3        2.0      16    3,280      200     42        196       2.93   Domestic          0          0       5798       7 {txt}{c |}
  9. {c |} {res}10,372    16       3        3.5      17    3,880      207     43        231       2.93   Domestic          0          0      14500      12 {txt}{c |}
 10. {c |} {res} 4,082    19       3        3.5      13    3,400      200     42        231       3.08   Domestic          0          0       5798       7 {txt}{c |}
     {c BLC}{hline 8}{c -}{hline 5}{c -}{hline 7}{c -}{hline 10}{c -}{hline 7}{c -}{hline 8}{c -}{hline 8}{c -}{hline 6}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 7}{c BRC}

{com}. 
. sysuse auto, clear
{txt}(1978 Automobile Data)

{com}. // fcollapse (sum) foreign (max) MAX_PRICE=price foreign, by(turn) merge freq v
. 
. de *_*

              {txt}storage   display    value
variable name   type    format     label      variable label
{hline}
{p 0 48}{res}{bind:gear_ratio     }{txt}{bind: float   }{bind:{txt}%6.2f     }{space 1}{bind:         }{bind:  }{res}{res}Gear Ratio{p_end}
{txt}
{com}. drop make
{txt}
{com}. mata: ftools = hash1(st_data(., "_all"))
{res}{txt}
{com}. mata: ftools
{res}  3932563324
{txt}
{com}. mata: bench == ftools
{res}  0
{txt}
{com}. li in 1/10
{txt}
     {c TLC}{hline 8}{c -}{hline 5}{c -}{hline 7}{c -}{hline 10}{c -}{hline 7}{c -}{hline 8}{c -}{hline 8}{c -}{hline 6}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c TRC}
     {c |} {res} price   mpg   rep78   headroom   trunk   weight   length   turn   displa~t   gear_r~o    foreign {txt}{c |}
     {c LT}{hline 8}{c -}{hline 5}{c -}{hline 7}{c -}{hline 10}{c -}{hline 7}{c -}{hline 8}{c -}{hline 8}{c -}{hline 6}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c RT}
  1. {c |} {res} 4,099    22       3        2.5      11    2,930      186     40        121       3.58   Domestic {txt}{c |}
  2. {c |} {res} 4,749    17       3        3.0      11    3,350      173     40        258       2.53   Domestic {txt}{c |}
  3. {c |} {res} 3,799    22       .        3.0      12    2,640      168     35        121       3.08   Domestic {txt}{c |}
  4. {c |} {res} 4,816    20       3        4.5      16    3,250      196     40        196       2.93   Domestic {txt}{c |}
  5. {c |} {res} 7,827    15       4        4.0      20    4,080      222     43        350       2.41   Domestic {txt}{c |}
     {c LT}{hline 8}{c -}{hline 5}{c -}{hline 7}{c -}{hline 10}{c -}{hline 7}{c -}{hline 8}{c -}{hline 8}{c -}{hline 6}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c RT}
  6. {c |} {res} 5,788    18       3        4.0      21    3,670      218     43        231       2.73   Domestic {txt}{c |}
  7. {c |} {res} 4,453    26       .        3.0      10    2,230      170     34        304       2.87   Domestic {txt}{c |}
  8. {c |} {res} 5,189    20       3        2.0      16    3,280      200     42        196       2.93   Domestic {txt}{c |}
  9. {c |} {res}10,372    16       3        3.5      17    3,880      207     43        231       2.93   Domestic {txt}{c |}
 10. {c |} {res} 4,082    19       3        3.5      13    3,400      200     42        231       3.08   Domestic {txt}{c |}
     {c BLC}{hline 8}{c -}{hline 5}{c -}{hline 7}{c -}{hline 10}{c -}{hline 7}{c -}{hline 8}{c -}{hline 8}{c -}{hline 6}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c BRC}

{com}. 
. * TEST SPEED
. clear all
{txt}
{com}. 
. set obs 100 // 1000000
{txt}{p}
number of observations (_N)  was 0,
now 100
{p_end}

{com}. gen long firm = ceil(runiform() * c(N) / 10)
{txt}
{com}. bys firm: gen year = _n
{txt}
{com}. xtset firm year
{res}{txt}{col 8}panel variable:  {res}firm (unbalanced)
{txt}{col 9}time variable:  {res}{col 25}year, 1 to 16
{txt}{col 17}delta:  {res}1 unit
{txt}
{com}. gen double x = rnormal()
{txt}
{com}. gen int y = ceil(runiform() * 10)
{txt}
{com}. 
. // sort year
. loc by year // firm
{txt}
{com}. 
. timer clear
{txt}
{com}. timer on 1
{txt}
{com}. egen double mean_x = mean(x), by(`by')
{txt}
{com}. //egen int max_y = max(y), by(`by')
. timer off 1
{txt}
{com}. 
. //de
. //li in 1/10
. //drop mean_x
. //mata: bench = hash1(st_data(., "_all"))
. //mata: bench
. 
. drop *_*
{txt}
{com}. 
. set trace off
{txt}
{com}. timer on 2
{txt}
{com}. fcollapse (mean) x /*(max) y*/, by(`by') merge fast verbose
{res}{txt}(0 observations deleted)
{res}{txt}(12 hash collisions - 12.00{txt}%)
{txt}(obs: {res}100{txt}; levels: {res}16{txt};{txt} method: {res}hash1{txt}; dict size: {res}150{txt})
{res}  50:      0.09 /        1 =       0.0870
{txt}
{com}. timer off 2
{txt}
{com}. de, short

{txt}Contains data
  obs:{res}            16                          
{txt} vars:{res}             2                          
{txt} size:{res}           192                          
{txt}Sorted by: {res}year
     Note: Dataset has changed since last saved.
{txt}
{com}. 
. //de
. //li in 1/10
. //drop mean_x
. //mata: ftools = hash1(st_data(., "_all"))
. //mata: ftools
. //mata: bench == ftools
. 
. drop *_*
{txt}
{com}. // this is overoptimistic b/c it doesnt sort back or count MVs...
. timer on 3
{txt}
{com}. bys `by': gen double mean_x = sum(x)
{err}x not found
{txt}{search r(111), local:r(111);}

end of do-file

{search r(111), local:r(111);}

{com}. de

{txt}Contains data
  obs:{res}            16                          
{txt} vars:{res}             1                          
{txt} size:{res}            64                          
{txt}{hline}
              storage   display    value
variable name   type    format     label      variable label
{hline}
{p 0 48}{res}{bind:year           }{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{txt}{hline}
Sorted by: {res}year
     Note: Dataset has changed since last saved.

{com}. de

{txt}Contains data
  obs:{res}            16                          
{txt} vars:{res}             1                          
{txt} size:{res}            64                          
{txt}{hline}
              storage   display    value
variable name   type    format     label      variable label
{hline}
{p 0 48}{res}{bind:year           }{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{txt}{hline}
Sorted by: {res}year
     Note: Dataset has changed since last saved.

{com}. de

{txt}Contains data
  obs:{res}            16                          
{txt} vars:{res}             1                          
{txt} size:{res}            64                          
{txt}{hline}
              storage   display    value
variable name   type    format     label      variable label
{hline}
{p 0 48}{res}{bind:year           }{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{txt}{hline}
Sorted by: {res}year
     Note: Dataset has changed since last saved.

{com}. do demo_fcollapse_merge
{txt}
{com}. cap ado uninstall ftools
{txt}
{com}. net install ftools, from("C:/git/ftools/source")
checking {hilite:ftools} consistency and verifying not already installed...
installing into c:\ado\plus\...
installation complete.
{txt}
{com}. ftools compile
{txt}(compiling lftools.mlib for Stata 14.2)
(library saved in c:\ado\plus/l/lftools.mlib)

{com}. discard
{txt}
{com}. 
. clear all
{txt}
{com}. cls
{txt}
{com}. set more off
{txt}
{com}. 
. * benchmark
. sysuse auto
{txt}(1978 Automobile Data)

{com}. egen double sum_foreign = sum(foreign), by(turn)
{txt}
{com}. egen byte max_foreign = max(foreign), by(turn)
{txt}
{com}. egen int MAX_PRICE = max(price), by(turn)
{txt}
{com}. egen int _freq = count(turn), by(turn)
{txt}
{com}. 
. de *_*

              {txt}storage   display    value
variable name   type    format     label      variable label
{hline}
{p 0 48}{res}{bind:gear_ratio     }{txt}{bind: float   }{bind:{txt}%6.2f     }{space 1}{bind:         }{bind:  }{res}{res}Gear Ratio{p_end}
{p 0 48}{bind:sum_foreign    }{txt}{bind: double  }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:max_foreign    }{txt}{bind: byte    }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:MAX_PRICE      }{txt}{bind: int     }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:_freq          }{txt}{bind: int     }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{txt}
{com}. drop make
{txt}
{com}. mata: bench = hash1(st_data(., "_all"))
{res}{txt}
{com}. mata: bench
{res}  3965372940
{txt}
{com}. li in 1/10
{txt}
     {c TLC}{hline 8}{c -}{hline 5}{c -}{hline 7}{c -}{hline 10}{c -}{hline 7}{c -}{hline 8}{c -}{hline 8}{c -}{hline 6}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 7}{c TRC}
     {c |} {res} price   mpg   rep78   headroom   trunk   weight   length   turn   displa~t   gear_r~o    foreign   sum_fo~n   max_fo~n   MAX_PR~E   _freq {txt}{c |}
     {c LT}{hline 8}{c -}{hline 5}{c -}{hline 7}{c -}{hline 10}{c -}{hline 7}{c -}{hline 8}{c -}{hline 8}{c -}{hline 6}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 7}{c RT}
  1. {c |} {res} 4,099    22       3        2.5      11    2,930      186     40        121       3.58   Domestic          0          0       4816       6 {txt}{c |}
  2. {c |} {res} 4,749    17       3        3.0      11    3,350      173     40        258       2.53   Domestic          0          0       4816       6 {txt}{c |}
  3. {c |} {res} 3,799    22       .        3.0      12    2,640      168     35        121       3.08   Domestic          4          1       6229       6 {txt}{c |}
  4. {c |} {res} 4,816    20       3        4.5      16    3,250      196     40        196       2.93   Domestic          0          0       4816       6 {txt}{c |}
  5. {c |} {res} 7,827    15       4        4.0      20    4,080      222     43        350       2.41   Domestic          0          0      14500      12 {txt}{c |}
     {c LT}{hline 8}{c -}{hline 5}{c -}{hline 7}{c -}{hline 10}{c -}{hline 7}{c -}{hline 8}{c -}{hline 8}{c -}{hline 6}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 7}{c RT}
  6. {c |} {res} 5,788    18       3        4.0      21    3,670      218     43        231       2.73   Domestic          0          0      14500      12 {txt}{c |}
  7. {c |} {res} 4,453    26       .        3.0      10    2,230      170     34        304       2.87   Domestic          4          1       9735       6 {txt}{c |}
  8. {c |} {res} 5,189    20       3        2.0      16    3,280      200     42        196       2.93   Domestic          0          0       5798       7 {txt}{c |}
  9. {c |} {res}10,372    16       3        3.5      17    3,880      207     43        231       2.93   Domestic          0          0      14500      12 {txt}{c |}
 10. {c |} {res} 4,082    19       3        3.5      13    3,400      200     42        231       3.08   Domestic          0          0       5798       7 {txt}{c |}
     {c BLC}{hline 8}{c -}{hline 5}{c -}{hline 7}{c -}{hline 10}{c -}{hline 7}{c -}{hline 8}{c -}{hline 8}{c -}{hline 6}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 7}{c BRC}

{com}. 
. sysuse auto, clear
{txt}(1978 Automobile Data)

{com}. // fcollapse (sum) foreign (max) MAX_PRICE=price foreign, by(turn) merge freq v
. 
. de *_*

              {txt}storage   display    value
variable name   type    format     label      variable label
{hline}
{p 0 48}{res}{bind:gear_ratio     }{txt}{bind: float   }{bind:{txt}%6.2f     }{space 1}{bind:         }{bind:  }{res}{res}Gear Ratio{p_end}
{txt}
{com}. drop make
{txt}
{com}. mata: ftools = hash1(st_data(., "_all"))
{res}{txt}
{com}. mata: ftools
{res}  3932563324
{txt}
{com}. mata: bench == ftools
{res}  0
{txt}
{com}. li in 1/10
{txt}
     {c TLC}{hline 8}{c -}{hline 5}{c -}{hline 7}{c -}{hline 10}{c -}{hline 7}{c -}{hline 8}{c -}{hline 8}{c -}{hline 6}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c TRC}
     {c |} {res} price   mpg   rep78   headroom   trunk   weight   length   turn   displa~t   gear_r~o    foreign {txt}{c |}
     {c LT}{hline 8}{c -}{hline 5}{c -}{hline 7}{c -}{hline 10}{c -}{hline 7}{c -}{hline 8}{c -}{hline 8}{c -}{hline 6}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c RT}
  1. {c |} {res} 4,099    22       3        2.5      11    2,930      186     40        121       3.58   Domestic {txt}{c |}
  2. {c |} {res} 4,749    17       3        3.0      11    3,350      173     40        258       2.53   Domestic {txt}{c |}
  3. {c |} {res} 3,799    22       .        3.0      12    2,640      168     35        121       3.08   Domestic {txt}{c |}
  4. {c |} {res} 4,816    20       3        4.5      16    3,250      196     40        196       2.93   Domestic {txt}{c |}
  5. {c |} {res} 7,827    15       4        4.0      20    4,080      222     43        350       2.41   Domestic {txt}{c |}
     {c LT}{hline 8}{c -}{hline 5}{c -}{hline 7}{c -}{hline 10}{c -}{hline 7}{c -}{hline 8}{c -}{hline 8}{c -}{hline 6}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c RT}
  6. {c |} {res} 5,788    18       3        4.0      21    3,670      218     43        231       2.73   Domestic {txt}{c |}
  7. {c |} {res} 4,453    26       .        3.0      10    2,230      170     34        304       2.87   Domestic {txt}{c |}
  8. {c |} {res} 5,189    20       3        2.0      16    3,280      200     42        196       2.93   Domestic {txt}{c |}
  9. {c |} {res}10,372    16       3        3.5      17    3,880      207     43        231       2.93   Domestic {txt}{c |}
 10. {c |} {res} 4,082    19       3        3.5      13    3,400      200     42        231       3.08   Domestic {txt}{c |}
     {c BLC}{hline 8}{c -}{hline 5}{c -}{hline 7}{c -}{hline 10}{c -}{hline 7}{c -}{hline 8}{c -}{hline 8}{c -}{hline 6}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c BRC}

{com}. 
. * TEST SPEED
. clear all
{txt}
{com}. 
. set obs 100 // 1000000
{txt}{p}
number of observations (_N)  was 0,
now 100
{p_end}

{com}. gen long firm = ceil(runiform() * c(N) / 10)
{txt}
{com}. bys firm: gen year = _n
{txt}
{com}. xtset firm year
{res}{txt}{col 8}panel variable:  {res}firm (unbalanced)
{txt}{col 9}time variable:  {res}{col 25}year, 1 to 15
{txt}{col 17}delta:  {res}1 unit
{txt}
{com}. gen double x = rnormal()
{txt}
{com}. gen int y = ceil(runiform() * 10)
{txt}
{com}. 
. // sort year
. loc by year // firm
{txt}
{com}. 
. timer clear
{txt}
{com}. timer on 1
{txt}
{com}. egen double mean_x = mean(x), by(`by')
{txt}
{com}. //egen int max_y = max(y), by(`by')
. timer off 1
{txt}
{com}. 
. //de
. //li in 1/10
. //drop mean_x
. //mata: bench = hash1(st_data(., "_all"))
. //mata: bench
. 
. drop *_*
{txt}
{com}. 
. set trace off
{txt}
{com}. timer on 2
{txt}
{com}. fcollapse (mean) x /*(max) y*/, by(`by') merge fast verbose
{res}{txt}(11 hash collisions - 11.00{txt}%)
{txt}(obs: {res}100{txt}; levels: {res}15{txt};{txt} method: {res}hash1{txt}; dict size: {res}150{txt})
{res}  50:      0.07 /        1 =       0.0720
{txt}
{com}. timer off 2
{txt}
{com}. de, short

{txt}Contains data
  obs:{res}           100                          
{txt} vars:{res}             5                          
{txt} size:{res}         2,600                          
{txt}Sorted by: {res}firm  year
     Note: Dataset has changed since last saved.
{txt}
{com}. 
. //de
. //li in 1/10
. //drop mean_x
. //mata: ftools = hash1(st_data(., "_all"))
. //mata: ftools
. //mata: bench == ftools
. 
. drop *_*
{txt}
{com}. // this is overoptimistic b/c it doesnt sort back or count MVs...
. timer on 3
{txt}
{com}. bys `by': gen double mean_x = sum(x)
{txt}
{com}. bys `by': replace mean_x = mean_x[_N] / _N
{txt}(99 real changes made)

{com}. timer off 3
{txt}
{com}. 
. drop *_*
{txt}
{com}. 
. timer on 4
{txt}
{com}. fcollapse (mean) x /*(max) y*/, by(`by') fast verbose
{res}{txt}(0 observations deleted)
{res}{txt}(2 hash collisions - 2.00{txt}%)
{txt}(obs: {res}100{txt}; levels: {res}15{txt};{txt} method: {res}hash1{txt}; dict size: {res}150{txt})
{res}  50:      0.00 /        1 =       0.0010
{txt}
{com}. timer off 4
{txt}
{com}. 
. timer list
{res}   1:      0.00 /        1 =       0.0010
   2:      0.16 /        1 =       0.1560
   3:      0.00 /        1 =       0.0000
   4:      0.03 /        1 =       0.0310
{txt}
{com}. 
. 
. 
. exit

{txt}end of do-file


{com}. do demo_fcollapse_merge
{txt}
{com}. cap ado uninstall ftools
{txt}
{com}. net install ftools, from("C:/git/ftools/source")
checking {hilite:ftools} consistency and verifying not already installed...
installing into c:\ado\plus\...
installation complete.
{txt}
{com}. ftools compile
{txt}(compiling lftools.mlib for Stata 14.2)
(library saved in c:\ado\plus/l/lftools.mlib)

{com}. discard
{txt}
{com}. 
. clear all
{txt}
{com}. cls
{txt}
{com}. set more off
{txt}
{com}. 
. * benchmark
. sysuse auto
{txt}(1978 Automobile Data)

{com}. egen double sum_foreign = sum(foreign), by(turn)
{txt}
{com}. egen byte max_foreign = max(foreign), by(turn)
{txt}
{com}. egen int MAX_PRICE = max(price), by(turn)
{txt}
{com}. egen int _freq = count(turn), by(turn)
{txt}
{com}. 
. de *_*

              {txt}storage   display    value
variable name   type    format     label      variable label
{hline}
{p 0 48}{res}{bind:gear_ratio     }{txt}{bind: float   }{bind:{txt}%6.2f     }{space 1}{bind:         }{bind:  }{res}{res}Gear Ratio{p_end}
{p 0 48}{bind:sum_foreign    }{txt}{bind: double  }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:max_foreign    }{txt}{bind: byte    }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:MAX_PRICE      }{txt}{bind: int     }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:_freq          }{txt}{bind: int     }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{txt}
{com}. drop make
{txt}
{com}. mata: bench = hash1(st_data(., "_all"))
{res}{txt}
{com}. mata: bench
{res}  3965372940
{txt}
{com}. li in 1/10
{txt}
     {c TLC}{hline 8}{c -}{hline 5}{c -}{hline 7}{c -}{hline 10}{c -}{hline 7}{c -}{hline 8}{c -}{hline 8}{c -}{hline 6}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 7}{c TRC}
     {c |} {res} price   mpg   rep78   headroom   trunk   weight   length   turn   displa~t   gear_r~o    foreign   sum_fo~n   max_fo~n   MAX_PR~E   _freq {txt}{c |}
     {c LT}{hline 8}{c -}{hline 5}{c -}{hline 7}{c -}{hline 10}{c -}{hline 7}{c -}{hline 8}{c -}{hline 8}{c -}{hline 6}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 7}{c RT}
  1. {c |} {res} 4,099    22       3        2.5      11    2,930      186     40        121       3.58   Domestic          0          0       4816       6 {txt}{c |}
  2. {c |} {res} 4,749    17       3        3.0      11    3,350      173     40        258       2.53   Domestic          0          0       4816       6 {txt}{c |}
  3. {c |} {res} 3,799    22       .        3.0      12    2,640      168     35        121       3.08   Domestic          4          1       6229       6 {txt}{c |}
  4. {c |} {res} 4,816    20       3        4.5      16    3,250      196     40        196       2.93   Domestic          0          0       4816       6 {txt}{c |}
  5. {c |} {res} 7,827    15       4        4.0      20    4,080      222     43        350       2.41   Domestic          0          0      14500      12 {txt}{c |}
     {c LT}{hline 8}{c -}{hline 5}{c -}{hline 7}{c -}{hline 10}{c -}{hline 7}{c -}{hline 8}{c -}{hline 8}{c -}{hline 6}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 7}{c RT}
  6. {c |} {res} 5,788    18       3        4.0      21    3,670      218     43        231       2.73   Domestic          0          0      14500      12 {txt}{c |}
  7. {c |} {res} 4,453    26       .        3.0      10    2,230      170     34        304       2.87   Domestic          4          1       9735       6 {txt}{c |}
  8. {c |} {res} 5,189    20       3        2.0      16    3,280      200     42        196       2.93   Domestic          0          0       5798       7 {txt}{c |}
  9. {c |} {res}10,372    16       3        3.5      17    3,880      207     43        231       2.93   Domestic          0          0      14500      12 {txt}{c |}
 10. {c |} {res} 4,082    19       3        3.5      13    3,400      200     42        231       3.08   Domestic          0          0       5798       7 {txt}{c |}
     {c BLC}{hline 8}{c -}{hline 5}{c -}{hline 7}{c -}{hline 10}{c -}{hline 7}{c -}{hline 8}{c -}{hline 8}{c -}{hline 6}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 7}{c BRC}

{com}. 
. sysuse auto, clear
{txt}(1978 Automobile Data)

{com}. // fcollapse (sum) foreign (max) MAX_PRICE=price foreign, by(turn) merge freq v
. 
. de *_*

              {txt}storage   display    value
variable name   type    format     label      variable label
{hline}
{p 0 48}{res}{bind:gear_ratio     }{txt}{bind: float   }{bind:{txt}%6.2f     }{space 1}{bind:         }{bind:  }{res}{res}Gear Ratio{p_end}
{txt}
{com}. drop make
{txt}
{com}. mata: ftools = hash1(st_data(., "_all"))
{res}{txt}
{com}. mata: ftools
{res}  3932563324
{txt}
{com}. mata: bench == ftools
{res}  0
{txt}
{com}. li in 1/10
{txt}
     {c TLC}{hline 8}{c -}{hline 5}{c -}{hline 7}{c -}{hline 10}{c -}{hline 7}{c -}{hline 8}{c -}{hline 8}{c -}{hline 6}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c TRC}
     {c |} {res} price   mpg   rep78   headroom   trunk   weight   length   turn   displa~t   gear_r~o    foreign {txt}{c |}
     {c LT}{hline 8}{c -}{hline 5}{c -}{hline 7}{c -}{hline 10}{c -}{hline 7}{c -}{hline 8}{c -}{hline 8}{c -}{hline 6}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c RT}
  1. {c |} {res} 4,099    22       3        2.5      11    2,930      186     40        121       3.58   Domestic {txt}{c |}
  2. {c |} {res} 4,749    17       3        3.0      11    3,350      173     40        258       2.53   Domestic {txt}{c |}
  3. {c |} {res} 3,799    22       .        3.0      12    2,640      168     35        121       3.08   Domestic {txt}{c |}
  4. {c |} {res} 4,816    20       3        4.5      16    3,250      196     40        196       2.93   Domestic {txt}{c |}
  5. {c |} {res} 7,827    15       4        4.0      20    4,080      222     43        350       2.41   Domestic {txt}{c |}
     {c LT}{hline 8}{c -}{hline 5}{c -}{hline 7}{c -}{hline 10}{c -}{hline 7}{c -}{hline 8}{c -}{hline 8}{c -}{hline 6}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c RT}
  6. {c |} {res} 5,788    18       3        4.0      21    3,670      218     43        231       2.73   Domestic {txt}{c |}
  7. {c |} {res} 4,453    26       .        3.0      10    2,230      170     34        304       2.87   Domestic {txt}{c |}
  8. {c |} {res} 5,189    20       3        2.0      16    3,280      200     42        196       2.93   Domestic {txt}{c |}
  9. {c |} {res}10,372    16       3        3.5      17    3,880      207     43        231       2.93   Domestic {txt}{c |}
 10. {c |} {res} 4,082    19       3        3.5      13    3,400      200     42        231       3.08   Domestic {txt}{c |}
     {c BLC}{hline 8}{c -}{hline 5}{c -}{hline 7}{c -}{hline 10}{c -}{hline 7}{c -}{hline 8}{c -}{hline 8}{c -}{hline 6}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c BRC}

{com}. 
. * TEST SPEED
. clear all
{txt}
{com}. 
. set obs 100 // 1000000
{txt}{p}
number of observations (_N)  was 0,
now 100
{p_end}

{com}. gen long firm = ceil(runiform() * c(N) / 10)
{txt}
{com}. bys firm: gen year = _n
{txt}
{com}. xtset firm year
{res}{txt}{col 8}panel variable:  {res}firm (unbalanced)
{txt}{col 9}time variable:  {res}{col 25}year, 1 to 16
{txt}{col 17}delta:  {res}1 unit
{txt}
{com}. gen double x = rnormal()
{txt}
{com}. gen int y = ceil(runiform() * 10)
{txt}
{com}. 
. // sort year
. loc by year // firm
{txt}
{com}. 
. timer clear
{txt}
{com}. timer on 1
{txt}
{com}. egen double mean_x = mean(x), by(`by')
{txt}
{com}. //egen int max_y = max(y), by(`by')
. timer off 1
{txt}
{com}. 
. //de
. //li in 1/10
. //drop mean_x
. //mata: bench = hash1(st_data(., "_all"))
. //mata: bench
. 
. drop *_*
{txt}
{com}. 
. set trace off
{txt}
{com}. timer on 2
{txt}
{com}. fcollapse (mean) x /*(max) y*/, by(`by') merge fast verbose
{res}{txt}(12 hash collisions - 12.00{txt}%)
{txt}(obs: {res}100{txt}; levels: {res}16{txt};{txt} method: {res}hash1{txt}; dict size: {res}150{txt})
{res}  50:      0.07 /        1 =       0.0710
{txt}
{com}. timer off 2
{txt}
{com}. de, short

{txt}Contains data
  obs:{res}           100                          
{txt} vars:{res}             5                          
{txt} size:{res}         2,600                          
{txt}Sorted by: {res}firm  year
     Note: Dataset has changed since last saved.
{txt}
{com}. 
. //de
. //li in 1/10
. //drop mean_x
. //mata: ftools = hash1(st_data(., "_all"))
. //mata: ftools
. //mata: bench == ftools
. 
. drop *_*
{txt}
{com}. // this is overoptimistic b/c it doesnt sort back or count MVs...
. timer on 3
{txt}
{com}. bys `by': gen double mean_x = sum(x)
{txt}
{com}. bys `by': replace mean_x = mean_x[_N] / _N
{txt}(99 real changes made)

{com}. timer off 3
{txt}
{com}. 
. drop *_*
{txt}
{com}. 
. timer on 4
{txt}
{com}. fcollapse (mean) x /*(max) y*/, by(`by') fast verbose
{res}{txt}(0 observations deleted)
{res}{txt}(2 hash collisions - 2.00{txt}%)
{txt}(obs: {res}100{txt}; levels: {res}16{txt};{txt} method: {res}hash1{txt}; dict size: {res}150{txt})
{res}  50:      0.00 /        1 =       0.0000
{txt}
{com}. timer off 4
{txt}
{com}. 
. timer list
{res}   1:      0.00 /        1 =       0.0020
   2:      0.16 /        1 =       0.1620
   3:      0.00 /        1 =       0.0000
   4:      0.03 /        1 =       0.0280
{txt}
{com}. 
. 
. 
. exit

{txt}end of do-file


{com}. do demo_fcollapse_merge
{txt}
{com}. cap ado uninstall ftools
{txt}
{com}. net install ftools, from("C:/git/ftools/source")
checking {hilite:ftools} consistency and verifying not already installed...
installing into c:\ado\plus\...
installation complete.
{txt}
{com}. ftools compile
{txt}(compiling lftools.mlib for Stata 14.2)
(library saved in c:\ado\plus/l/lftools.mlib)

{com}. discard
{txt}
{com}. 
. clear all
{txt}
{com}. cls
{txt}
{com}. set more off
{txt}
{com}. 
. * benchmark
. sysuse auto
{txt}(1978 Automobile Data)

{com}. egen double sum_foreign = sum(foreign), by(turn)
{txt}
{com}. egen byte max_foreign = max(foreign), by(turn)
{txt}
{com}. egen int MAX_PRICE = max(price), by(turn)
{txt}
{com}. egen int _freq = count(turn), by(turn)
{txt}
{com}. 
. de *_*

              {txt}storage   display    value
variable name   type    format     label      variable label
{hline}
{p 0 48}{res}{bind:gear_ratio     }{txt}{bind: float   }{bind:{txt}%6.2f     }{space 1}{bind:         }{bind:  }{res}{res}Gear Ratio{p_end}
{p 0 48}{bind:sum_foreign    }{txt}{bind: double  }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:max_foreign    }{txt}{bind: byte    }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:MAX_PRICE      }{txt}{bind: int     }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:_freq          }{txt}{bind: int     }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{txt}
{com}. drop make
{txt}
{com}. mata: bench = hash1(st_data(., "_all"))
{res}{txt}
{com}. mata: bench
{res}  3965372940
{txt}
{com}. li in 1/10
{txt}
     {c TLC}{hline 8}{c -}{hline 5}{c -}{hline 7}{c -}{hline 10}{c -}{hline 7}{c -}{hline 8}{c -}{hline 8}{c -}{hline 6}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 7}{c TRC}
     {c |} {res} price   mpg   rep78   headroom   trunk   weight   length   turn   displa~t   gear_r~o    foreign   sum_fo~n   max_fo~n   MAX_PR~E   _freq {txt}{c |}
     {c LT}{hline 8}{c -}{hline 5}{c -}{hline 7}{c -}{hline 10}{c -}{hline 7}{c -}{hline 8}{c -}{hline 8}{c -}{hline 6}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 7}{c RT}
  1. {c |} {res} 4,099    22       3        2.5      11    2,930      186     40        121       3.58   Domestic          0          0       4816       6 {txt}{c |}
  2. {c |} {res} 4,749    17       3        3.0      11    3,350      173     40        258       2.53   Domestic          0          0       4816       6 {txt}{c |}
  3. {c |} {res} 3,799    22       .        3.0      12    2,640      168     35        121       3.08   Domestic          4          1       6229       6 {txt}{c |}
  4. {c |} {res} 4,816    20       3        4.5      16    3,250      196     40        196       2.93   Domestic          0          0       4816       6 {txt}{c |}
  5. {c |} {res} 7,827    15       4        4.0      20    4,080      222     43        350       2.41   Domestic          0          0      14500      12 {txt}{c |}
     {c LT}{hline 8}{c -}{hline 5}{c -}{hline 7}{c -}{hline 10}{c -}{hline 7}{c -}{hline 8}{c -}{hline 8}{c -}{hline 6}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 7}{c RT}
  6. {c |} {res} 5,788    18       3        4.0      21    3,670      218     43        231       2.73   Domestic          0          0      14500      12 {txt}{c |}
  7. {c |} {res} 4,453    26       .        3.0      10    2,230      170     34        304       2.87   Domestic          4          1       9735       6 {txt}{c |}
  8. {c |} {res} 5,189    20       3        2.0      16    3,280      200     42        196       2.93   Domestic          0          0       5798       7 {txt}{c |}
  9. {c |} {res}10,372    16       3        3.5      17    3,880      207     43        231       2.93   Domestic          0          0      14500      12 {txt}{c |}
 10. {c |} {res} 4,082    19       3        3.5      13    3,400      200     42        231       3.08   Domestic          0          0       5798       7 {txt}{c |}
     {c BLC}{hline 8}{c -}{hline 5}{c -}{hline 7}{c -}{hline 10}{c -}{hline 7}{c -}{hline 8}{c -}{hline 8}{c -}{hline 6}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 7}{c BRC}

{com}. 
. sysuse auto, clear
{txt}(1978 Automobile Data)

{com}. // fcollapse (sum) foreign (max) MAX_PRICE=price foreign, by(turn) merge freq v
. 
. de *_*

              {txt}storage   display    value
variable name   type    format     label      variable label
{hline}
{p 0 48}{res}{bind:gear_ratio     }{txt}{bind: float   }{bind:{txt}%6.2f     }{space 1}{bind:         }{bind:  }{res}{res}Gear Ratio{p_end}
{txt}
{com}. drop make
{txt}
{com}. mata: ftools = hash1(st_data(., "_all"))
{res}{txt}
{com}. mata: ftools
{res}  3932563324
{txt}
{com}. mata: bench == ftools
{res}  0
{txt}
{com}. li in 1/10
{txt}
     {c TLC}{hline 8}{c -}{hline 5}{c -}{hline 7}{c -}{hline 10}{c -}{hline 7}{c -}{hline 8}{c -}{hline 8}{c -}{hline 6}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c TRC}
     {c |} {res} price   mpg   rep78   headroom   trunk   weight   length   turn   displa~t   gear_r~o    foreign {txt}{c |}
     {c LT}{hline 8}{c -}{hline 5}{c -}{hline 7}{c -}{hline 10}{c -}{hline 7}{c -}{hline 8}{c -}{hline 8}{c -}{hline 6}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c RT}
  1. {c |} {res} 4,099    22       3        2.5      11    2,930      186     40        121       3.58   Domestic {txt}{c |}
  2. {c |} {res} 4,749    17       3        3.0      11    3,350      173     40        258       2.53   Domestic {txt}{c |}
  3. {c |} {res} 3,799    22       .        3.0      12    2,640      168     35        121       3.08   Domestic {txt}{c |}
  4. {c |} {res} 4,816    20       3        4.5      16    3,250      196     40        196       2.93   Domestic {txt}{c |}
  5. {c |} {res} 7,827    15       4        4.0      20    4,080      222     43        350       2.41   Domestic {txt}{c |}
     {c LT}{hline 8}{c -}{hline 5}{c -}{hline 7}{c -}{hline 10}{c -}{hline 7}{c -}{hline 8}{c -}{hline 8}{c -}{hline 6}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c RT}
  6. {c |} {res} 5,788    18       3        4.0      21    3,670      218     43        231       2.73   Domestic {txt}{c |}
  7. {c |} {res} 4,453    26       .        3.0      10    2,230      170     34        304       2.87   Domestic {txt}{c |}
  8. {c |} {res} 5,189    20       3        2.0      16    3,280      200     42        196       2.93   Domestic {txt}{c |}
  9. {c |} {res}10,372    16       3        3.5      17    3,880      207     43        231       2.93   Domestic {txt}{c |}
 10. {c |} {res} 4,082    19       3        3.5      13    3,400      200     42        231       3.08   Domestic {txt}{c |}
     {c BLC}{hline 8}{c -}{hline 5}{c -}{hline 7}{c -}{hline 10}{c -}{hline 7}{c -}{hline 8}{c -}{hline 8}{c -}{hline 6}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c BRC}

{com}. 
. * TEST SPEED
. clear all
{txt}
{com}. 
. set obs 100 // 1000000
{txt}{p}
number of observations (_N)  was 0,
now 100
{p_end}

{com}. gen long firm = ceil(runiform() * c(N) / 10)
{txt}
{com}. bys firm: gen year = _n
{txt}
{com}. xtset firm year
{res}{txt}{col 8}panel variable:  {res}firm (unbalanced)
{txt}{col 9}time variable:  {res}{col 25}year, 1 to 14
{txt}{col 17}delta:  {res}1 unit
{txt}
{com}. gen double x = rnormal()
{txt}
{com}. gen int y = ceil(runiform() * 10)
{txt}
{com}. 
. // sort year
. loc by year // firm
{txt}
{com}. 
. timer clear
{txt}
{com}. timer on 1
{txt}
{com}. egen double mean_x = mean(x), by(`by')
{txt}
{com}. //egen int max_y = max(y), by(`by')
. timer off 1
{txt}
{com}. 
. //de
. //li in 1/10
. //drop mean_x
. //mata: bench = hash1(st_data(., "_all"))
. //mata: bench
. 
. drop *_*
{txt}
{com}. 
. set trace off
{txt}
{com}. timer on 2
{txt}
{com}. fcollapse (mean) x /*(max) y*/, by(`by') merge fast verbose
{res}{txt}(0 observations deleted)
{res}{txt}(12 hash collisions - 12.00{txt}%)
{txt}(obs: {res}100{txt}; levels: {res}14{txt};{txt} method: {res}hash1{txt}; dict size: {res}150{txt})
{bf}{err}F.touse{sf} is not a valid command name
{txt}{search r(199), local:r(199);}

end of do-file

{search r(199), local:r(199);}

{com}. do demo_fcollapse_merge
{txt}
{com}. cap ado uninstall ftools
{txt}
{com}. net install ftools, from("C:/git/ftools/source")
checking {hilite:ftools} consistency and verifying not already installed...
installing into c:\ado\plus\...
installation complete.
{txt}
{com}. ftools compile
{txt}(compiling lftools.mlib for Stata 14.2)
(library saved in c:\ado\plus/l/lftools.mlib)

{com}. discard
{txt}
{com}. 
. clear all
{txt}
{com}. cls
{txt}
{com}. set more off
{txt}
{com}. 
. * benchmark
. sysuse auto
{txt}(1978 Automobile Data)

{com}. egen double sum_foreign = sum(foreign), by(turn)
{txt}
{com}. egen byte max_foreign = max(foreign), by(turn)
{txt}
{com}. egen int MAX_PRICE = max(price), by(turn)
{txt}
{com}. egen int _freq = count(turn), by(turn)
{txt}
{com}. 
. de *_*

              {txt}storage   display    value
variable name   type    format     label      variable label
{hline}
{p 0 48}{res}{bind:gear_ratio     }{txt}{bind: float   }{bind:{txt}%6.2f     }{space 1}{bind:         }{bind:  }{res}{res}Gear Ratio{p_end}
{p 0 48}{bind:sum_foreign    }{txt}{bind: double  }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:max_foreign    }{txt}{bind: byte    }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:MAX_PRICE      }{txt}{bind: int     }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:_freq          }{txt}{bind: int     }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{txt}
{com}. drop make
{txt}
{com}. mata: bench = hash1(st_data(., "_all"))
{res}{txt}
{com}. mata: bench
{res}  3965372940
{txt}
{com}. li in 1/10
{txt}
     {c TLC}{hline 8}{c -}{hline 5}{c -}{hline 7}{c -}{hline 10}{c -}{hline 7}{c -}{hline 8}{c -}{hline 8}{c -}{hline 6}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 7}{c TRC}
     {c |} {res} price   mpg   rep78   headroom   trunk   weight   length   turn   displa~t   gear_r~o    foreign   sum_fo~n   max_fo~n   MAX_PR~E   _freq {txt}{c |}
     {c LT}{hline 8}{c -}{hline 5}{c -}{hline 7}{c -}{hline 10}{c -}{hline 7}{c -}{hline 8}{c -}{hline 8}{c -}{hline 6}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 7}{c RT}
  1. {c |} {res} 4,099    22       3        2.5      11    2,930      186     40        121       3.58   Domestic          0          0       4816       6 {txt}{c |}
  2. {c |} {res} 4,749    17       3        3.0      11    3,350      173     40        258       2.53   Domestic          0          0       4816       6 {txt}{c |}
  3. {c |} {res} 3,799    22       .        3.0      12    2,640      168     35        121       3.08   Domestic          4          1       6229       6 {txt}{c |}
  4. {c |} {res} 4,816    20       3        4.5      16    3,250      196     40        196       2.93   Domestic          0          0       4816       6 {txt}{c |}
  5. {c |} {res} 7,827    15       4        4.0      20    4,080      222     43        350       2.41   Domestic          0          0      14500      12 {txt}{c |}
     {c LT}{hline 8}{c -}{hline 5}{c -}{hline 7}{c -}{hline 10}{c -}{hline 7}{c -}{hline 8}{c -}{hline 8}{c -}{hline 6}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 7}{c RT}
  6. {c |} {res} 5,788    18       3        4.0      21    3,670      218     43        231       2.73   Domestic          0          0      14500      12 {txt}{c |}
  7. {c |} {res} 4,453    26       .        3.0      10    2,230      170     34        304       2.87   Domestic          4          1       9735       6 {txt}{c |}
  8. {c |} {res} 5,189    20       3        2.0      16    3,280      200     42        196       2.93   Domestic          0          0       5798       7 {txt}{c |}
  9. {c |} {res}10,372    16       3        3.5      17    3,880      207     43        231       2.93   Domestic          0          0      14500      12 {txt}{c |}
 10. {c |} {res} 4,082    19       3        3.5      13    3,400      200     42        231       3.08   Domestic          0          0       5798       7 {txt}{c |}
     {c BLC}{hline 8}{c -}{hline 5}{c -}{hline 7}{c -}{hline 10}{c -}{hline 7}{c -}{hline 8}{c -}{hline 8}{c -}{hline 6}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 7}{c BRC}

{com}. 
. sysuse auto, clear
{txt}(1978 Automobile Data)

{com}. // fcollapse (sum) foreign (max) MAX_PRICE=price foreign, by(turn) merge freq v
. 
. de *_*

              {txt}storage   display    value
variable name   type    format     label      variable label
{hline}
{p 0 48}{res}{bind:gear_ratio     }{txt}{bind: float   }{bind:{txt}%6.2f     }{space 1}{bind:         }{bind:  }{res}{res}Gear Ratio{p_end}
{txt}
{com}. drop make
{txt}
{com}. mata: ftools = hash1(st_data(., "_all"))
{res}{txt}
{com}. mata: ftools
{res}  3932563324
{txt}
{com}. mata: bench == ftools
{res}  0
{txt}
{com}. li in 1/10
{txt}
     {c TLC}{hline 8}{c -}{hline 5}{c -}{hline 7}{c -}{hline 10}{c -}{hline 7}{c -}{hline 8}{c -}{hline 8}{c -}{hline 6}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c TRC}
     {c |} {res} price   mpg   rep78   headroom   trunk   weight   length   turn   displa~t   gear_r~o    foreign {txt}{c |}
     {c LT}{hline 8}{c -}{hline 5}{c -}{hline 7}{c -}{hline 10}{c -}{hline 7}{c -}{hline 8}{c -}{hline 8}{c -}{hline 6}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c RT}
  1. {c |} {res} 4,099    22       3        2.5      11    2,930      186     40        121       3.58   Domestic {txt}{c |}
  2. {c |} {res} 4,749    17       3        3.0      11    3,350      173     40        258       2.53   Domestic {txt}{c |}
  3. {c |} {res} 3,799    22       .        3.0      12    2,640      168     35        121       3.08   Domestic {txt}{c |}
  4. {c |} {res} 4,816    20       3        4.5      16    3,250      196     40        196       2.93   Domestic {txt}{c |}
  5. {c |} {res} 7,827    15       4        4.0      20    4,080      222     43        350       2.41   Domestic {txt}{c |}
     {c LT}{hline 8}{c -}{hline 5}{c -}{hline 7}{c -}{hline 10}{c -}{hline 7}{c -}{hline 8}{c -}{hline 8}{c -}{hline 6}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c RT}
  6. {c |} {res} 5,788    18       3        4.0      21    3,670      218     43        231       2.73   Domestic {txt}{c |}
  7. {c |} {res} 4,453    26       .        3.0      10    2,230      170     34        304       2.87   Domestic {txt}{c |}
  8. {c |} {res} 5,189    20       3        2.0      16    3,280      200     42        196       2.93   Domestic {txt}{c |}
  9. {c |} {res}10,372    16       3        3.5      17    3,880      207     43        231       2.93   Domestic {txt}{c |}
 10. {c |} {res} 4,082    19       3        3.5      13    3,400      200     42        231       3.08   Domestic {txt}{c |}
     {c BLC}{hline 8}{c -}{hline 5}{c -}{hline 7}{c -}{hline 10}{c -}{hline 7}{c -}{hline 8}{c -}{hline 8}{c -}{hline 6}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c BRC}

{com}. 
. * TEST SPEED
. clear all
{txt}
{com}. 
. set obs 100 // 1000000
{txt}{p}
number of observations (_N)  was 0,
now 100
{p_end}

{com}. gen long firm = ceil(runiform() * c(N) / 10)
{txt}
{com}. bys firm: gen year = _n
{txt}
{com}. xtset firm year
{res}{txt}{col 8}panel variable:  {res}firm (unbalanced)
{txt}{col 9}time variable:  {res}{col 25}year, 1 to 20
{txt}{col 17}delta:  {res}1 unit
{txt}
{com}. gen double x = rnormal()
{txt}
{com}. gen int y = ceil(runiform() * 10)
{txt}
{com}. 
. // sort year
. loc by year // firm
{txt}
{com}. 
. timer clear
{txt}
{com}. timer on 1
{txt}
{com}. egen double mean_x = mean(x), by(`by')
{txt}
{com}. //egen int max_y = max(y), by(`by')
. timer off 1
{txt}
{com}. 
. //de
. //li in 1/10
. //drop mean_x
. //mata: bench = hash1(st_data(., "_all"))
. //mata: bench
. 
. drop *_*
{txt}
{com}. 
. set trace off
{txt}
{com}. timer on 2
{txt}
{com}. fcollapse (mean) x /*(max) y*/, by(`by') merge fast verbose
{res}{txt}(0 observations deleted)
{res}{txt}(11 hash collisions - 11.00{txt}%)
{txt}(obs: {res}100{txt}; levels: {res}20{txt};{txt} method: {res}hash1{txt}; dict size: {res}150{txt})
{res}  50:      0.08 /        1 =       0.0780
{err}@ invalid name
               st_data():  3500  invalid Stata variable name
            f_collapse():     -  function returned error
                 <istmt>:     -  function returned error
{txt}{search r(3500), local:r(3500);}

end of do-file

{search r(3500), local:r(3500);}

{com}. do demo_fcollapse_merge
{txt}
{com}. cap ado uninstall ftools
{txt}
{com}. net install ftools, from("C:/git/ftools/source")
checking {hilite:ftools} consistency and verifying not already installed...
installing into c:\ado\plus\...
installation complete.
{txt}
{com}. ftools compile
{txt}(compiling lftools.mlib for Stata 14.2)
(library saved in c:\ado\plus/l/lftools.mlib)

{com}. discard
{txt}
{com}. 
. clear all
{txt}
{com}. cls
{txt}
{com}. set more off
{txt}
{com}. 
. * benchmark
. sysuse auto
{txt}(1978 Automobile Data)

{com}. egen double sum_foreign = sum(foreign), by(turn)
{txt}
{com}. egen byte max_foreign = max(foreign), by(turn)
{txt}
{com}. egen int MAX_PRICE = max(price), by(turn)
{txt}
{com}. egen int _freq = count(turn), by(turn)
{txt}
{com}. 
. de *_*

              {txt}storage   display    value
variable name   type    format     label      variable label
{hline}
{p 0 48}{res}{bind:gear_ratio     }{txt}{bind: float   }{bind:{txt}%6.2f     }{space 1}{bind:         }{bind:  }{res}{res}Gear Ratio{p_end}
{p 0 48}{bind:sum_foreign    }{txt}{bind: double  }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:max_foreign    }{txt}{bind: byte    }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:MAX_PRICE      }{txt}{bind: int     }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:_freq          }{txt}{bind: int     }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{txt}
{com}. drop make
{txt}
{com}. mata: bench = hash1(st_data(., "_all"))
{res}{txt}
{com}. mata: bench
{res}  3965372940
{txt}
{com}. li in 1/10
{txt}
     {c TLC}{hline 8}{c -}{hline 5}{c -}{hline 7}{c -}{hline 10}{c -}{hline 7}{c -}{hline 8}{c -}{hline 8}{c -}{hline 6}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 7}{c TRC}
     {c |} {res} price   mpg   rep78   headroom   trunk   weight   length   turn   displa~t   gear_r~o    foreign   sum_fo~n   max_fo~n   MAX_PR~E   _freq {txt}{c |}
     {c LT}{hline 8}{c -}{hline 5}{c -}{hline 7}{c -}{hline 10}{c -}{hline 7}{c -}{hline 8}{c -}{hline 8}{c -}{hline 6}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 7}{c RT}
  1. {c |} {res} 4,099    22       3        2.5      11    2,930      186     40        121       3.58   Domestic          0          0       4816       6 {txt}{c |}
  2. {c |} {res} 4,749    17       3        3.0      11    3,350      173     40        258       2.53   Domestic          0          0       4816       6 {txt}{c |}
  3. {c |} {res} 3,799    22       .        3.0      12    2,640      168     35        121       3.08   Domestic          4          1       6229       6 {txt}{c |}
  4. {c |} {res} 4,816    20       3        4.5      16    3,250      196     40        196       2.93   Domestic          0          0       4816       6 {txt}{c |}
  5. {c |} {res} 7,827    15       4        4.0      20    4,080      222     43        350       2.41   Domestic          0          0      14500      12 {txt}{c |}
     {c LT}{hline 8}{c -}{hline 5}{c -}{hline 7}{c -}{hline 10}{c -}{hline 7}{c -}{hline 8}{c -}{hline 8}{c -}{hline 6}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 7}{c RT}
  6. {c |} {res} 5,788    18       3        4.0      21    3,670      218     43        231       2.73   Domestic          0          0      14500      12 {txt}{c |}
  7. {c |} {res} 4,453    26       .        3.0      10    2,230      170     34        304       2.87   Domestic          4          1       9735       6 {txt}{c |}
  8. {c |} {res} 5,189    20       3        2.0      16    3,280      200     42        196       2.93   Domestic          0          0       5798       7 {txt}{c |}
  9. {c |} {res}10,372    16       3        3.5      17    3,880      207     43        231       2.93   Domestic          0          0      14500      12 {txt}{c |}
 10. {c |} {res} 4,082    19       3        3.5      13    3,400      200     42        231       3.08   Domestic          0          0       5798       7 {txt}{c |}
     {c BLC}{hline 8}{c -}{hline 5}{c -}{hline 7}{c -}{hline 10}{c -}{hline 7}{c -}{hline 8}{c -}{hline 8}{c -}{hline 6}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 7}{c BRC}

{com}. 
. sysuse auto, clear
{txt}(1978 Automobile Data)

{com}. // fcollapse (sum) foreign (max) MAX_PRICE=price foreign, by(turn) merge freq v
. 
. de *_*

              {txt}storage   display    value
variable name   type    format     label      variable label
{hline}
{p 0 48}{res}{bind:gear_ratio     }{txt}{bind: float   }{bind:{txt}%6.2f     }{space 1}{bind:         }{bind:  }{res}{res}Gear Ratio{p_end}
{txt}
{com}. drop make
{txt}
{com}. mata: ftools = hash1(st_data(., "_all"))
{res}{txt}
{com}. mata: ftools
{res}  3932563324
{txt}
{com}. mata: bench == ftools
{res}  0
{txt}
{com}. li in 1/10
{txt}
     {c TLC}{hline 8}{c -}{hline 5}{c -}{hline 7}{c -}{hline 10}{c -}{hline 7}{c -}{hline 8}{c -}{hline 8}{c -}{hline 6}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c TRC}
     {c |} {res} price   mpg   rep78   headroom   trunk   weight   length   turn   displa~t   gear_r~o    foreign {txt}{c |}
     {c LT}{hline 8}{c -}{hline 5}{c -}{hline 7}{c -}{hline 10}{c -}{hline 7}{c -}{hline 8}{c -}{hline 8}{c -}{hline 6}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c RT}
  1. {c |} {res} 4,099    22       3        2.5      11    2,930      186     40        121       3.58   Domestic {txt}{c |}
  2. {c |} {res} 4,749    17       3        3.0      11    3,350      173     40        258       2.53   Domestic {txt}{c |}
  3. {c |} {res} 3,799    22       .        3.0      12    2,640      168     35        121       3.08   Domestic {txt}{c |}
  4. {c |} {res} 4,816    20       3        4.5      16    3,250      196     40        196       2.93   Domestic {txt}{c |}
  5. {c |} {res} 7,827    15       4        4.0      20    4,080      222     43        350       2.41   Domestic {txt}{c |}
     {c LT}{hline 8}{c -}{hline 5}{c -}{hline 7}{c -}{hline 10}{c -}{hline 7}{c -}{hline 8}{c -}{hline 8}{c -}{hline 6}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c RT}
  6. {c |} {res} 5,788    18       3        4.0      21    3,670      218     43        231       2.73   Domestic {txt}{c |}
  7. {c |} {res} 4,453    26       .        3.0      10    2,230      170     34        304       2.87   Domestic {txt}{c |}
  8. {c |} {res} 5,189    20       3        2.0      16    3,280      200     42        196       2.93   Domestic {txt}{c |}
  9. {c |} {res}10,372    16       3        3.5      17    3,880      207     43        231       2.93   Domestic {txt}{c |}
 10. {c |} {res} 4,082    19       3        3.5      13    3,400      200     42        231       3.08   Domestic {txt}{c |}
     {c BLC}{hline 8}{c -}{hline 5}{c -}{hline 7}{c -}{hline 10}{c -}{hline 7}{c -}{hline 8}{c -}{hline 8}{c -}{hline 6}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c BRC}

{com}. 
. * TEST SPEED
. clear all
{txt}
{com}. 
. set obs 100 // 1000000
{txt}{p}
number of observations (_N)  was 0,
now 100
{p_end}

{com}. gen long firm = ceil(runiform() * c(N) / 10)
{txt}
{com}. bys firm: gen year = _n
{txt}
{com}. xtset firm year
{res}{txt}{col 8}panel variable:  {res}firm (unbalanced)
{txt}{col 9}time variable:  {res}{col 25}year, 1 to 15
{txt}{col 17}delta:  {res}1 unit
{txt}
{com}. gen double x = rnormal()
{txt}
{com}. gen int y = ceil(runiform() * 10)
{txt}
{com}. 
. // sort year
. loc by year // firm
{txt}
{com}. 
. timer clear
{txt}
{com}. timer on 1
{txt}
{com}. egen double mean_x = mean(x), by(`by')
{txt}
{com}. //egen int max_y = max(y), by(`by')
. timer off 1
{txt}
{com}. 
. //de
. //li in 1/10
. //drop mean_x
. //mata: bench = hash1(st_data(., "_all"))
. //mata: bench
. 
. drop *_*
{txt}
{com}. 
. set trace off
{txt}
{com}. timer on 2
{txt}
{com}. fcollapse (mean) x /*(max) y*/, by(`by') merge fast verbose
{res}{txt}(0 observations deleted)
{res}{txt}(11 hash collisions - 11.00{txt}%)
{txt}(obs: {res}100{txt}; levels: {res}15{txt};{txt} method: {res}hash1{txt}; dict size: {res}150{txt})
{res}  50:      0.09 /        1 =       0.0920
{txt}
{com}. timer off 2
{txt}
{com}. de, short

{txt}Contains data
  obs:{res}           100                          
{txt} vars:{res}             5                          
{txt} size:{res}         2,600                          
{txt}Sorted by: {res}firm  year
     Note: Dataset has changed since last saved.
{txt}
{com}. 
. //de
. //li in 1/10
. //drop mean_x
. //mata: ftools = hash1(st_data(., "_all"))
. //mata: ftools
. //mata: bench == ftools
. 
. drop *_*
{txt}
{com}. // this is overoptimistic b/c it doesnt sort back or count MVs...
. timer on 3
{txt}
{com}. bys `by': gen double mean_x = sum(x)
{txt}
{com}. bys `by': replace mean_x = mean_x[_N] / _N
{txt}(98 real changes made)

{com}. timer off 3
{txt}
{com}. 
. drop *_*
{txt}
{com}. 
. timer on 4
{txt}
{com}. fcollapse (mean) x /*(max) y*/, by(`by') fast verbose
{res}{txt}(0 observations deleted)
{res}{txt}(2 hash collisions - 2.00{txt}%)
{txt}(obs: {res}100{txt}; levels: {res}15{txt};{txt} method: {res}hash1{txt}; dict size: {res}150{txt})
{res}  50:      0.00 /        1 =       0.0010
{txt}
{com}. timer off 4
{txt}
{com}. 
. timer list
{res}   1:      0.00 /        1 =       0.0020
   2:      0.19 /        1 =       0.1870
   3:      0.00 /        1 =       0.0000
   4:      0.04 /        1 =       0.0390
{txt}
{com}. 
. 
. 
. exit

{txt}end of do-file


{com}. do demo_fcollapse_merge
{txt}
{com}. cap ado uninstall ftools
{txt}
{com}. net install ftools, from("C:/git/ftools/source")
checking {hilite:ftools} consistency and verifying not already installed...
installing into c:\ado\plus\...
installation complete.
{txt}
{com}. ftools compile
{txt}(compiling lftools.mlib for Stata 14.2)
(library saved in c:\ado\plus/l/lftools.mlib)

{com}. discard
{txt}
{com}. 
. clear all
{txt}
{com}. cls
{txt}
{com}. set more off
{txt}
{com}. 
. * benchmark
. sysuse auto
{txt}(1978 Automobile Data)

{com}. egen double sum_foreign = sum(foreign), by(turn)
{txt}
{com}. egen byte max_foreign = max(foreign), by(turn)
{txt}
{com}. egen int MAX_PRICE = max(price), by(turn)
{txt}
{com}. egen int _freq = count(turn), by(turn)
{txt}
{com}. 
. de *_*

              {txt}storage   display    value
variable name   type    format     label      variable label
{hline}
{p 0 48}{res}{bind:gear_ratio     }{txt}{bind: float   }{bind:{txt}%6.2f     }{space 1}{bind:         }{bind:  }{res}{res}Gear Ratio{p_end}
{p 0 48}{bind:sum_foreign    }{txt}{bind: double  }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:max_foreign    }{txt}{bind: byte    }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:MAX_PRICE      }{txt}{bind: int     }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:_freq          }{txt}{bind: int     }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{txt}
{com}. drop make
{txt}
{com}. mata: bench = hash1(st_data(., "_all"))
{res}{txt}
{com}. mata: bench
{res}  3965372940
{txt}
{com}. li in 1/10
{txt}
     {c TLC}{hline 8}{c -}{hline 5}{c -}{hline 7}{c -}{hline 10}{c -}{hline 7}{c -}{hline 8}{c -}{hline 8}{c -}{hline 6}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 7}{c TRC}
     {c |} {res} price   mpg   rep78   headroom   trunk   weight   length   turn   displa~t   gear_r~o    foreign   sum_fo~n   max_fo~n   MAX_PR~E   _freq {txt}{c |}
     {c LT}{hline 8}{c -}{hline 5}{c -}{hline 7}{c -}{hline 10}{c -}{hline 7}{c -}{hline 8}{c -}{hline 8}{c -}{hline 6}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 7}{c RT}
  1. {c |} {res} 4,099    22       3        2.5      11    2,930      186     40        121       3.58   Domestic          0          0       4816       6 {txt}{c |}
  2. {c |} {res} 4,749    17       3        3.0      11    3,350      173     40        258       2.53   Domestic          0          0       4816       6 {txt}{c |}
  3. {c |} {res} 3,799    22       .        3.0      12    2,640      168     35        121       3.08   Domestic          4          1       6229       6 {txt}{c |}
  4. {c |} {res} 4,816    20       3        4.5      16    3,250      196     40        196       2.93   Domestic          0          0       4816       6 {txt}{c |}
  5. {c |} {res} 7,827    15       4        4.0      20    4,080      222     43        350       2.41   Domestic          0          0      14500      12 {txt}{c |}
     {c LT}{hline 8}{c -}{hline 5}{c -}{hline 7}{c -}{hline 10}{c -}{hline 7}{c -}{hline 8}{c -}{hline 8}{c -}{hline 6}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 7}{c RT}
  6. {c |} {res} 5,788    18       3        4.0      21    3,670      218     43        231       2.73   Domestic          0          0      14500      12 {txt}{c |}
  7. {c |} {res} 4,453    26       .        3.0      10    2,230      170     34        304       2.87   Domestic          4          1       9735       6 {txt}{c |}
  8. {c |} {res} 5,189    20       3        2.0      16    3,280      200     42        196       2.93   Domestic          0          0       5798       7 {txt}{c |}
  9. {c |} {res}10,372    16       3        3.5      17    3,880      207     43        231       2.93   Domestic          0          0      14500      12 {txt}{c |}
 10. {c |} {res} 4,082    19       3        3.5      13    3,400      200     42        231       3.08   Domestic          0          0       5798       7 {txt}{c |}
     {c BLC}{hline 8}{c -}{hline 5}{c -}{hline 7}{c -}{hline 10}{c -}{hline 7}{c -}{hline 8}{c -}{hline 8}{c -}{hline 6}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 7}{c BRC}

{com}. 
. sysuse auto, clear
{txt}(1978 Automobile Data)

{com}. // fcollapse (sum) foreign (max) MAX_PRICE=price foreign, by(turn) merge freq v
. 
. de *_*

              {txt}storage   display    value
variable name   type    format     label      variable label
{hline}
{p 0 48}{res}{bind:gear_ratio     }{txt}{bind: float   }{bind:{txt}%6.2f     }{space 1}{bind:         }{bind:  }{res}{res}Gear Ratio{p_end}
{txt}
{com}. drop make
{txt}
{com}. mata: ftools = hash1(st_data(., "_all"))
{res}{txt}
{com}. mata: ftools
{res}  3932563324
{txt}
{com}. mata: bench == ftools
{res}  0
{txt}
{com}. li in 1/10
{txt}
     {c TLC}{hline 8}{c -}{hline 5}{c -}{hline 7}{c -}{hline 10}{c -}{hline 7}{c -}{hline 8}{c -}{hline 8}{c -}{hline 6}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c TRC}
     {c |} {res} price   mpg   rep78   headroom   trunk   weight   length   turn   displa~t   gear_r~o    foreign {txt}{c |}
     {c LT}{hline 8}{c -}{hline 5}{c -}{hline 7}{c -}{hline 10}{c -}{hline 7}{c -}{hline 8}{c -}{hline 8}{c -}{hline 6}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c RT}
  1. {c |} {res} 4,099    22       3        2.5      11    2,930      186     40        121       3.58   Domestic {txt}{c |}
  2. {c |} {res} 4,749    17       3        3.0      11    3,350      173     40        258       2.53   Domestic {txt}{c |}
  3. {c |} {res} 3,799    22       .        3.0      12    2,640      168     35        121       3.08   Domestic {txt}{c |}
  4. {c |} {res} 4,816    20       3        4.5      16    3,250      196     40        196       2.93   Domestic {txt}{c |}
  5. {c |} {res} 7,827    15       4        4.0      20    4,080      222     43        350       2.41   Domestic {txt}{c |}
     {c LT}{hline 8}{c -}{hline 5}{c -}{hline 7}{c -}{hline 10}{c -}{hline 7}{c -}{hline 8}{c -}{hline 8}{c -}{hline 6}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c RT}
  6. {c |} {res} 5,788    18       3        4.0      21    3,670      218     43        231       2.73   Domestic {txt}{c |}
  7. {c |} {res} 4,453    26       .        3.0      10    2,230      170     34        304       2.87   Domestic {txt}{c |}
  8. {c |} {res} 5,189    20       3        2.0      16    3,280      200     42        196       2.93   Domestic {txt}{c |}
  9. {c |} {res}10,372    16       3        3.5      17    3,880      207     43        231       2.93   Domestic {txt}{c |}
 10. {c |} {res} 4,082    19       3        3.5      13    3,400      200     42        231       3.08   Domestic {txt}{c |}
     {c BLC}{hline 8}{c -}{hline 5}{c -}{hline 7}{c -}{hline 10}{c -}{hline 7}{c -}{hline 8}{c -}{hline 8}{c -}{hline 6}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c BRC}

{com}. 
. * TEST SPEED
. clear all
{txt}
{com}. 
. set obs 100 // 1000000
{txt}{p}
number of observations (_N)  was 0,
now 100
{p_end}

{com}. gen long firm = ceil(runiform() * c(N) / 10)
{txt}
{com}. bys firm: gen year = _n
{txt}
{com}. xtset firm year
{res}{txt}{col 8}panel variable:  {res}firm (unbalanced)
{txt}{col 9}time variable:  {res}{col 25}year, 1 to 14
{txt}{col 17}delta:  {res}1 unit
{txt}
{com}. gen double x = rnormal()
{txt}
{com}. gen int y = ceil(runiform() * 10)
{txt}
{com}. 
. // sort year
. loc by year // firm
{txt}
{com}. 
. timer clear
{txt}
{com}. timer on 1
{txt}
{com}. egen double mean_x = mean(x), by(`by')
{txt}
{com}. //egen int max_y = max(y), by(`by')
. timer off 1
{txt}
{com}. 
. //de
. //li in 1/10
. //drop mean_x
. //mata: bench = hash1(st_data(., "_all"))
. //mata: bench
. 
. drop *_*
{txt}
{com}. 
. set trace off
{txt}
{com}. timer on 2
{txt}
{com}. fcollapse (mean) x /*(max) y*/, by(`by') merge fast verbose
{res}{txt}(0 observations deleted)
{res}{txt}(12 hash collisions - 12.00{txt}%)
{txt}(obs: {res}100{txt}; levels: {res}14{txt};{txt} method: {res}hash1{txt}; dict size: {res}150{txt})
{res}  50:      0.08 /        1 =       0.0840
{txt}
{com}. timer off 2
{txt}
{com}. de, short

{txt}Contains data
  obs:{res}           100                          
{txt} vars:{res}             5                          
{txt} size:{res}         2,600                          
{txt}Sorted by: {res}firm  year
     Note: Dataset has changed since last saved.
{txt}
{com}. 
. //de
. //li in 1/10
. //drop mean_x
. //mata: ftools = hash1(st_data(., "_all"))
. //mata: ftools
. //mata: bench == ftools
. 
. drop *_*
{txt}
{com}. // this is overoptimistic b/c it doesnt sort back or count MVs...
. timer on 3
{txt}
{com}. bys `by': gen double mean_x = sum(x)
{txt}
{com}. bys `by': replace mean_x = mean_x[_N] / _N
{txt}(99 real changes made)

{com}. timer off 3
{txt}
{com}. 
. drop *_*
{txt}
{com}. 
. timer on 4
{txt}
{com}. fcollapse (mean) x /*(max) y*/, by(`by') fast verbose
{res}{txt}(0 observations deleted)
{res}{txt}(2 hash collisions - 2.00{txt}%)
{txt}(obs: {res}100{txt}; levels: {res}14{txt};{txt} method: {res}hash1{txt}; dict size: {res}150{txt})
{res}  50:      0.00 /        1 =       0.0010
{txt}
{com}. timer off 4
{txt}
{com}. 
. timer list
{res}   1:      0.00 /        1 =       0.0020
   2:      0.19 /        1 =       0.1870
   3:      0.00 /        1 =       0.0010
   4:      0.03 /        1 =       0.0300
{txt}
{com}. 
. 
. 
. exit

{txt}end of do-file


{com}. do demo_fcollapse_merge
{txt}
{com}. cap ado uninstall ftools
{txt}
{com}. net install ftools, from("C:/git/ftools/source")
checking {hilite:ftools} consistency and verifying not already installed...
installing into c:\ado\plus\...
installation complete.
{txt}
{com}. ftools compile
{txt}(compiling lftools.mlib for Stata 14.2)
(library saved in c:\ado\plus/l/lftools.mlib)

{com}. discard
{txt}
{com}. 
. clear all
{txt}
{com}. cls
{txt}
{com}. set more off
{txt}
{com}. 
. * benchmark
. sysuse auto
{txt}(1978 Automobile Data)

{com}. egen double sum_foreign = sum(foreign), by(turn)
{txt}
{com}. egen byte max_foreign = max(foreign), by(turn)
{txt}
{com}. egen int MAX_PRICE = max(price), by(turn)
{txt}
{com}. egen int _freq = count(turn), by(turn)
{txt}
{com}. 
. de *_*

              {txt}storage   display    value
variable name   type    format     label      variable label
{hline}
{p 0 48}{res}{bind:gear_ratio     }{txt}{bind: float   }{bind:{txt}%6.2f     }{space 1}{bind:         }{bind:  }{res}{res}Gear Ratio{p_end}
{p 0 48}{bind:sum_foreign    }{txt}{bind: double  }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:max_foreign    }{txt}{bind: byte    }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:MAX_PRICE      }{txt}{bind: int     }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:_freq          }{txt}{bind: int     }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{txt}
{com}. drop make
{txt}
{com}. mata: bench = hash1(st_data(., "_all"))
{res}{txt}
{com}. mata: bench
{res}  3965372940
{txt}
{com}. li in 1/10
{txt}
     {c TLC}{hline 8}{c -}{hline 5}{c -}{hline 7}{c -}{hline 10}{c -}{hline 7}{c -}{hline 8}{c -}{hline 8}{c -}{hline 6}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 7}{c TRC}
     {c |} {res} price   mpg   rep78   headroom   trunk   weight   length   turn   displa~t   gear_r~o    foreign   sum_fo~n   max_fo~n   MAX_PR~E   _freq {txt}{c |}
     {c LT}{hline 8}{c -}{hline 5}{c -}{hline 7}{c -}{hline 10}{c -}{hline 7}{c -}{hline 8}{c -}{hline 8}{c -}{hline 6}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 7}{c RT}
  1. {c |} {res} 4,099    22       3        2.5      11    2,930      186     40        121       3.58   Domestic          0          0       4816       6 {txt}{c |}
  2. {c |} {res} 4,749    17       3        3.0      11    3,350      173     40        258       2.53   Domestic          0          0       4816       6 {txt}{c |}
  3. {c |} {res} 3,799    22       .        3.0      12    2,640      168     35        121       3.08   Domestic          4          1       6229       6 {txt}{c |}
  4. {c |} {res} 4,816    20       3        4.5      16    3,250      196     40        196       2.93   Domestic          0          0       4816       6 {txt}{c |}
  5. {c |} {res} 7,827    15       4        4.0      20    4,080      222     43        350       2.41   Domestic          0          0      14500      12 {txt}{c |}
     {c LT}{hline 8}{c -}{hline 5}{c -}{hline 7}{c -}{hline 10}{c -}{hline 7}{c -}{hline 8}{c -}{hline 8}{c -}{hline 6}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 7}{c RT}
  6. {c |} {res} 5,788    18       3        4.0      21    3,670      218     43        231       2.73   Domestic          0          0      14500      12 {txt}{c |}
  7. {c |} {res} 4,453    26       .        3.0      10    2,230      170     34        304       2.87   Domestic          4          1       9735       6 {txt}{c |}
  8. {c |} {res} 5,189    20       3        2.0      16    3,280      200     42        196       2.93   Domestic          0          0       5798       7 {txt}{c |}
  9. {c |} {res}10,372    16       3        3.5      17    3,880      207     43        231       2.93   Domestic          0          0      14500      12 {txt}{c |}
 10. {c |} {res} 4,082    19       3        3.5      13    3,400      200     42        231       3.08   Domestic          0          0       5798       7 {txt}{c |}
     {c BLC}{hline 8}{c -}{hline 5}{c -}{hline 7}{c -}{hline 10}{c -}{hline 7}{c -}{hline 8}{c -}{hline 8}{c -}{hline 6}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 7}{c BRC}

{com}. 
. sysuse auto, clear
{txt}(1978 Automobile Data)

{com}. // fcollapse (sum) foreign (max) MAX_PRICE=price foreign, by(turn) merge freq v
. 
. de *_*

              {txt}storage   display    value
variable name   type    format     label      variable label
{hline}
{p 0 48}{res}{bind:gear_ratio     }{txt}{bind: float   }{bind:{txt}%6.2f     }{space 1}{bind:         }{bind:  }{res}{res}Gear Ratio{p_end}
{txt}
{com}. drop make
{txt}
{com}. mata: ftools = hash1(st_data(., "_all"))
{res}{txt}
{com}. mata: ftools
{res}  3932563324
{txt}
{com}. mata: bench == ftools
{res}  0
{txt}
{com}. li in 1/10
{txt}
     {c TLC}{hline 8}{c -}{hline 5}{c -}{hline 7}{c -}{hline 10}{c -}{hline 7}{c -}{hline 8}{c -}{hline 8}{c -}{hline 6}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c TRC}
     {c |} {res} price   mpg   rep78   headroom   trunk   weight   length   turn   displa~t   gear_r~o    foreign {txt}{c |}
     {c LT}{hline 8}{c -}{hline 5}{c -}{hline 7}{c -}{hline 10}{c -}{hline 7}{c -}{hline 8}{c -}{hline 8}{c -}{hline 6}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c RT}
  1. {c |} {res} 4,099    22       3        2.5      11    2,930      186     40        121       3.58   Domestic {txt}{c |}
  2. {c |} {res} 4,749    17       3        3.0      11    3,350      173     40        258       2.53   Domestic {txt}{c |}
  3. {c |} {res} 3,799    22       .        3.0      12    2,640      168     35        121       3.08   Domestic {txt}{c |}
  4. {c |} {res} 4,816    20       3        4.5      16    3,250      196     40        196       2.93   Domestic {txt}{c |}
  5. {c |} {res} 7,827    15       4        4.0      20    4,080      222     43        350       2.41   Domestic {txt}{c |}
     {c LT}{hline 8}{c -}{hline 5}{c -}{hline 7}{c -}{hline 10}{c -}{hline 7}{c -}{hline 8}{c -}{hline 8}{c -}{hline 6}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c RT}
  6. {c |} {res} 5,788    18       3        4.0      21    3,670      218     43        231       2.73   Domestic {txt}{c |}
  7. {c |} {res} 4,453    26       .        3.0      10    2,230      170     34        304       2.87   Domestic {txt}{c |}
  8. {c |} {res} 5,189    20       3        2.0      16    3,280      200     42        196       2.93   Domestic {txt}{c |}
  9. {c |} {res}10,372    16       3        3.5      17    3,880      207     43        231       2.93   Domestic {txt}{c |}
 10. {c |} {res} 4,082    19       3        3.5      13    3,400      200     42        231       3.08   Domestic {txt}{c |}
     {c BLC}{hline 8}{c -}{hline 5}{c -}{hline 7}{c -}{hline 10}{c -}{hline 7}{c -}{hline 8}{c -}{hline 8}{c -}{hline 6}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c BRC}

{com}. 
. * TEST SPEED
. clear all
{txt}
{com}. 
. set obs 1000000
{txt}{p}
number of observations (_N)  was 0,
now 1,000,000
{p_end}

{com}. gen long firm = ceil(runiform() * c(N) / 10)
{txt}
{com}. bys firm: gen year = _n
{txt}
{com}. xtset firm year
{res}{txt}{col 8}panel variable:  {res}firm (unbalanced)
{txt}{col 9}time variable:  {res}{col 25}year, 1 to 27
{txt}{col 17}delta:  {res}1 unit
{txt}
{com}. gen double x = rnormal()
{txt}
{com}. gen int y = ceil(runiform() * 10)
{txt}
{com}. 
. // sort year
. loc by year // firm
{txt}
{com}. 
. timer clear
{txt}
{com}. timer on 1
{txt}
{com}. egen double mean_x = mean(x), by(`by')
{txt}
{com}. //egen int max_y = max(y), by(`by')
. timer off 1
{txt}
{com}. 
. //de
. //li in 1/10
. //drop mean_x
. //mata: bench = hash1(st_data(., "_all"))
. //mata: bench
. 
. drop *_*
{txt}
{com}. 
. set trace off
{txt}
{com}. timer on 2
{txt}
{com}. fcollapse (mean) x /*(max) y*/, by(`by') merge fast verbose
{res}{txt}(0 observations deleted)
{res}{txt}(0 hash collisions - 0.00{txt}%)
{txt}(obs: {res}1000000{txt}; levels: {res}27{txt};{txt} method: {res}hash1{txt}; dict size: {res}1500000{txt})
{res}  50:      0.71 /        1 =       0.7130
{txt}
{com}. timer off 2
{txt}
{com}. de, short

{txt}Contains data
  obs:{res}     1,000,000                          
{txt} vars:{res}             5                          
{txt} size:{res}    26,000,000                          
{txt}Sorted by: {res}firm  year
     Note: Dataset has changed since last saved.
{txt}
{com}. 
. //de
. //li in 1/10
. //drop mean_x
. //mata: ftools = hash1(st_data(., "_all"))
. //mata: ftools
. //mata: bench == ftools
. 
. drop *_*
{txt}
{com}. // this is overoptimistic b/c it doesnt sort back or count MVs...
. timer on 3
{txt}
{com}. bys `by': gen double mean_x = sum(x)
{txt}
{com}. bys `by': replace mean_x = mean_x[_N] / _N
{txt}(999999 real changes made)

{com}. timer off 3
{txt}
{com}. 
. drop *_*
{txt}
{com}. 
. timer on 4
{txt}
{com}. fcollapse (mean) x /*(max) y*/, by(`by') fast verbose
{res}{txt}(0 observations deleted)
{res}{txt}(0 hash collisions - 0.00{txt}%)
{txt}(obs: {res}1000000{txt}; levels: {res}27{txt};{txt} method: {res}hash1{txt}; dict size: {res}1500000{txt})
{res}  50:      0.16 /        1 =       0.1640
{txt}
{com}. timer off 4
{txt}
{com}. 
. timer list
{res}   1:      1.09 /        1 =       1.0860
   2:      1.18 /        1 =       1.1840
   3:      0.56 /        1 =       0.5620
   4:      0.53 /        1 =       0.5310
{txt}
{com}. 
. 
. 
. exit

{txt}end of do-file


{com}. do demo_fcollapse_merge
{txt}
{com}. cap ado uninstall ftools
{txt}
{com}. net install ftools, from("C:/git/ftools/source")
checking {hilite:ftools} consistency and verifying not already installed...
installing into c:\ado\plus\...
installation complete.
{txt}
{com}. ftools compile
{txt}(compiling lftools.mlib for Stata 14.2)
(library saved in c:\ado\plus/l/lftools.mlib)

{com}. discard
{txt}
{com}. 
. clear all
{txt}
{com}. cls
{txt}
{com}. set more off
{txt}
{com}. 
. * benchmark
. sysuse auto
{txt}(1978 Automobile Data)

{com}. egen double sum_foreign = sum(foreign), by(turn)
{txt}
{com}. egen byte max_foreign = max(foreign), by(turn)
{txt}
{com}. egen int MAX_PRICE = max(price), by(turn)
{txt}
{com}. egen int _freq = count(turn), by(turn)
{txt}
{com}. 
. de *_*

              {txt}storage   display    value
variable name   type    format     label      variable label
{hline}
{p 0 48}{res}{bind:gear_ratio     }{txt}{bind: float   }{bind:{txt}%6.2f     }{space 1}{bind:         }{bind:  }{res}{res}Gear Ratio{p_end}
{p 0 48}{bind:sum_foreign    }{txt}{bind: double  }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:max_foreign    }{txt}{bind: byte    }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:MAX_PRICE      }{txt}{bind: int     }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:_freq          }{txt}{bind: int     }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{txt}
{com}. drop make
{txt}
{com}. mata: bench = hash1(st_data(., "_all"))
{res}{txt}
{com}. mata: bench
{res}  3965372940
{txt}
{com}. li in 1/10
{txt}
     {c TLC}{hline 8}{c -}{hline 5}{c -}{hline 7}{c -}{hline 10}{c -}{hline 7}{c -}{hline 8}{c -}{hline 8}{c -}{hline 6}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 7}{c TRC}
     {c |} {res} price   mpg   rep78   headroom   trunk   weight   length   turn   displa~t   gear_r~o    foreign   sum_fo~n   max_fo~n   MAX_PR~E   _freq {txt}{c |}
     {c LT}{hline 8}{c -}{hline 5}{c -}{hline 7}{c -}{hline 10}{c -}{hline 7}{c -}{hline 8}{c -}{hline 8}{c -}{hline 6}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 7}{c RT}
  1. {c |} {res} 4,099    22       3        2.5      11    2,930      186     40        121       3.58   Domestic          0          0       4816       6 {txt}{c |}
  2. {c |} {res} 4,749    17       3        3.0      11    3,350      173     40        258       2.53   Domestic          0          0       4816       6 {txt}{c |}
  3. {c |} {res} 3,799    22       .        3.0      12    2,640      168     35        121       3.08   Domestic          4          1       6229       6 {txt}{c |}
  4. {c |} {res} 4,816    20       3        4.5      16    3,250      196     40        196       2.93   Domestic          0          0       4816       6 {txt}{c |}
  5. {c |} {res} 7,827    15       4        4.0      20    4,080      222     43        350       2.41   Domestic          0          0      14500      12 {txt}{c |}
     {c LT}{hline 8}{c -}{hline 5}{c -}{hline 7}{c -}{hline 10}{c -}{hline 7}{c -}{hline 8}{c -}{hline 8}{c -}{hline 6}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 7}{c RT}
  6. {c |} {res} 5,788    18       3        4.0      21    3,670      218     43        231       2.73   Domestic          0          0      14500      12 {txt}{c |}
  7. {c |} {res} 4,453    26       .        3.0      10    2,230      170     34        304       2.87   Domestic          4          1       9735       6 {txt}{c |}
  8. {c |} {res} 5,189    20       3        2.0      16    3,280      200     42        196       2.93   Domestic          0          0       5798       7 {txt}{c |}
  9. {c |} {res}10,372    16       3        3.5      17    3,880      207     43        231       2.93   Domestic          0          0      14500      12 {txt}{c |}
 10. {c |} {res} 4,082    19       3        3.5      13    3,400      200     42        231       3.08   Domestic          0          0       5798       7 {txt}{c |}
     {c BLC}{hline 8}{c -}{hline 5}{c -}{hline 7}{c -}{hline 10}{c -}{hline 7}{c -}{hline 8}{c -}{hline 8}{c -}{hline 6}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 7}{c BRC}

{com}. 
. sysuse auto, clear
{txt}(1978 Automobile Data)

{com}. fcollapse (sum) foreign (max) MAX_PRICE=price foreign, by(turn) merge freq v
{res}{txt}(0 observations deleted)
{res}{txt}(obs: {res}74{txt}; levels: {res}18{txt};{txt} method: {res}hash0{txt}; dict size: {res}21{txt})
{res}  50:      0.08 /        1 =       0.0800
{txt}
{com}. 
. de *_*

              {txt}storage   display    value
variable name   type    format     label      variable label
{hline}
{p 0 48}{res}{bind:gear_ratio     }{txt}{bind: float   }{bind:{txt}%6.2f     }{space 1}{bind:         }{bind:  }{res}{res}Gear Ratio{p_end}
{p 0 48}{bind:sum_foreign    }{txt}{bind: double  }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}(sum) foreign{p_end}
{p 0 48}{bind:max_foreign    }{txt}{bind: byte    }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}(max) foreign{p_end}
{p 0 48}{bind:MAX_PRICE      }{txt}{bind: int     }{bind:{txt}%8.0gc    }{space 1}{bind:         }{bind:  }{res}{res}(max) price{p_end}
{p 0 48}{bind:_freq          }{txt}{bind: byte    }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}Frequency{p_end}
{txt}
{com}. drop make
{txt}
{com}. mata: ftools = hash1(st_data(., "_all"))
{res}{txt}
{com}. mata: ftools
{res}  3965372940
{txt}
{com}. mata: bench == ftools
{res}  1
{txt}
{com}. li in 1/10
{txt}
     {c TLC}{hline 8}{c -}{hline 5}{c -}{hline 7}{c -}{hline 10}{c -}{hline 7}{c -}{hline 8}{c -}{hline 8}{c -}{hline 6}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 7}{c TRC}
     {c |} {res} price   mpg   rep78   headroom   trunk   weight   length   turn   displa~t   gear_r~o    foreign   sum_fo~n   max_fo~n   MAX_PR~E   _freq {txt}{c |}
     {c LT}{hline 8}{c -}{hline 5}{c -}{hline 7}{c -}{hline 10}{c -}{hline 7}{c -}{hline 8}{c -}{hline 8}{c -}{hline 6}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 7}{c RT}
  1. {c |} {res} 4,099    22       3        2.5      11    2,930      186     40        121       3.58   Domestic          0          0      4,816       6 {txt}{c |}
  2. {c |} {res} 4,749    17       3        3.0      11    3,350      173     40        258       2.53   Domestic          0          0      4,816       6 {txt}{c |}
  3. {c |} {res} 3,799    22       .        3.0      12    2,640      168     35        121       3.08   Domestic          4          1      6,229       6 {txt}{c |}
  4. {c |} {res} 4,816    20       3        4.5      16    3,250      196     40        196       2.93   Domestic          0          0      4,816       6 {txt}{c |}
  5. {c |} {res} 7,827    15       4        4.0      20    4,080      222     43        350       2.41   Domestic          0          0     14,500      12 {txt}{c |}
     {c LT}{hline 8}{c -}{hline 5}{c -}{hline 7}{c -}{hline 10}{c -}{hline 7}{c -}{hline 8}{c -}{hline 8}{c -}{hline 6}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 7}{c RT}
  6. {c |} {res} 5,788    18       3        4.0      21    3,670      218     43        231       2.73   Domestic          0          0     14,500      12 {txt}{c |}
  7. {c |} {res} 4,453    26       .        3.0      10    2,230      170     34        304       2.87   Domestic          4          1      9,735       6 {txt}{c |}
  8. {c |} {res} 5,189    20       3        2.0      16    3,280      200     42        196       2.93   Domestic          0          0      5,798       7 {txt}{c |}
  9. {c |} {res}10,372    16       3        3.5      17    3,880      207     43        231       2.93   Domestic          0          0     14,500      12 {txt}{c |}
 10. {c |} {res} 4,082    19       3        3.5      13    3,400      200     42        231       3.08   Domestic          0          0      5,798       7 {txt}{c |}
     {c BLC}{hline 8}{c -}{hline 5}{c -}{hline 7}{c -}{hline 10}{c -}{hline 7}{c -}{hline 8}{c -}{hline 8}{c -}{hline 6}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 7}{c BRC}

{com}. 
. * TEST SPEED
. clear all
{txt}
{com}. 
. set obs 1000000
{txt}{p}
number of observations (_N)  was 0,
now 1,000,000
{p_end}

{com}. gen long firm = ceil(runiform() * c(N) / 10)
{txt}
{com}. bys firm: gen year = _n
{txt}
{com}. xtset firm year
{res}{txt}{col 8}panel variable:  {res}firm (unbalanced)
{txt}{col 9}time variable:  {res}{col 25}year, 1 to 28
{txt}{col 17}delta:  {res}1 unit
{txt}
{com}. gen double x = rnormal()
{txt}
{com}. gen int y = ceil(runiform() * 10)
{txt}
{com}. 
. // sort year
. loc by year // firm
{txt}
{com}. 
. timer clear
{txt}
{com}. timer on 1
{txt}
{com}. egen double mean_x = mean(x), by(`by')
{txt}
{com}. //egen int max_y = max(y), by(`by')
. timer off 1
{txt}
{com}. 
. //de
. //li in 1/10
. //drop mean_x
. //mata: bench = hash1(st_data(., "_all"))
. //mata: bench
. 
. drop *_*
{txt}
{com}. 
. set trace off
{txt}
{com}. timer on 2
{txt}
{com}. fcollapse (mean) x /*(max) y*/, by(`by') merge fast verbose
{res}{txt}(0 observations deleted)
{res}{txt}(0 hash collisions - 0.00{txt}%)
{txt}(obs: {res}1000000{txt}; levels: {res}28{txt};{txt} method: {res}hash1{txt}; dict size: {res}1500000{txt})
{res}  50:      0.63 /        1 =       0.6250
{txt}
{com}. timer off 2
{txt}
{com}. de, short

{txt}Contains data
  obs:{res}     1,000,000                          
{txt} vars:{res}             5                          
{txt} size:{res}    26,000,000                          
{txt}Sorted by: {res}firm  year
     Note: Dataset has changed since last saved.
{txt}
{com}. 
. //de
. //li in 1/10
. //drop mean_x
. //mata: ftools = hash1(st_data(., "_all"))
. //mata: ftools
. //mata: bench == ftools
. 
. drop *_*
{txt}
{com}. // this is overoptimistic b/c it doesnt sort back or count MVs...
. timer on 3
{txt}
{com}. bys `by': gen double mean_x = sum(x)
{txt}
{com}. bys `by': replace mean_x = mean_x[_N] / _N
{txt}(999998 real changes made)

{com}. timer off 3
{txt}
{com}. 
. drop *_*
{txt}
{com}. 
. timer on 4
{txt}
{com}. fcollapse (mean) x /*(max) y*/, by(`by') fast verbose
{res}{txt}(0 observations deleted)
{res}{txt}(0 hash collisions - 0.00{txt}%)
{txt}(obs: {res}1000000{txt}; levels: {res}28{txt};{txt} method: {res}hash1{txt}; dict size: {res}1500000{txt})
{res}  50:      0.16 /        1 =       0.1580
{txt}
{com}. timer off 4
{txt}
{com}. 
. timer list
{res}   1:      1.00 /        1 =       0.9960
   2:      1.07 /        1 =       1.0690
   3:      0.54 /        1 =       0.5430
   4:      0.53 /        1 =       0.5300
{txt}
{com}. 
. 
. 
. exit

{txt}end of do-file


{com}. br

. de year

              {txt}storage   display    value
variable name   type    format     label      variable label
{hline}
{p 0 48}{res}{bind:year           }{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}

{com}. de year

              {txt}storage   display    value
variable name   type    format     label      variable label
{hline}
{p 0 48}{res}{bind:year           }{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}

{com}. do demo_fcollapse_merge
{txt}
{com}. cap ado uninstall ftools
{txt}
{com}. net install ftools, from("C:/git/ftools/source")
checking {hilite:ftools} consistency and verifying not already installed...
installing into c:\ado\plus\...
installation complete.
{txt}
{com}. ftools compile
{txt}(compiling lftools.mlib for Stata 14.2)
(library saved in c:\ado\plus/l/lftools.mlib)

{com}. discard
{txt}
{com}. 
. clear all
{txt}
{com}. cls
{txt}
{com}. set more off
{txt}
{com}. 
. * benchmark
. sysuse auto
{txt}(1978 Automobile Data)

{com}. egen double sum_foreign = sum(foreign), by(turn)
{txt}
{com}. egen byte max_foreign = max(foreign), by(turn)
{txt}
{com}. egen int MAX_PRICE = max(price), by(turn)
{txt}
{com}. egen int _freq = count(turn), by(turn)
{txt}
{com}. 
. de *_*

              {txt}storage   display    value
variable name   type    format     label      variable label
{hline}
{p 0 48}{res}{bind:gear_ratio     }{txt}{bind: float   }{bind:{txt}%6.2f     }{space 1}{bind:         }{bind:  }{res}{res}Gear Ratio{p_end}
{p 0 48}{bind:sum_foreign    }{txt}{bind: double  }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:max_foreign    }{txt}{bind: byte    }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:MAX_PRICE      }{txt}{bind: int     }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:_freq          }{txt}{bind: int     }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{txt}
{com}. drop make
{txt}
{com}. mata: bench = hash1(st_data(., "_all"))
{res}{txt}
{com}. mata: bench
{res}  3965372940
{txt}
{com}. li in 1/10
{txt}
     {c TLC}{hline 8}{c -}{hline 5}{c -}{hline 7}{c -}{hline 10}{c -}{hline 7}{c -}{hline 8}{c -}{hline 8}{c -}{hline 6}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 7}{c TRC}
     {c |} {res} price   mpg   rep78   headroom   trunk   weight   length   turn   displa~t   gear_r~o    foreign   sum_fo~n   max_fo~n   MAX_PR~E   _freq {txt}{c |}
     {c LT}{hline 8}{c -}{hline 5}{c -}{hline 7}{c -}{hline 10}{c -}{hline 7}{c -}{hline 8}{c -}{hline 8}{c -}{hline 6}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 7}{c RT}
  1. {c |} {res} 4,099    22       3        2.5      11    2,930      186     40        121       3.58   Domestic          0          0       4816       6 {txt}{c |}
  2. {c |} {res} 4,749    17       3        3.0      11    3,350      173     40        258       2.53   Domestic          0          0       4816       6 {txt}{c |}
  3. {c |} {res} 3,799    22       .        3.0      12    2,640      168     35        121       3.08   Domestic          4          1       6229       6 {txt}{c |}
  4. {c |} {res} 4,816    20       3        4.5      16    3,250      196     40        196       2.93   Domestic          0          0       4816       6 {txt}{c |}
  5. {c |} {res} 7,827    15       4        4.0      20    4,080      222     43        350       2.41   Domestic          0          0      14500      12 {txt}{c |}
     {c LT}{hline 8}{c -}{hline 5}{c -}{hline 7}{c -}{hline 10}{c -}{hline 7}{c -}{hline 8}{c -}{hline 8}{c -}{hline 6}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 7}{c RT}
  6. {c |} {res} 5,788    18       3        4.0      21    3,670      218     43        231       2.73   Domestic          0          0      14500      12 {txt}{c |}
  7. {c |} {res} 4,453    26       .        3.0      10    2,230      170     34        304       2.87   Domestic          4          1       9735       6 {txt}{c |}
  8. {c |} {res} 5,189    20       3        2.0      16    3,280      200     42        196       2.93   Domestic          0          0       5798       7 {txt}{c |}
  9. {c |} {res}10,372    16       3        3.5      17    3,880      207     43        231       2.93   Domestic          0          0      14500      12 {txt}{c |}
 10. {c |} {res} 4,082    19       3        3.5      13    3,400      200     42        231       3.08   Domestic          0          0       5798       7 {txt}{c |}
     {c BLC}{hline 8}{c -}{hline 5}{c -}{hline 7}{c -}{hline 10}{c -}{hline 7}{c -}{hline 8}{c -}{hline 8}{c -}{hline 6}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 7}{c BRC}

{com}. 
. sysuse auto, clear
{txt}(1978 Automobile Data)

{com}. fcollapse (sum) foreign (max) MAX_PRICE=price foreign, by(turn) merge freq v
{res}{txt}(0 observations deleted)
{res}{txt}(obs: {res}74{txt}; levels: {res}18{txt};{txt} method: {res}hash0{txt}; dict size: {res}21{txt})
{res}  50:      0.09 /        1 =       0.0850
{txt}
{com}. 
. de *_*

              {txt}storage   display    value
variable name   type    format     label      variable label
{hline}
{p 0 48}{res}{bind:gear_ratio     }{txt}{bind: float   }{bind:{txt}%6.2f     }{space 1}{bind:         }{bind:  }{res}{res}Gear Ratio{p_end}
{p 0 48}{bind:sum_foreign    }{txt}{bind: double  }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}(sum) foreign{p_end}
{p 0 48}{bind:max_foreign    }{txt}{bind: byte    }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}(max) foreign{p_end}
{p 0 48}{bind:MAX_PRICE      }{txt}{bind: int     }{bind:{txt}%8.0gc    }{space 1}{bind:         }{bind:  }{res}{res}(max) price{p_end}
{p 0 48}{bind:_freq          }{txt}{bind: byte    }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}Frequency{p_end}
{txt}
{com}. drop make
{txt}
{com}. mata: ftools = hash1(st_data(., "_all"))
{res}{txt}
{com}. mata: ftools
{res}  3965372940
{txt}
{com}. mata: bench == ftools
{res}  1
{txt}
{com}. li in 1/10
{txt}
     {c TLC}{hline 8}{c -}{hline 5}{c -}{hline 7}{c -}{hline 10}{c -}{hline 7}{c -}{hline 8}{c -}{hline 8}{c -}{hline 6}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 7}{c TRC}
     {c |} {res} price   mpg   rep78   headroom   trunk   weight   length   turn   displa~t   gear_r~o    foreign   sum_fo~n   max_fo~n   MAX_PR~E   _freq {txt}{c |}
     {c LT}{hline 8}{c -}{hline 5}{c -}{hline 7}{c -}{hline 10}{c -}{hline 7}{c -}{hline 8}{c -}{hline 8}{c -}{hline 6}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 7}{c RT}
  1. {c |} {res} 4,099    22       3        2.5      11    2,930      186     40        121       3.58   Domestic          0          0      4,816       6 {txt}{c |}
  2. {c |} {res} 4,749    17       3        3.0      11    3,350      173     40        258       2.53   Domestic          0          0      4,816       6 {txt}{c |}
  3. {c |} {res} 3,799    22       .        3.0      12    2,640      168     35        121       3.08   Domestic          4          1      6,229       6 {txt}{c |}
  4. {c |} {res} 4,816    20       3        4.5      16    3,250      196     40        196       2.93   Domestic          0          0      4,816       6 {txt}{c |}
  5. {c |} {res} 7,827    15       4        4.0      20    4,080      222     43        350       2.41   Domestic          0          0     14,500      12 {txt}{c |}
     {c LT}{hline 8}{c -}{hline 5}{c -}{hline 7}{c -}{hline 10}{c -}{hline 7}{c -}{hline 8}{c -}{hline 8}{c -}{hline 6}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 7}{c RT}
  6. {c |} {res} 5,788    18       3        4.0      21    3,670      218     43        231       2.73   Domestic          0          0     14,500      12 {txt}{c |}
  7. {c |} {res} 4,453    26       .        3.0      10    2,230      170     34        304       2.87   Domestic          4          1      9,735       6 {txt}{c |}
  8. {c |} {res} 5,189    20       3        2.0      16    3,280      200     42        196       2.93   Domestic          0          0      5,798       7 {txt}{c |}
  9. {c |} {res}10,372    16       3        3.5      17    3,880      207     43        231       2.93   Domestic          0          0     14,500      12 {txt}{c |}
 10. {c |} {res} 4,082    19       3        3.5      13    3,400      200     42        231       3.08   Domestic          0          0      5,798       7 {txt}{c |}
     {c BLC}{hline 8}{c -}{hline 5}{c -}{hline 7}{c -}{hline 10}{c -}{hline 7}{c -}{hline 8}{c -}{hline 8}{c -}{hline 6}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 7}{c BRC}

{com}. 
. * TEST SPEED
. clear all
{txt}
{com}. 
. set obs 1000000
{txt}{p}
number of observations (_N)  was 0,
now 1,000,000
{p_end}

{com}. gen long firm = ceil(runiform() * c(N) / 10)
{txt}
{com}. bys firm: gen int year = _n
{txt}
{com}. xtset firm year
{res}{txt}{col 8}panel variable:  {res}firm (unbalanced)
{txt}{col 9}time variable:  {res}{col 25}year, 1 to 26
{txt}{col 17}delta:  {res}1 unit
{txt}
{com}. gen double x = rnormal()
{txt}
{com}. gen int y = ceil(runiform() * 10)
{txt}
{com}. 
. // sort year
. loc by year // firm
{txt}
{com}. 
. timer clear
{txt}
{com}. timer on 1
{txt}
{com}. egen double mean_x = mean(x), by(`by')
{txt}
{com}. //egen int max_y = max(y), by(`by')
. timer off 1
{txt}
{com}. 
. //de
. //li in 1/10
. //drop mean_x
. //mata: bench = hash1(st_data(., "_all"))
. //mata: bench
. 
. drop *_*
{txt}
{com}. 
. set trace off
{txt}
{com}. timer on 2
{txt}
{com}. fcollapse (mean) x /*(max) y*/, by(`by') merge fast verbose
{res}{txt}(0 observations deleted)
{res}{txt}(obs: {res}1000000{txt}; levels: {res}26{txt};{txt} method: {res}hash0{txt}; dict size: {res}26{txt})
{res}  50:      0.29 /        1 =       0.2870
{txt}
{com}. timer off 2
{txt}
{com}. de, short

{txt}Contains data
  obs:{res}     1,000,000                          
{txt} vars:{res}             5                          
{txt} size:{res}    24,000,000                          
{txt}Sorted by: {res}firm  year
     Note: Dataset has changed since last saved.
{txt}
{com}. 
. //de
. //li in 1/10
. //drop mean_x
. //mata: ftools = hash1(st_data(., "_all"))
. //mata: ftools
. //mata: bench == ftools
. 
. drop *_*
{txt}
{com}. // this is overoptimistic b/c it doesnt sort back or count MVs...
. timer on 3
{txt}
{com}. bys `by': gen double mean_x = sum(x)
{txt}
{com}. bys `by': replace mean_x = mean_x[_N] / _N
{txt}(999999 real changes made)

{com}. timer off 3
{txt}
{com}. 
. drop *_*
{txt}
{com}. 
. timer on 4
{txt}
{com}. fcollapse (mean) x /*(max) y*/, by(`by') fast verbose
{res}{txt}(0 observations deleted)
{res}{txt}(obs: {res}1000000{txt}; levels: {res}26{txt};{txt} method: {res}hash0{txt}; dict size: {res}26{txt})
{res}  50:      0.22 /        1 =       0.2150
{txt}
{com}. timer off 4
{txt}
{com}. 
. timer list
{res}   1:      0.99 /        1 =       0.9880
   2:      0.73 /        1 =       0.7260
   3:      0.52 /        1 =       0.5230
   4:      0.56 /        1 =       0.5650
{txt}
{com}. 
. 
. 
. exit

{txt}end of do-file


{com}. do demo_fcollapse_merge
{txt}
{com}. cap ado uninstall ftools
{txt}
{com}. net install ftools, from("C:/git/ftools/source")
checking {hilite:ftools} consistency and verifying not already installed...
installing into c:\ado\plus\...
installation complete.
{txt}
{com}. ftools compile
{txt}(compiling lftools.mlib for Stata 14.2)
(library saved in c:\ado\plus/l/lftools.mlib)

{com}. discard
{txt}
{com}. 
. clear all
{txt}
{com}. cls
{txt}
{com}. set more off
{txt}
{com}. 
. * benchmark
. sysuse auto
{txt}(1978 Automobile Data)

{com}. egen double sum_foreign = sum(foreign), by(turn)
{txt}
{com}. egen byte max_foreign = max(foreign), by(turn)
{txt}
{com}. egen int MAX_PRICE = max(price), by(turn)
{txt}
{com}. egen int _freq = count(turn), by(turn)
{txt}
{com}. 
. de *_*

              {txt}storage   display    value
variable name   type    format     label      variable label
{hline}
{p 0 48}{res}{bind:gear_ratio     }{txt}{bind: float   }{bind:{txt}%6.2f     }{space 1}{bind:         }{bind:  }{res}{res}Gear Ratio{p_end}
{p 0 48}{bind:sum_foreign    }{txt}{bind: double  }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:max_foreign    }{txt}{bind: byte    }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:MAX_PRICE      }{txt}{bind: int     }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:_freq          }{txt}{bind: int     }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{txt}
{com}. drop make
{txt}
{com}. mata: bench = hash1(st_data(., "_all"))
{res}{txt}
{com}. mata: bench
{res}  3965372940
{txt}
{com}. li in 1/10
{txt}
     {c TLC}{hline 8}{c -}{hline 5}{c -}{hline 7}{c -}{hline 10}{c -}{hline 7}{c -}{hline 8}{c -}{hline 8}{c -}{hline 6}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 7}{c TRC}
     {c |} {res} price   mpg   rep78   headroom   trunk   weight   length   turn   displa~t   gear_r~o    foreign   sum_fo~n   max_fo~n   MAX_PR~E   _freq {txt}{c |}
     {c LT}{hline 8}{c -}{hline 5}{c -}{hline 7}{c -}{hline 10}{c -}{hline 7}{c -}{hline 8}{c -}{hline 8}{c -}{hline 6}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 7}{c RT}
  1. {c |} {res} 4,099    22       3        2.5      11    2,930      186     40        121       3.58   Domestic          0          0       4816       6 {txt}{c |}
  2. {c |} {res} 4,749    17       3        3.0      11    3,350      173     40        258       2.53   Domestic          0          0       4816       6 {txt}{c |}
  3. {c |} {res} 3,799    22       .        3.0      12    2,640      168     35        121       3.08   Domestic          4          1       6229       6 {txt}{c |}
  4. {c |} {res} 4,816    20       3        4.5      16    3,250      196     40        196       2.93   Domestic          0          0       4816       6 {txt}{c |}
  5. {c |} {res} 7,827    15       4        4.0      20    4,080      222     43        350       2.41   Domestic          0          0      14500      12 {txt}{c |}
     {c LT}{hline 8}{c -}{hline 5}{c -}{hline 7}{c -}{hline 10}{c -}{hline 7}{c -}{hline 8}{c -}{hline 8}{c -}{hline 6}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 7}{c RT}
  6. {c |} {res} 5,788    18       3        4.0      21    3,670      218     43        231       2.73   Domestic          0          0      14500      12 {txt}{c |}
  7. {c |} {res} 4,453    26       .        3.0      10    2,230      170     34        304       2.87   Domestic          4          1       9735       6 {txt}{c |}
  8. {c |} {res} 5,189    20       3        2.0      16    3,280      200     42        196       2.93   Domestic          0          0       5798       7 {txt}{c |}
  9. {c |} {res}10,372    16       3        3.5      17    3,880      207     43        231       2.93   Domestic          0          0      14500      12 {txt}{c |}
 10. {c |} {res} 4,082    19       3        3.5      13    3,400      200     42        231       3.08   Domestic          0          0       5798       7 {txt}{c |}
     {c BLC}{hline 8}{c -}{hline 5}{c -}{hline 7}{c -}{hline 10}{c -}{hline 7}{c -}{hline 8}{c -}{hline 8}{c -}{hline 6}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 7}{c BRC}

{com}. 
. sysuse auto, clear
{txt}(1978 Automobile Data)

{com}. fcollapse (sum) foreign (max) MAX_PRICE=price foreign, by(turn) merge freq v
{res}{txt}(0 observations deleted)
{res}  TOUSE!!!!!!!!!!!!
{txt}(obs: {res}74{txt}; levels: {res}18{txt};{txt} method: {res}hash0{txt}; dict size: {res}21{txt})
{res}  50:      0.10 /        1 =       0.1030
{txt}
{com}. 
. de *_*

              {txt}storage   display    value
variable name   type    format     label      variable label
{hline}
{p 0 48}{res}{bind:gear_ratio     }{txt}{bind: float   }{bind:{txt}%6.2f     }{space 1}{bind:         }{bind:  }{res}{res}Gear Ratio{p_end}
{p 0 48}{bind:sum_foreign    }{txt}{bind: double  }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}(sum) foreign{p_end}
{p 0 48}{bind:max_foreign    }{txt}{bind: byte    }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}(max) foreign{p_end}
{p 0 48}{bind:MAX_PRICE      }{txt}{bind: int     }{bind:{txt}%8.0gc    }{space 1}{bind:         }{bind:  }{res}{res}(max) price{p_end}
{p 0 48}{bind:_freq          }{txt}{bind: byte    }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}Frequency{p_end}
{txt}
{com}. drop make
{txt}
{com}. mata: ftools = hash1(st_data(., "_all"))
{res}{txt}
{com}. mata: ftools
{res}  3965372940
{txt}
{com}. mata: bench == ftools
{res}  1
{txt}
{com}. li in 1/10
{txt}
     {c TLC}{hline 8}{c -}{hline 5}{c -}{hline 7}{c -}{hline 10}{c -}{hline 7}{c -}{hline 8}{c -}{hline 8}{c -}{hline 6}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 7}{c TRC}
     {c |} {res} price   mpg   rep78   headroom   trunk   weight   length   turn   displa~t   gear_r~o    foreign   sum_fo~n   max_fo~n   MAX_PR~E   _freq {txt}{c |}
     {c LT}{hline 8}{c -}{hline 5}{c -}{hline 7}{c -}{hline 10}{c -}{hline 7}{c -}{hline 8}{c -}{hline 8}{c -}{hline 6}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 7}{c RT}
  1. {c |} {res} 4,099    22       3        2.5      11    2,930      186     40        121       3.58   Domestic          0          0      4,816       6 {txt}{c |}
  2. {c |} {res} 4,749    17       3        3.0      11    3,350      173     40        258       2.53   Domestic          0          0      4,816       6 {txt}{c |}
  3. {c |} {res} 3,799    22       .        3.0      12    2,640      168     35        121       3.08   Domestic          4          1      6,229       6 {txt}{c |}
  4. {c |} {res} 4,816    20       3        4.5      16    3,250      196     40        196       2.93   Domestic          0          0      4,816       6 {txt}{c |}
  5. {c |} {res} 7,827    15       4        4.0      20    4,080      222     43        350       2.41   Domestic          0          0     14,500      12 {txt}{c |}
     {c LT}{hline 8}{c -}{hline 5}{c -}{hline 7}{c -}{hline 10}{c -}{hline 7}{c -}{hline 8}{c -}{hline 8}{c -}{hline 6}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 7}{c RT}
  6. {c |} {res} 5,788    18       3        4.0      21    3,670      218     43        231       2.73   Domestic          0          0     14,500      12 {txt}{c |}
  7. {c |} {res} 4,453    26       .        3.0      10    2,230      170     34        304       2.87   Domestic          4          1      9,735       6 {txt}{c |}
  8. {c |} {res} 5,189    20       3        2.0      16    3,280      200     42        196       2.93   Domestic          0          0      5,798       7 {txt}{c |}
  9. {c |} {res}10,372    16       3        3.5      17    3,880      207     43        231       2.93   Domestic          0          0     14,500      12 {txt}{c |}
 10. {c |} {res} 4,082    19       3        3.5      13    3,400      200     42        231       3.08   Domestic          0          0      5,798       7 {txt}{c |}
     {c BLC}{hline 8}{c -}{hline 5}{c -}{hline 7}{c -}{hline 10}{c -}{hline 7}{c -}{hline 8}{c -}{hline 8}{c -}{hline 6}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 7}{c BRC}

{com}. 
. * TEST SPEED
. clear all
{txt}
{com}. 
. set obs 1000000
{txt}{p}
number of observations (_N)  was 0,
now 1,000,000
{p_end}

{com}. gen long firm = ceil(runiform() * c(N) / 10)
{txt}
{com}. bys firm: gen int year = _n
{txt}
{com}. xtset firm year
{res}{txt}{col 8}panel variable:  {res}firm (unbalanced)
{txt}{col 9}time variable:  {res}{col 25}year, 1 to 26
{txt}{col 17}delta:  {res}1 unit
{txt}
{com}. gen double x = rnormal()
{txt}
{com}. gen int y = ceil(runiform() * 10)
{txt}
{com}. 
. // sort year
. loc by year // firm
{txt}
{com}. 
. timer clear
{txt}
{com}. timer on 1
{txt}
{com}. egen double mean_x = mean(x), by(`by')
{txt}
{com}. //egen int max_y = max(y), by(`by')
. timer off 1
{txt}
{com}. 
. //de
. //li in 1/10
. //drop mean_x
. //mata: bench = hash1(st_data(., "_all"))
. //mata: bench
. 
. drop *_*
{txt}
{com}. 
. set trace off
{txt}
{com}. timer on 2
{txt}
{com}. fcollapse (mean) x /*(max) y*/, by(`by') merge fast verbose
{res}{txt}(0 observations deleted)
{res}  TOUSE!!!!!!!!!!!!
{txt}(obs: {res}1000000{txt}; levels: {res}26{txt};{txt} method: {res}hash0{txt}; dict size: {res}26{txt})
{res}  50:      0.29 /        1 =       0.2930
{txt}
{com}. timer off 2
{txt}
{com}. de, short

{txt}Contains data
  obs:{res}     1,000,000                          
{txt} vars:{res}             5                          
{txt} size:{res}    24,000,000                          
{txt}Sorted by: {res}firm  year
     Note: Dataset has changed since last saved.
{txt}
{com}. 
. //de
. //li in 1/10
. //drop mean_x
. //mata: ftools = hash1(st_data(., "_all"))
. //mata: ftools
. //mata: bench == ftools
. 
. drop *_*
{txt}
{com}. // this is overoptimistic b/c it doesnt sort back or count MVs...
. timer on 3
{txt}
{com}. bys `by': gen double mean_x = sum(x)
{txt}
{com}. bys `by': replace mean_x = mean_x[_N] / _N
{txt}(999999 real changes made)

{com}. timer off 3
{txt}
{com}. 
. drop *_*
{txt}
{com}. 
. timer on 4
{txt}
{com}. fcollapse (mean) x /*(max) y*/, by(`by') fast verbose
{res}{txt}(0 observations deleted)
{res}  TOUSE!!!!!!!!!!!!
{txt}(obs: {res}1000000{txt}; levels: {res}26{txt};{txt} method: {res}hash0{txt}; dict size: {res}26{txt})
{res}  50:      0.22 /        1 =       0.2160
{txt}
{com}. timer off 4
{txt}
{com}. 
. timer list
{res}   1:      0.97 /        1 =       0.9730
   2:      0.73 /        1 =       0.7260
   3:      0.54 /        1 =       0.5410
   4:      0.57 /        1 =       0.5700
{txt}
{com}. 
. 
. 
. exit

{txt}end of do-file


{com}. do demo_fcollapse_merge
{txt}
{com}. cap ado uninstall ftools
{txt}
{com}. net install ftools, from("C:/git/ftools/source")
checking {hilite:ftools} consistency and verifying not already installed...
installing into c:\ado\plus\...
installation complete.
{txt}
{com}. ftools compile
{txt}(compiling lftools.mlib for Stata 14.2)
(library saved in c:\ado\plus/l/lftools.mlib)

{com}. discard
{txt}
{com}. 
. clear all
{txt}
{com}. cls
{txt}
{com}. set more off
{txt}
{com}. 
. * benchmark
. sysuse auto
{txt}(1978 Automobile Data)

{com}. egen double sum_foreign = sum(foreign), by(turn)
{txt}
{com}. egen byte max_foreign = max(foreign), by(turn)
{txt}
{com}. egen int MAX_PRICE = max(price), by(turn)
{txt}
{com}. egen int _freq = count(turn), by(turn)
{txt}
{com}. 
. de *_*

              {txt}storage   display    value
variable name   type    format     label      variable label
{hline}
{p 0 48}{res}{bind:gear_ratio     }{txt}{bind: float   }{bind:{txt}%6.2f     }{space 1}{bind:         }{bind:  }{res}{res}Gear Ratio{p_end}
{p 0 48}{bind:sum_foreign    }{txt}{bind: double  }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:max_foreign    }{txt}{bind: byte    }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:MAX_PRICE      }{txt}{bind: int     }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:_freq          }{txt}{bind: int     }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{txt}
{com}. drop make
{txt}
{com}. mata: bench = hash1(st_data(., "_all"))
{res}{txt}
{com}. mata: bench
{res}  3965372940
{txt}
{com}. li in 1/10
{txt}
     {c TLC}{hline 8}{c -}{hline 5}{c -}{hline 7}{c -}{hline 10}{c -}{hline 7}{c -}{hline 8}{c -}{hline 8}{c -}{hline 6}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 7}{c TRC}
     {c |} {res} price   mpg   rep78   headroom   trunk   weight   length   turn   displa~t   gear_r~o    foreign   sum_fo~n   max_fo~n   MAX_PR~E   _freq {txt}{c |}
     {c LT}{hline 8}{c -}{hline 5}{c -}{hline 7}{c -}{hline 10}{c -}{hline 7}{c -}{hline 8}{c -}{hline 8}{c -}{hline 6}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 7}{c RT}
  1. {c |} {res} 4,099    22       3        2.5      11    2,930      186     40        121       3.58   Domestic          0          0       4816       6 {txt}{c |}
  2. {c |} {res} 4,749    17       3        3.0      11    3,350      173     40        258       2.53   Domestic          0          0       4816       6 {txt}{c |}
  3. {c |} {res} 3,799    22       .        3.0      12    2,640      168     35        121       3.08   Domestic          4          1       6229       6 {txt}{c |}
  4. {c |} {res} 4,816    20       3        4.5      16    3,250      196     40        196       2.93   Domestic          0          0       4816       6 {txt}{c |}
  5. {c |} {res} 7,827    15       4        4.0      20    4,080      222     43        350       2.41   Domestic          0          0      14500      12 {txt}{c |}
     {c LT}{hline 8}{c -}{hline 5}{c -}{hline 7}{c -}{hline 10}{c -}{hline 7}{c -}{hline 8}{c -}{hline 8}{c -}{hline 6}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 7}{c RT}
  6. {c |} {res} 5,788    18       3        4.0      21    3,670      218     43        231       2.73   Domestic          0          0      14500      12 {txt}{c |}
  7. {c |} {res} 4,453    26       .        3.0      10    2,230      170     34        304       2.87   Domestic          4          1       9735       6 {txt}{c |}
  8. {c |} {res} 5,189    20       3        2.0      16    3,280      200     42        196       2.93   Domestic          0          0       5798       7 {txt}{c |}
  9. {c |} {res}10,372    16       3        3.5      17    3,880      207     43        231       2.93   Domestic          0          0      14500      12 {txt}{c |}
 10. {c |} {res} 4,082    19       3        3.5      13    3,400      200     42        231       3.08   Domestic          0          0       5798       7 {txt}{c |}
     {c BLC}{hline 8}{c -}{hline 5}{c -}{hline 7}{c -}{hline 10}{c -}{hline 7}{c -}{hline 8}{c -}{hline 8}{c -}{hline 6}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 7}{c BRC}

{com}. 
. sysuse auto, clear
{txt}(1978 Automobile Data)

{com}. fcollapse (sum) foreign (max) MAX_PRICE=price foreign, by(turn) merge freq v
{res}{txt}(0 observations deleted)
{res}  TOUSE!!!!!!!!!!!!
  1
{txt}(obs: {res}74{txt}; levels: {res}18{txt};{txt} method: {res}hash0{txt}; dict size: {res}21{txt})
{res}  50:      0.10 /        1 =       0.0960
{txt}
{com}. 
. de *_*

              {txt}storage   display    value
variable name   type    format     label      variable label
{hline}
{p 0 48}{res}{bind:gear_ratio     }{txt}{bind: float   }{bind:{txt}%6.2f     }{space 1}{bind:         }{bind:  }{res}{res}Gear Ratio{p_end}
{p 0 48}{bind:sum_foreign    }{txt}{bind: double  }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}(sum) foreign{p_end}
{p 0 48}{bind:max_foreign    }{txt}{bind: byte    }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}(max) foreign{p_end}
{p 0 48}{bind:MAX_PRICE      }{txt}{bind: int     }{bind:{txt}%8.0gc    }{space 1}{bind:         }{bind:  }{res}{res}(max) price{p_end}
{p 0 48}{bind:_freq          }{txt}{bind: byte    }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}Frequency{p_end}
{txt}
{com}. drop make
{txt}
{com}. mata: ftools = hash1(st_data(., "_all"))
{res}{txt}
{com}. mata: ftools
{res}  3965372940
{txt}
{com}. mata: bench == ftools
{res}  1
{txt}
{com}. li in 1/10
{txt}
     {c TLC}{hline 8}{c -}{hline 5}{c -}{hline 7}{c -}{hline 10}{c -}{hline 7}{c -}{hline 8}{c -}{hline 8}{c -}{hline 6}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 7}{c TRC}
     {c |} {res} price   mpg   rep78   headroom   trunk   weight   length   turn   displa~t   gear_r~o    foreign   sum_fo~n   max_fo~n   MAX_PR~E   _freq {txt}{c |}
     {c LT}{hline 8}{c -}{hline 5}{c -}{hline 7}{c -}{hline 10}{c -}{hline 7}{c -}{hline 8}{c -}{hline 8}{c -}{hline 6}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 7}{c RT}
  1. {c |} {res} 4,099    22       3        2.5      11    2,930      186     40        121       3.58   Domestic          0          0      4,816       6 {txt}{c |}
  2. {c |} {res} 4,749    17       3        3.0      11    3,350      173     40        258       2.53   Domestic          0          0      4,816       6 {txt}{c |}
  3. {c |} {res} 3,799    22       .        3.0      12    2,640      168     35        121       3.08   Domestic          4          1      6,229       6 {txt}{c |}
  4. {c |} {res} 4,816    20       3        4.5      16    3,250      196     40        196       2.93   Domestic          0          0      4,816       6 {txt}{c |}
  5. {c |} {res} 7,827    15       4        4.0      20    4,080      222     43        350       2.41   Domestic          0          0     14,500      12 {txt}{c |}
     {c LT}{hline 8}{c -}{hline 5}{c -}{hline 7}{c -}{hline 10}{c -}{hline 7}{c -}{hline 8}{c -}{hline 8}{c -}{hline 6}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 7}{c RT}
  6. {c |} {res} 5,788    18       3        4.0      21    3,670      218     43        231       2.73   Domestic          0          0     14,500      12 {txt}{c |}
  7. {c |} {res} 4,453    26       .        3.0      10    2,230      170     34        304       2.87   Domestic          4          1      9,735       6 {txt}{c |}
  8. {c |} {res} 5,189    20       3        2.0      16    3,280      200     42        196       2.93   Domestic          0          0      5,798       7 {txt}{c |}
  9. {c |} {res}10,372    16       3        3.5      17    3,880      207     43        231       2.93   Domestic          0          0     14,500      12 {txt}{c |}
 10. {c |} {res} 4,082    19       3        3.5      13    3,400      200     42        231       3.08   Domestic          0          0      5,798       7 {txt}{c |}
     {c BLC}{hline 8}{c -}{hline 5}{c -}{hline 7}{c -}{hline 10}{c -}{hline 7}{c -}{hline 8}{c -}{hline 8}{c -}{hline 6}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 7}{c BRC}

{com}. 
. * TEST SPEED
. clear all
{txt}
{com}. 
. set obs 1000000
{txt}{p}
number of observations (_N)  was 0,
now 1,000,000
{p_end}

{com}. gen long firm = ceil(runiform() * c(N) / 10)
{txt}
{com}. bys firm: gen int year = _n
{txt}
{com}. xtset firm year
{res}{txt}{col 8}panel variable:  {res}firm (unbalanced)
{txt}{col 9}time variable:  {res}{col 25}year, 1 to 29
{txt}{col 17}delta:  {res}1 unit
{txt}
{com}. gen double x = rnormal()
{txt}
{com}. gen int y = ceil(runiform() * 10)
{txt}
{com}. 
. // sort year
. loc by year // firm
{txt}
{com}. 
. timer clear
{txt}
{com}. timer on 1
{txt}
{com}. egen double mean_x = mean(x), by(`by')
{txt}
{com}. //egen int max_y = max(y), by(`by')
. timer off 1
{txt}
{com}. 
. //de
. //li in 1/10
. //drop mean_x
. //mata: bench = hash1(st_data(., "_all"))
. //mata: bench
. 
. drop *_*
{txt}
{com}. 
. set trace off
{txt}
{com}. timer on 2
{txt}
{com}. fcollapse (mean) x /*(max) y*/, by(`by') merge fast verbose
{res}{txt}(0 observations deleted)
{res}  TOUSE!!!!!!!!!!!!
  1
{txt}(obs: {res}1000000{txt}; levels: {res}29{txt};{txt} method: {res}hash0{txt}; dict size: {res}29{txt})
{res}  50:      0.29 /        1 =       0.2900
{txt}
{com}. timer off 2
{txt}
{com}. de, short

{txt}Contains data
  obs:{res}     1,000,000                          
{txt} vars:{res}             5                          
{txt} size:{res}    24,000,000                          
{txt}Sorted by: {res}firm  year
     Note: Dataset has changed since last saved.
{txt}
{com}. 
. //de
. //li in 1/10
. //drop mean_x
. //mata: ftools = hash1(st_data(., "_all"))
. //mata: ftools
. //mata: bench == ftools
. 
. drop *_*
{txt}
{com}. // this is overoptimistic b/c it doesnt sort back or count MVs...
. timer on 3
{txt}
{com}. bys `by': gen double mean_x = sum(x)
{txt}
{com}. bys `by': replace mean_x = mean_x[_N] / _N
{txt}(999997 real changes made)

{com}. timer off 3
{txt}
{com}. 
. drop *_*
{txt}
{com}. 
. timer on 4
{txt}
{com}. fcollapse (mean) x /*(max) y*/, by(`by') fast verbose
{res}{txt}(0 observations deleted)
{res}  TOUSE!!!!!!!!!!!!
  1
{txt}(obs: {res}1000000{txt}; levels: {res}29{txt};{txt} method: {res}hash0{txt}; dict size: {res}29{txt})
{res}  50:      0.24 /        1 =       0.2430
{txt}
{com}. timer off 4
{txt}
{com}. 
. timer list
{res}   1:      0.98 /        1 =       0.9800
   2:      0.73 /        1 =       0.7340
   3:      0.53 /        1 =       0.5260
   4:      0.59 /        1 =       0.5870
{txt}
{com}. 
. 
. 
. exit

{txt}end of do-file


{com}. mata: " ".trim()
{err}'.trim' found where almost anything else expected
{txt}{search r(3000), local:r(3000);}

{com}. mata: strip
{res}{err}                 <istmt>:  3499  strip not found
{txt}{search r(3499), local:r(3499);}

{com}. mata: strip()
{res}{err}                 <istmt>:  3499  strip() not found
{txt}{search r(3499), local:r(3499);}

{com}. mata: trim()
{res}{err}                 <istmt>:  3499  trim() not found
{txt}{search r(3499), local:r(3499);}

{com}. mata: str_trim()
{res}{err}                 <istmt>:  3499  str_trim() not found
{txt}{search r(3499), local:r(3499);}

{com}. h mata string

. mata: strtrim()
{err}wrong number of arguments for strtrim()
{txt}{search r(3000), local:r(3000);}

{com}. do demo_fcollapse_merge
{txt}
{com}. cap ado uninstall ftools
{txt}
{com}. net install ftools, from("C:/git/ftools/source")
checking {hilite:ftools} consistency and verifying not already installed...
installing into c:\ado\plus\...
installation complete.
{txt}
{com}. ftools compile
{txt}(compiling lftools.mlib for Stata 14.2)
(library saved in c:\ado\plus/l/lftools.mlib)

{com}. discard
{txt}
{com}. 
. clear all
{txt}
{com}. cls
{txt}
{com}. set more off
{txt}
{com}. 
. * benchmark
. sysuse auto
{txt}(1978 Automobile Data)

{com}. egen double sum_foreign = sum(foreign), by(turn)
{txt}
{com}. egen byte max_foreign = max(foreign), by(turn)
{txt}
{com}. egen int MAX_PRICE = max(price), by(turn)
{txt}
{com}. egen int _freq = count(turn), by(turn)
{txt}
{com}. 
. de *_*

              {txt}storage   display    value
variable name   type    format     label      variable label
{hline}
{p 0 48}{res}{bind:gear_ratio     }{txt}{bind: float   }{bind:{txt}%6.2f     }{space 1}{bind:         }{bind:  }{res}{res}Gear Ratio{p_end}
{p 0 48}{bind:sum_foreign    }{txt}{bind: double  }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:max_foreign    }{txt}{bind: byte    }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:MAX_PRICE      }{txt}{bind: int     }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:_freq          }{txt}{bind: int     }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{txt}
{com}. drop make
{txt}
{com}. mata: bench = hash1(st_data(., "_all"))
{res}{txt}
{com}. mata: bench
{res}  3965372940
{txt}
{com}. li in 1/10
{txt}
     {c TLC}{hline 8}{c -}{hline 5}{c -}{hline 7}{c -}{hline 10}{c -}{hline 7}{c -}{hline 8}{c -}{hline 8}{c -}{hline 6}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 7}{c TRC}
     {c |} {res} price   mpg   rep78   headroom   trunk   weight   length   turn   displa~t   gear_r~o    foreign   sum_fo~n   max_fo~n   MAX_PR~E   _freq {txt}{c |}
     {c LT}{hline 8}{c -}{hline 5}{c -}{hline 7}{c -}{hline 10}{c -}{hline 7}{c -}{hline 8}{c -}{hline 8}{c -}{hline 6}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 7}{c RT}
  1. {c |} {res} 4,099    22       3        2.5      11    2,930      186     40        121       3.58   Domestic          0          0       4816       6 {txt}{c |}
  2. {c |} {res} 4,749    17       3        3.0      11    3,350      173     40        258       2.53   Domestic          0          0       4816       6 {txt}{c |}
  3. {c |} {res} 3,799    22       .        3.0      12    2,640      168     35        121       3.08   Domestic          4          1       6229       6 {txt}{c |}
  4. {c |} {res} 4,816    20       3        4.5      16    3,250      196     40        196       2.93   Domestic          0          0       4816       6 {txt}{c |}
  5. {c |} {res} 7,827    15       4        4.0      20    4,080      222     43        350       2.41   Domestic          0          0      14500      12 {txt}{c |}
     {c LT}{hline 8}{c -}{hline 5}{c -}{hline 7}{c -}{hline 10}{c -}{hline 7}{c -}{hline 8}{c -}{hline 8}{c -}{hline 6}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 7}{c RT}
  6. {c |} {res} 5,788    18       3        4.0      21    3,670      218     43        231       2.73   Domestic          0          0      14500      12 {txt}{c |}
  7. {c |} {res} 4,453    26       .        3.0      10    2,230      170     34        304       2.87   Domestic          4          1       9735       6 {txt}{c |}
  8. {c |} {res} 5,189    20       3        2.0      16    3,280      200     42        196       2.93   Domestic          0          0       5798       7 {txt}{c |}
  9. {c |} {res}10,372    16       3        3.5      17    3,880      207     43        231       2.93   Domestic          0          0      14500      12 {txt}{c |}
 10. {c |} {res} 4,082    19       3        3.5      13    3,400      200     42        231       3.08   Domestic          0          0       5798       7 {txt}{c |}
     {c BLC}{hline 8}{c -}{hline 5}{c -}{hline 7}{c -}{hline 10}{c -}{hline 7}{c -}{hline 8}{c -}{hline 8}{c -}{hline 6}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 7}{c BRC}

{com}. 
. sysuse auto, clear
{txt}(1978 Automobile Data)

{com}. fcollapse (sum) foreign (max) MAX_PRICE=price foreign, by(turn) merge freq v
{res}{txt}(0 observations deleted)
{res}{txt}(obs: {res}74{txt}; levels: {res}18{txt};{txt} method: {res}hash0{txt}; dict size: {res}21{txt})
{res}  50:      0.08 /        1 =       0.0820
{txt}
{com}. 
. de *_*

              {txt}storage   display    value
variable name   type    format     label      variable label
{hline}
{p 0 48}{res}{bind:gear_ratio     }{txt}{bind: float   }{bind:{txt}%6.2f     }{space 1}{bind:         }{bind:  }{res}{res}Gear Ratio{p_end}
{p 0 48}{bind:sum_foreign    }{txt}{bind: double  }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}(sum) foreign{p_end}
{p 0 48}{bind:max_foreign    }{txt}{bind: byte    }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}(max) foreign{p_end}
{p 0 48}{bind:MAX_PRICE      }{txt}{bind: int     }{bind:{txt}%8.0gc    }{space 1}{bind:         }{bind:  }{res}{res}(max) price{p_end}
{p 0 48}{bind:_freq          }{txt}{bind: byte    }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}Frequency{p_end}
{txt}
{com}. drop make
{txt}
{com}. mata: ftools = hash1(st_data(., "_all"))
{res}{txt}
{com}. mata: ftools
{res}  3965372940
{txt}
{com}. mata: bench == ftools
{res}  1
{txt}
{com}. li in 1/10
{txt}
     {c TLC}{hline 8}{c -}{hline 5}{c -}{hline 7}{c -}{hline 10}{c -}{hline 7}{c -}{hline 8}{c -}{hline 8}{c -}{hline 6}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 7}{c TRC}
     {c |} {res} price   mpg   rep78   headroom   trunk   weight   length   turn   displa~t   gear_r~o    foreign   sum_fo~n   max_fo~n   MAX_PR~E   _freq {txt}{c |}
     {c LT}{hline 8}{c -}{hline 5}{c -}{hline 7}{c -}{hline 10}{c -}{hline 7}{c -}{hline 8}{c -}{hline 8}{c -}{hline 6}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 7}{c RT}
  1. {c |} {res} 4,099    22       3        2.5      11    2,930      186     40        121       3.58   Domestic          0          0      4,816       6 {txt}{c |}
  2. {c |} {res} 4,749    17       3        3.0      11    3,350      173     40        258       2.53   Domestic          0          0      4,816       6 {txt}{c |}
  3. {c |} {res} 3,799    22       .        3.0      12    2,640      168     35        121       3.08   Domestic          4          1      6,229       6 {txt}{c |}
  4. {c |} {res} 4,816    20       3        4.5      16    3,250      196     40        196       2.93   Domestic          0          0      4,816       6 {txt}{c |}
  5. {c |} {res} 7,827    15       4        4.0      20    4,080      222     43        350       2.41   Domestic          0          0     14,500      12 {txt}{c |}
     {c LT}{hline 8}{c -}{hline 5}{c -}{hline 7}{c -}{hline 10}{c -}{hline 7}{c -}{hline 8}{c -}{hline 8}{c -}{hline 6}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 7}{c RT}
  6. {c |} {res} 5,788    18       3        4.0      21    3,670      218     43        231       2.73   Domestic          0          0     14,500      12 {txt}{c |}
  7. {c |} {res} 4,453    26       .        3.0      10    2,230      170     34        304       2.87   Domestic          4          1      9,735       6 {txt}{c |}
  8. {c |} {res} 5,189    20       3        2.0      16    3,280      200     42        196       2.93   Domestic          0          0      5,798       7 {txt}{c |}
  9. {c |} {res}10,372    16       3        3.5      17    3,880      207     43        231       2.93   Domestic          0          0     14,500      12 {txt}{c |}
 10. {c |} {res} 4,082    19       3        3.5      13    3,400      200     42        231       3.08   Domestic          0          0      5,798       7 {txt}{c |}
     {c BLC}{hline 8}{c -}{hline 5}{c -}{hline 7}{c -}{hline 10}{c -}{hline 7}{c -}{hline 8}{c -}{hline 8}{c -}{hline 6}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 7}{c BRC}

{com}. 
. * TEST SPEED
. clear all
{txt}
{com}. 
. set obs 1000000
{txt}{p}
number of observations (_N)  was 0,
now 1,000,000
{p_end}

{com}. gen long firm = ceil(runiform() * c(N) / 10)
{txt}
{com}. bys firm: gen int year = _n
{txt}
{com}. xtset firm year
{res}{txt}{col 8}panel variable:  {res}firm (unbalanced)
{txt}{col 9}time variable:  {res}{col 25}year, 1 to 27
{txt}{col 17}delta:  {res}1 unit
{txt}
{com}. gen double x = rnormal()
{txt}
{com}. gen int y = ceil(runiform() * 10)
{txt}
{com}. 
. // sort year
. loc by year // firm
{txt}
{com}. 
. 
. 
. timer clear
{txt}
{com}. 
. 
. 
. preserve
{txt}
{com}. timer on 4
{txt}
{com}. fcollapse (mean) x /*(max) y*/, by(`by') fast verbose
{res}{txt}(0 observations deleted)
{res}{txt}(obs: {res}1000000{txt}; levels: {res}27{txt};{txt} method: {res}hash0{txt}; dict size: {res}27{txt})
{res}  50:      0.28 /        1 =       0.2800
{txt}
{com}. timer off 4
{txt}
{com}. restore
{txt}
{com}. 
. 
. 
. timer on 1
{txt}
{com}. egen double mean_x = mean(x), by(`by')
{txt}
{com}. //egen int max_y = max(y), by(`by')
. timer off 1
{txt}
{com}. 
. //de
. //li in 1/10
. //drop mean_x
. //mata: bench = hash1(st_data(., "_all"))
. //mata: bench
. 
. drop *_*
{txt}
{com}. 
. set trace off
{txt}
{com}. timer on 2
{txt}
{com}. fcollapse (mean) x /*(max) y*/, by(`by') merge fast verbose
{res}{txt}(0 observations deleted)
{res}{txt}(obs: {res}1000000{txt}; levels: {res}27{txt};{txt} method: {res}hash0{txt}; dict size: {res}27{txt})
{res}  50:      0.22 /        1 =       0.2230
{txt}
{com}. timer off 2
{txt}
{com}. de, short

{txt}Contains data
  obs:{res}     1,000,000                          
{txt} vars:{res}             5                          
{txt} size:{res}    24,000,000                          
{txt}Sorted by: {res}firm  year
     Note: Dataset has changed since last saved.
{txt}
{com}. 
. //de
. //li in 1/10
. //drop mean_x
. //mata: ftools = hash1(st_data(., "_all"))
. //mata: ftools
. //mata: bench == ftools
. 
. drop *_*
{txt}
{com}. // this is overoptimistic b/c it doesnt sort back or count MVs...
. timer on 3
{txt}
{com}. bys `by': gen double mean_x = sum(x)
{txt}
{com}. bys `by': replace mean_x = mean_x[_N] / _N
{txt}(1000000 real changes made)

{com}. timer off 3
{txt}
{com}. 
. drop *_*
{txt}
{com}. 
. timer list
{res}   1:      0.99 /        1 =       0.9920
   2:      0.59 /        1 =       0.5930
   3:      0.51 /        1 =       0.5100
   4:      0.70 /        1 =       0.6960
{txt}
{com}. 
. 
. 
. exit

{txt}end of do-file


{com}. do demo_fcollapse_merge
{txt}
{com}. cap ado uninstall ftools
{txt}
{com}. net install ftools, from("C:/git/ftools/source")
checking {hilite:ftools} consistency and verifying not already installed...
installing into c:\ado\plus\...
installation complete.
{txt}
{com}. ftools compile
{txt}(compiling lftools.mlib for Stata 14.2)
(library saved in c:\ado\plus/l/lftools.mlib)

{com}. discard
{txt}
{com}. 
. clear all
{txt}
{com}. cls
{txt}
{com}. set more off
{txt}
{com}. 
. * benchmark
. sysuse auto
{txt}(1978 Automobile Data)

{com}. egen double sum_foreign = sum(foreign), by(turn)
{txt}
{com}. egen byte max_foreign = max(foreign), by(turn)
{txt}
{com}. egen int MAX_PRICE = max(price), by(turn)
{txt}
{com}. egen int _freq = count(turn), by(turn)
{txt}
{com}. 
. de *_*

              {txt}storage   display    value
variable name   type    format     label      variable label
{hline}
{p 0 48}{res}{bind:gear_ratio     }{txt}{bind: float   }{bind:{txt}%6.2f     }{space 1}{bind:         }{bind:  }{res}{res}Gear Ratio{p_end}
{p 0 48}{bind:sum_foreign    }{txt}{bind: double  }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:max_foreign    }{txt}{bind: byte    }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:MAX_PRICE      }{txt}{bind: int     }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:_freq          }{txt}{bind: int     }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{txt}
{com}. drop make
{txt}
{com}. mata: bench = hash1(st_data(., "_all"))
{res}{txt}
{com}. mata: bench
{res}  3965372940
{txt}
{com}. li in 1/10
{txt}
     {c TLC}{hline 8}{c -}{hline 5}{c -}{hline 7}{c -}{hline 10}{c -}{hline 7}{c -}{hline 8}{c -}{hline 8}{c -}{hline 6}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 7}{c TRC}
     {c |} {res} price   mpg   rep78   headroom   trunk   weight   length   turn   displa~t   gear_r~o    foreign   sum_fo~n   max_fo~n   MAX_PR~E   _freq {txt}{c |}
     {c LT}{hline 8}{c -}{hline 5}{c -}{hline 7}{c -}{hline 10}{c -}{hline 7}{c -}{hline 8}{c -}{hline 8}{c -}{hline 6}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 7}{c RT}
  1. {c |} {res} 4,099    22       3        2.5      11    2,930      186     40        121       3.58   Domestic          0          0       4816       6 {txt}{c |}
  2. {c |} {res} 4,749    17       3        3.0      11    3,350      173     40        258       2.53   Domestic          0          0       4816       6 {txt}{c |}
  3. {c |} {res} 3,799    22       .        3.0      12    2,640      168     35        121       3.08   Domestic          4          1       6229       6 {txt}{c |}
  4. {c |} {res} 4,816    20       3        4.5      16    3,250      196     40        196       2.93   Domestic          0          0       4816       6 {txt}{c |}
  5. {c |} {res} 7,827    15       4        4.0      20    4,080      222     43        350       2.41   Domestic          0          0      14500      12 {txt}{c |}
     {c LT}{hline 8}{c -}{hline 5}{c -}{hline 7}{c -}{hline 10}{c -}{hline 7}{c -}{hline 8}{c -}{hline 8}{c -}{hline 6}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 7}{c RT}
  6. {c |} {res} 5,788    18       3        4.0      21    3,670      218     43        231       2.73   Domestic          0          0      14500      12 {txt}{c |}
  7. {c |} {res} 4,453    26       .        3.0      10    2,230      170     34        304       2.87   Domestic          4          1       9735       6 {txt}{c |}
  8. {c |} {res} 5,189    20       3        2.0      16    3,280      200     42        196       2.93   Domestic          0          0       5798       7 {txt}{c |}
  9. {c |} {res}10,372    16       3        3.5      17    3,880      207     43        231       2.93   Domestic          0          0      14500      12 {txt}{c |}
 10. {c |} {res} 4,082    19       3        3.5      13    3,400      200     42        231       3.08   Domestic          0          0       5798       7 {txt}{c |}
     {c BLC}{hline 8}{c -}{hline 5}{c -}{hline 7}{c -}{hline 10}{c -}{hline 7}{c -}{hline 8}{c -}{hline 8}{c -}{hline 6}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 7}{c BRC}

{com}. 
. sysuse auto, clear
{txt}(1978 Automobile Data)

{com}. fcollapse (sum) foreign (max) MAX_PRICE=price foreign, by(turn) merge freq v
{res}{txt}(0 observations deleted)
{res}{txt}(obs: {res}74{txt}; levels: {res}18{txt};{txt} method: {res}hash0{txt}; dict size: {res}21{txt})
{res}  50:      0.08 /        1 =       0.0810
{txt}
{com}. 
. de *_*

              {txt}storage   display    value
variable name   type    format     label      variable label
{hline}
{p 0 48}{res}{bind:gear_ratio     }{txt}{bind: float   }{bind:{txt}%6.2f     }{space 1}{bind:         }{bind:  }{res}{res}Gear Ratio{p_end}
{p 0 48}{bind:sum_foreign    }{txt}{bind: double  }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}(sum) foreign{p_end}
{p 0 48}{bind:max_foreign    }{txt}{bind: byte    }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}(max) foreign{p_end}
{p 0 48}{bind:MAX_PRICE      }{txt}{bind: int     }{bind:{txt}%8.0gc    }{space 1}{bind:         }{bind:  }{res}{res}(max) price{p_end}
{p 0 48}{bind:_freq          }{txt}{bind: byte    }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}Frequency{p_end}
{txt}
{com}. drop make
{txt}
{com}. mata: ftools = hash1(st_data(., "_all"))
{res}{txt}
{com}. mata: ftools
{res}  3965372940
{txt}
{com}. mata: bench == ftools
{res}  1
{txt}
{com}. li in 1/10
{txt}
     {c TLC}{hline 8}{c -}{hline 5}{c -}{hline 7}{c -}{hline 10}{c -}{hline 7}{c -}{hline 8}{c -}{hline 8}{c -}{hline 6}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 7}{c TRC}
     {c |} {res} price   mpg   rep78   headroom   trunk   weight   length   turn   displa~t   gear_r~o    foreign   sum_fo~n   max_fo~n   MAX_PR~E   _freq {txt}{c |}
     {c LT}{hline 8}{c -}{hline 5}{c -}{hline 7}{c -}{hline 10}{c -}{hline 7}{c -}{hline 8}{c -}{hline 8}{c -}{hline 6}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 7}{c RT}
  1. {c |} {res} 4,099    22       3        2.5      11    2,930      186     40        121       3.58   Domestic          0          0      4,816       6 {txt}{c |}
  2. {c |} {res} 4,749    17       3        3.0      11    3,350      173     40        258       2.53   Domestic          0          0      4,816       6 {txt}{c |}
  3. {c |} {res} 3,799    22       .        3.0      12    2,640      168     35        121       3.08   Domestic          4          1      6,229       6 {txt}{c |}
  4. {c |} {res} 4,816    20       3        4.5      16    3,250      196     40        196       2.93   Domestic          0          0      4,816       6 {txt}{c |}
  5. {c |} {res} 7,827    15       4        4.0      20    4,080      222     43        350       2.41   Domestic          0          0     14,500      12 {txt}{c |}
     {c LT}{hline 8}{c -}{hline 5}{c -}{hline 7}{c -}{hline 10}{c -}{hline 7}{c -}{hline 8}{c -}{hline 8}{c -}{hline 6}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 7}{c RT}
  6. {c |} {res} 5,788    18       3        4.0      21    3,670      218     43        231       2.73   Domestic          0          0     14,500      12 {txt}{c |}
  7. {c |} {res} 4,453    26       .        3.0      10    2,230      170     34        304       2.87   Domestic          4          1      9,735       6 {txt}{c |}
  8. {c |} {res} 5,189    20       3        2.0      16    3,280      200     42        196       2.93   Domestic          0          0      5,798       7 {txt}{c |}
  9. {c |} {res}10,372    16       3        3.5      17    3,880      207     43        231       2.93   Domestic          0          0     14,500      12 {txt}{c |}
 10. {c |} {res} 4,082    19       3        3.5      13    3,400      200     42        231       3.08   Domestic          0          0      5,798       7 {txt}{c |}
     {c BLC}{hline 8}{c -}{hline 5}{c -}{hline 7}{c -}{hline 10}{c -}{hline 7}{c -}{hline 8}{c -}{hline 8}{c -}{hline 6}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 7}{c BRC}

{com}. 
. * TEST SPEED
. clear all
{txt}
{com}. 
. set obs 1000000
{txt}{p}
number of observations (_N)  was 0,
now 1,000,000
{p_end}

{com}. gen long firm = ceil(runiform() * c(N) / 10)
{txt}
{com}. bys firm: gen int year = _n
{txt}
{com}. xtset firm year
{res}{txt}{col 8}panel variable:  {res}firm (unbalanced)
{txt}{col 9}time variable:  {res}{col 25}year, 1 to 25
{txt}{col 17}delta:  {res}1 unit
{txt}
{com}. gen double x = rnormal()
{txt}
{com}. gen int y = ceil(runiform() * 10)
{txt}
{com}. 
. // sort year
. loc by year // firm
{txt}
{com}. 
. 
. 
. timer clear
{txt}
{com}. 
. 
. 
. preserve
{txt}
{com}. timer on 4
{txt}
{com}. fcollapse (mean) x /*(max) y*/, by(`by') fast verbose
{res}{txt}(0 observations deleted)
{res}{txt}(obs: {res}1000000{txt}; levels: {res}25{txt};{txt} method: {res}hash0{txt}; dict size: {res}25{txt})
{res}  50:      0.29 /        1 =       0.2880
{txt}
{com}. timer off 4
{txt}
{com}. restore
{txt}
{com}. 
. 
. 
. timer on 1
{txt}
{com}. egen double mean_x = mean(x), by(`by')
{txt}
{com}. //egen int max_y = max(y), by(`by')
. timer off 1
{txt}
{com}. 
. //de
. //li in 1/10
. //drop mean_x
. //mata: bench = hash1(st_data(., "_all"))
. //mata: bench
. 
. drop *_*
{txt}
{com}. 
. set trace off
{txt}
{com}. timer on 2
{txt}
{com}. fcollapse (mean) x /*(max) y*/, by(`by') merge fast verbose
{res}{txt}(0 observations deleted)
{res}{txt}(obs: {res}1000000{txt}; levels: {res}25{txt};{txt} method: {res}hash0{txt}; dict size: {res}25{txt})
{res}  50:      0.21 /        1 =       0.2080
{txt}
{com}. timer off 2
{txt}
{com}. de, short

{txt}Contains data
  obs:{res}     1,000,000                          
{txt} vars:{res}             5                          
{txt} size:{res}    24,000,000                          
{txt}Sorted by: {res}firm  year
     Note: Dataset has changed since last saved.
{txt}
{com}. 
. //de
. //li in 1/10
. //drop mean_x
. //mata: ftools = hash1(st_data(., "_all"))
. //mata: ftools
. //mata: bench == ftools
. 
. drop *_*
{txt}
{com}. // this is overoptimistic b/c it doesnt sort back or count MVs...
. timer on 3
{txt}
{com}. bys `by': gen double mean_x = sum(x)
{txt}
{com}. bys `by': replace mean_x = mean_x[_N] / _N
{txt}(1000000 real changes made)

{com}. timer off 3
{txt}
{com}. 
. drop *_*
{txt}
{com}. 
. timer list
{res}   1:      0.99 /        1 =       0.9890
   2:      0.57 /        1 =       0.5750
   3:      0.52 /        1 =       0.5200
   4:      0.72 /        1 =       0.7220
{txt}
{com}. 
. 
. 
. exit

{txt}end of do-file


{com}. do demo_fcollapse_merge
{txt}
{com}. cap ado uninstall ftools
{txt}
{com}. net install ftools, from("C:/git/ftools/source")
checking {hilite:ftools} consistency and verifying not already installed...
installing into c:\ado\plus\...
installation complete.
{txt}
{com}. ftools compile
{txt}(compiling lftools.mlib for Stata 14.2)
(library saved in c:\ado\plus/l/lftools.mlib)

{com}. discard
{txt}
{com}. 
. clear all
{txt}
{com}. cls
{txt}
{com}. set more off
{txt}
{com}. 
. * benchmark
. sysuse auto
{txt}(1978 Automobile Data)

{com}. egen double sum_foreign = sum(foreign), by(turn)
{txt}
{com}. egen byte max_foreign = max(foreign), by(turn)
{txt}
{com}. egen int MAX_PRICE = max(price), by(turn)
{txt}
{com}. egen int _freq = count(turn), by(turn)
{txt}
{com}. 
. de *_*

              {txt}storage   display    value
variable name   type    format     label      variable label
{hline}
{p 0 48}{res}{bind:gear_ratio     }{txt}{bind: float   }{bind:{txt}%6.2f     }{space 1}{bind:         }{bind:  }{res}{res}Gear Ratio{p_end}
{p 0 48}{bind:sum_foreign    }{txt}{bind: double  }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:max_foreign    }{txt}{bind: byte    }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:MAX_PRICE      }{txt}{bind: int     }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:_freq          }{txt}{bind: int     }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{txt}
{com}. drop make
{txt}
{com}. mata: bench = hash1(st_data(., "_all"))
{res}{txt}
{com}. mata: bench
{res}  3965372940
{txt}
{com}. li in 1/10
{txt}
     {c TLC}{hline 8}{c -}{hline 5}{c -}{hline 7}{c -}{hline 10}{c -}{hline 7}{c -}{hline 8}{c -}{hline 8}{c -}{hline 6}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 7}{c TRC}
     {c |} {res} price   mpg   rep78   headroom   trunk   weight   length   turn   displa~t   gear_r~o    foreign   sum_fo~n   max_fo~n   MAX_PR~E   _freq {txt}{c |}
     {c LT}{hline 8}{c -}{hline 5}{c -}{hline 7}{c -}{hline 10}{c -}{hline 7}{c -}{hline 8}{c -}{hline 8}{c -}{hline 6}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 7}{c RT}
  1. {c |} {res} 4,099    22       3        2.5      11    2,930      186     40        121       3.58   Domestic          0          0       4816       6 {txt}{c |}
  2. {c |} {res} 4,749    17       3        3.0      11    3,350      173     40        258       2.53   Domestic          0          0       4816       6 {txt}{c |}
  3. {c |} {res} 3,799    22       .        3.0      12    2,640      168     35        121       3.08   Domestic          4          1       6229       6 {txt}{c |}
  4. {c |} {res} 4,816    20       3        4.5      16    3,250      196     40        196       2.93   Domestic          0          0       4816       6 {txt}{c |}
  5. {c |} {res} 7,827    15       4        4.0      20    4,080      222     43        350       2.41   Domestic          0          0      14500      12 {txt}{c |}
     {c LT}{hline 8}{c -}{hline 5}{c -}{hline 7}{c -}{hline 10}{c -}{hline 7}{c -}{hline 8}{c -}{hline 8}{c -}{hline 6}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 7}{c RT}
  6. {c |} {res} 5,788    18       3        4.0      21    3,670      218     43        231       2.73   Domestic          0          0      14500      12 {txt}{c |}
  7. {c |} {res} 4,453    26       .        3.0      10    2,230      170     34        304       2.87   Domestic          4          1       9735       6 {txt}{c |}
  8. {c |} {res} 5,189    20       3        2.0      16    3,280      200     42        196       2.93   Domestic          0          0       5798       7 {txt}{c |}
  9. {c |} {res}10,372    16       3        3.5      17    3,880      207     43        231       2.93   Domestic          0          0      14500      12 {txt}{c |}
 10. {c |} {res} 4,082    19       3        3.5      13    3,400      200     42        231       3.08   Domestic          0          0       5798       7 {txt}{c |}
     {c BLC}{hline 8}{c -}{hline 5}{c -}{hline 7}{c -}{hline 10}{c -}{hline 7}{c -}{hline 8}{c -}{hline 8}{c -}{hline 6}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 7}{c BRC}

{com}. 
. sysuse auto, clear
{txt}(1978 Automobile Data)

{com}. fcollapse (sum) foreign (max) MAX_PRICE=price foreign, by(turn) merge freq v
{res}{txt}(0 observations deleted)
{res}{txt}(obs: {res}74{txt}; levels: {res}18{txt};{txt} method: {res}hash0{txt}; dict size: {res}21{txt})
{res}  50:      0.10 /        1 =       0.0990
{txt}
{com}. 
. de *_*

              {txt}storage   display    value
variable name   type    format     label      variable label
{hline}
{p 0 48}{res}{bind:gear_ratio     }{txt}{bind: float   }{bind:{txt}%6.2f     }{space 1}{bind:         }{bind:  }{res}{res}Gear Ratio{p_end}
{p 0 48}{bind:sum_foreign    }{txt}{bind: double  }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}(sum) foreign{p_end}
{p 0 48}{bind:max_foreign    }{txt}{bind: byte    }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}(max) foreign{p_end}
{p 0 48}{bind:MAX_PRICE      }{txt}{bind: int     }{bind:{txt}%8.0gc    }{space 1}{bind:         }{bind:  }{res}{res}(max) price{p_end}
{p 0 48}{bind:_freq          }{txt}{bind: byte    }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}Frequency{p_end}
{txt}
{com}. drop make
{txt}
{com}. mata: ftools = hash1(st_data(., "_all"))
{res}{txt}
{com}. mata: ftools
{res}  3965372940
{txt}
{com}. mata: bench == ftools
{res}  1
{txt}
{com}. li in 1/10
{txt}
     {c TLC}{hline 8}{c -}{hline 5}{c -}{hline 7}{c -}{hline 10}{c -}{hline 7}{c -}{hline 8}{c -}{hline 8}{c -}{hline 6}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 7}{c TRC}
     {c |} {res} price   mpg   rep78   headroom   trunk   weight   length   turn   displa~t   gear_r~o    foreign   sum_fo~n   max_fo~n   MAX_PR~E   _freq {txt}{c |}
     {c LT}{hline 8}{c -}{hline 5}{c -}{hline 7}{c -}{hline 10}{c -}{hline 7}{c -}{hline 8}{c -}{hline 8}{c -}{hline 6}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 7}{c RT}
  1. {c |} {res} 4,099    22       3        2.5      11    2,930      186     40        121       3.58   Domestic          0          0      4,816       6 {txt}{c |}
  2. {c |} {res} 4,749    17       3        3.0      11    3,350      173     40        258       2.53   Domestic          0          0      4,816       6 {txt}{c |}
  3. {c |} {res} 3,799    22       .        3.0      12    2,640      168     35        121       3.08   Domestic          4          1      6,229       6 {txt}{c |}
  4. {c |} {res} 4,816    20       3        4.5      16    3,250      196     40        196       2.93   Domestic          0          0      4,816       6 {txt}{c |}
  5. {c |} {res} 7,827    15       4        4.0      20    4,080      222     43        350       2.41   Domestic          0          0     14,500      12 {txt}{c |}
     {c LT}{hline 8}{c -}{hline 5}{c -}{hline 7}{c -}{hline 10}{c -}{hline 7}{c -}{hline 8}{c -}{hline 8}{c -}{hline 6}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 7}{c RT}
  6. {c |} {res} 5,788    18       3        4.0      21    3,670      218     43        231       2.73   Domestic          0          0     14,500      12 {txt}{c |}
  7. {c |} {res} 4,453    26       .        3.0      10    2,230      170     34        304       2.87   Domestic          4          1      9,735       6 {txt}{c |}
  8. {c |} {res} 5,189    20       3        2.0      16    3,280      200     42        196       2.93   Domestic          0          0      5,798       7 {txt}{c |}
  9. {c |} {res}10,372    16       3        3.5      17    3,880      207     43        231       2.93   Domestic          0          0     14,500      12 {txt}{c |}
 10. {c |} {res} 4,082    19       3        3.5      13    3,400      200     42        231       3.08   Domestic          0          0      5,798       7 {txt}{c |}
     {c BLC}{hline 8}{c -}{hline 5}{c -}{hline 7}{c -}{hline 10}{c -}{hline 7}{c -}{hline 8}{c -}{hline 8}{c -}{hline 6}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 7}{c BRC}

{com}. 
. * TEST SPEED
. clear all
{txt}
{com}. 
. set obs 1000000
{txt}{p}
number of observations (_N)  was 0,
now 1,000,000
{p_end}

{com}. gen long firm = ceil(runiform() * c(N) / 10)
{txt}
{com}. bys firm: gen int year = _n
{txt}
{com}. xtset firm year
{res}{txt}{col 8}panel variable:  {res}firm (unbalanced)
{txt}{col 9}time variable:  {res}{col 25}year, 1 to 29
{txt}{col 17}delta:  {res}1 unit
{txt}
{com}. gen double x = rnormal()
{txt}
{com}. gen int y = ceil(runiform() * 10)
{txt}
{com}. 
. // sort year
. loc by year // firm
{txt}
{com}. 
. 
. 
. timer clear
{txt}
{com}. 
. 
. preserve
{txt}
{com}. timer on 8
{txt}
{com}. fcollapse (mean) x /*(max) y*/, by(`by') fast verbose
{res}{txt}(0 observations deleted)
{res}{txt}(obs: {res}1000000{txt}; levels: {res}29{txt};{txt} method: {res}hash0{txt}; dict size: {res}29{txt})
{res}  50:      0.29 /        1 =       0.2860
{txt}
{com}. timer off 8
{txt}
{com}. restore
{txt}
{com}. 
. preserve
{txt}
{com}. timer on 9
{txt}
{com}. fcollapse (mean) x /*(max) y*/, by(`by') fast verbose
{res}{txt}(0 observations deleted)
{res}{txt}(obs: {res}1000000{txt}; levels: {res}29{txt};{txt} method: {res}hash0{txt}; dict size: {res}29{txt})
{res}  50:      0.21 /        1 =       0.2140
{txt}
{com}. timer off 9
{txt}
{com}. restore
{txt}
{com}. 
. 
. timer on 1
{txt}
{com}. egen double mean_x = mean(x), by(`by')
{txt}
{com}. //egen int max_y = max(y), by(`by')
. timer off 1
{txt}
{com}. 
. //de
. //li in 1/10
. //drop mean_x
. //mata: bench = hash1(st_data(., "_all"))
. //mata: bench
. 
. drop *_*
{txt}
{com}. 
. set trace off
{txt}
{com}. timer on 2
{txt}
{com}. fcollapse (mean) x /*(max) y*/, by(`by') merge fast verbose
{res}{txt}(0 observations deleted)
{res}{txt}(obs: {res}1000000{txt}; levels: {res}29{txt};{txt} method: {res}hash0{txt}; dict size: {res}29{txt})
{res}  50:      0.21 /        1 =       0.2120
{txt}
{com}. timer off 2
{txt}
{com}. de, short

{txt}Contains data
  obs:{res}     1,000,000                          
{txt} vars:{res}             5                          
{txt} size:{res}    24,000,000                          
{txt}Sorted by: {res}firm  year
     Note: Dataset has changed since last saved.
{txt}
{com}. 
. //de
. //li in 1/10
. //drop mean_x
. //mata: ftools = hash1(st_data(., "_all"))
. //mata: ftools
. //mata: bench == ftools
. 
. drop *_*
{txt}
{com}. // this is overoptimistic b/c it doesnt sort back or count MVs...
. timer on 3
{txt}
{com}. bys `by': gen double mean_x = sum(x)
{txt}
{com}. bys `by': replace mean_x = mean_x[_N] / _N
{txt}(999998 real changes made)

{com}. timer off 3
{txt}
{com}. 
. drop *_*
{txt}
{com}. 
. timer list
{res}   1:      0.99 /        1 =       0.9870
   2:      0.58 /        1 =       0.5770
   3:      0.52 /        1 =       0.5220
   8:      0.72 /        1 =       0.7250
   9:      0.59 /        1 =       0.5880
{txt}
{com}. 
. 
. 
. exit

{txt}end of do-file


{com}. mata: mata desc

      {txt}# bytes   type                        name and extent
{hline 79}
{hline 79}

{com}. do demo_fcollapse_merge
{txt}
{com}. cap ado uninstall ftools
{txt}
{com}. net install ftools, from("C:/git/ftools/source")
checking {hilite:ftools} consistency and verifying not already installed...
installing into c:\ado\plus\...
installation complete.
{txt}
{com}. ftools compile
{txt}(compiling lftools.mlib for Stata 14.2)
(library saved in c:\ado\plus/l/lftools.mlib)

{com}. discard
{txt}
{com}. 
. clear all
{txt}
{com}. cls
{txt}
{com}. set more off
{txt}
{com}. 
. * benchmark
. sysuse auto
{txt}(1978 Automobile Data)

{com}. egen double sum_foreign = sum(foreign), by(turn)
{txt}
{com}. egen byte max_foreign = max(foreign), by(turn)
{txt}
{com}. egen int MAX_PRICE = max(price), by(turn)
{txt}
{com}. egen int _freq = count(turn), by(turn)
{txt}
{com}. 
. de *_*

              {txt}storage   display    value
variable name   type    format     label      variable label
{hline}
{p 0 48}{res}{bind:gear_ratio     }{txt}{bind: float   }{bind:{txt}%6.2f     }{space 1}{bind:         }{bind:  }{res}{res}Gear Ratio{p_end}
{p 0 48}{bind:sum_foreign    }{txt}{bind: double  }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:max_foreign    }{txt}{bind: byte    }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:MAX_PRICE      }{txt}{bind: int     }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:_freq          }{txt}{bind: int     }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{txt}
{com}. drop make
{txt}
{com}. mata: bench = hash1(st_data(., "_all"))
{res}{txt}
{com}. mata: bench
{res}  3965372940
{txt}
{com}. li in 1/10
{txt}
     {c TLC}{hline 8}{c -}{hline 5}{c -}{hline 7}{c -}{hline 10}{c -}{hline 7}{c -}{hline 8}{c -}{hline 8}{c -}{hline 6}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 7}{c TRC}
     {c |} {res} price   mpg   rep78   headroom   trunk   weight   length   turn   displa~t   gear_r~o    foreign   sum_fo~n   max_fo~n   MAX_PR~E   _freq {txt}{c |}
     {c LT}{hline 8}{c -}{hline 5}{c -}{hline 7}{c -}{hline 10}{c -}{hline 7}{c -}{hline 8}{c -}{hline 8}{c -}{hline 6}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 7}{c RT}
  1. {c |} {res} 4,099    22       3        2.5      11    2,930      186     40        121       3.58   Domestic          0          0       4816       6 {txt}{c |}
  2. {c |} {res} 4,749    17       3        3.0      11    3,350      173     40        258       2.53   Domestic          0          0       4816       6 {txt}{c |}
  3. {c |} {res} 3,799    22       .        3.0      12    2,640      168     35        121       3.08   Domestic          4          1       6229       6 {txt}{c |}
  4. {c |} {res} 4,816    20       3        4.5      16    3,250      196     40        196       2.93   Domestic          0          0       4816       6 {txt}{c |}
  5. {c |} {res} 7,827    15       4        4.0      20    4,080      222     43        350       2.41   Domestic          0          0      14500      12 {txt}{c |}
     {c LT}{hline 8}{c -}{hline 5}{c -}{hline 7}{c -}{hline 10}{c -}{hline 7}{c -}{hline 8}{c -}{hline 8}{c -}{hline 6}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 7}{c RT}
  6. {c |} {res} 5,788    18       3        4.0      21    3,670      218     43        231       2.73   Domestic          0          0      14500      12 {txt}{c |}
  7. {c |} {res} 4,453    26       .        3.0      10    2,230      170     34        304       2.87   Domestic          4          1       9735       6 {txt}{c |}
  8. {c |} {res} 5,189    20       3        2.0      16    3,280      200     42        196       2.93   Domestic          0          0       5798       7 {txt}{c |}
  9. {c |} {res}10,372    16       3        3.5      17    3,880      207     43        231       2.93   Domestic          0          0      14500      12 {txt}{c |}
 10. {c |} {res} 4,082    19       3        3.5      13    3,400      200     42        231       3.08   Domestic          0          0       5798       7 {txt}{c |}
     {c BLC}{hline 8}{c -}{hline 5}{c -}{hline 7}{c -}{hline 10}{c -}{hline 7}{c -}{hline 8}{c -}{hline 8}{c -}{hline 6}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 7}{c BRC}

{com}. 
. sysuse auto, clear
{txt}(1978 Automobile Data)

{com}. fcollapse (sum) foreign (max) MAX_PRICE=price foreign, by(turn) merge freq v
{res}{txt}(0 observations deleted)
{res}{txt}(obs: {res}74{txt}; levels: {res}18{txt};{txt} method: {res}hash0{txt}; dict size: {res}21{txt})
{res}  50:      0.08 /        1 =       0.0820
{txt}
{com}. 
. de *_*

              {txt}storage   display    value
variable name   type    format     label      variable label
{hline}
{p 0 48}{res}{bind:gear_ratio     }{txt}{bind: float   }{bind:{txt}%6.2f     }{space 1}{bind:         }{bind:  }{res}{res}Gear Ratio{p_end}
{p 0 48}{bind:sum_foreign    }{txt}{bind: double  }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}(sum) foreign{p_end}
{p 0 48}{bind:max_foreign    }{txt}{bind: byte    }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}(max) foreign{p_end}
{p 0 48}{bind:MAX_PRICE      }{txt}{bind: int     }{bind:{txt}%8.0gc    }{space 1}{bind:         }{bind:  }{res}{res}(max) price{p_end}
{p 0 48}{bind:_freq          }{txt}{bind: byte    }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}Frequency{p_end}
{txt}
{com}. drop make
{txt}
{com}. mata: ftools = hash1(st_data(., "_all"))
{res}{txt}
{com}. mata: ftools
{res}  3965372940
{txt}
{com}. mata: bench == ftools
{res}  1
{txt}
{com}. li in 1/10
{txt}
     {c TLC}{hline 8}{c -}{hline 5}{c -}{hline 7}{c -}{hline 10}{c -}{hline 7}{c -}{hline 8}{c -}{hline 8}{c -}{hline 6}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 7}{c TRC}
     {c |} {res} price   mpg   rep78   headroom   trunk   weight   length   turn   displa~t   gear_r~o    foreign   sum_fo~n   max_fo~n   MAX_PR~E   _freq {txt}{c |}
     {c LT}{hline 8}{c -}{hline 5}{c -}{hline 7}{c -}{hline 10}{c -}{hline 7}{c -}{hline 8}{c -}{hline 8}{c -}{hline 6}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 7}{c RT}
  1. {c |} {res} 4,099    22       3        2.5      11    2,930      186     40        121       3.58   Domestic          0          0      4,816       6 {txt}{c |}
  2. {c |} {res} 4,749    17       3        3.0      11    3,350      173     40        258       2.53   Domestic          0          0      4,816       6 {txt}{c |}
  3. {c |} {res} 3,799    22       .        3.0      12    2,640      168     35        121       3.08   Domestic          4          1      6,229       6 {txt}{c |}
  4. {c |} {res} 4,816    20       3        4.5      16    3,250      196     40        196       2.93   Domestic          0          0      4,816       6 {txt}{c |}
  5. {c |} {res} 7,827    15       4        4.0      20    4,080      222     43        350       2.41   Domestic          0          0     14,500      12 {txt}{c |}
     {c LT}{hline 8}{c -}{hline 5}{c -}{hline 7}{c -}{hline 10}{c -}{hline 7}{c -}{hline 8}{c -}{hline 8}{c -}{hline 6}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 7}{c RT}
  6. {c |} {res} 5,788    18       3        4.0      21    3,670      218     43        231       2.73   Domestic          0          0     14,500      12 {txt}{c |}
  7. {c |} {res} 4,453    26       .        3.0      10    2,230      170     34        304       2.87   Domestic          4          1      9,735       6 {txt}{c |}
  8. {c |} {res} 5,189    20       3        2.0      16    3,280      200     42        196       2.93   Domestic          0          0      5,798       7 {txt}{c |}
  9. {c |} {res}10,372    16       3        3.5      17    3,880      207     43        231       2.93   Domestic          0          0     14,500      12 {txt}{c |}
 10. {c |} {res} 4,082    19       3        3.5      13    3,400      200     42        231       3.08   Domestic          0          0      5,798       7 {txt}{c |}
     {c BLC}{hline 8}{c -}{hline 5}{c -}{hline 7}{c -}{hline 10}{c -}{hline 7}{c -}{hline 8}{c -}{hline 8}{c -}{hline 6}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 7}{c BRC}

{com}. 
. * TEST SPEED
. clear
{txt}
{com}. 
. set obs 1000000
{txt}{p}
number of observations (_N)  was 0,
now 1,000,000
{p_end}

{com}. gen long firm = ceil(runiform() * c(N) / 10)
{txt}
{com}. bys firm: gen int year = _n
{txt}
{com}. xtset firm year
{res}{txt}{col 8}panel variable:  {res}firm (unbalanced)
{txt}{col 9}time variable:  {res}{col 25}year, 1 to 27
{txt}{col 17}delta:  {res}1 unit
{txt}
{com}. gen double x = rnormal()
{txt}
{com}. gen int y = ceil(runiform() * 10)
{txt}
{com}. 
. // sort year
. loc by year // firm
{txt}
{com}. 
. 
. 
. timer clear
{txt}
{com}. 
. 
. preserve
{txt}
{com}. timer on 8
{txt}
{com}. fcollapse (mean) x /*(max) y*/, by(`by') fast verbose
{res}{txt}(0 observations deleted)
{res}{txt}(obs: {res}1000000{txt}; levels: {res}27{txt};{txt} method: {res}hash0{txt}; dict size: {res}27{txt})
{res}  50:      0.21 /        1 =       0.2110
{txt}
{com}. timer off 8
{txt}
{com}. restore
{txt}
{com}. 
. preserve
{txt}
{com}. timer on 9
{txt}
{com}. fcollapse (mean) x /*(max) y*/, by(`by') fast verbose
{res}{txt}(0 observations deleted)
{res}{txt}(obs: {res}1000000{txt}; levels: {res}27{txt};{txt} method: {res}hash0{txt}; dict size: {res}27{txt})
{res}  50:      0.21 /        1 =       0.2130
{txt}
{com}. timer off 9
{txt}
{com}. restore
{txt}
{com}. 
. 
. timer on 1
{txt}
{com}. egen double mean_x = mean(x), by(`by')
{txt}
{com}. //egen int max_y = max(y), by(`by')
. timer off 1
{txt}
{com}. 
. //de
. //li in 1/10
. //drop mean_x
. //mata: bench = hash1(st_data(., "_all"))
. //mata: bench
. 
. drop *_*
{txt}
{com}. 
. set trace off
{txt}
{com}. timer on 2
{txt}
{com}. fcollapse (mean) x /*(max) y*/, by(`by') merge fast verbose
{res}{txt}(0 observations deleted)
{res}{txt}(obs: {res}1000000{txt}; levels: {res}27{txt};{txt} method: {res}hash0{txt}; dict size: {res}27{txt})
{res}  50:      0.21 /        1 =       0.2140
{txt}
{com}. timer off 2
{txt}
{com}. de, short

{txt}Contains data
  obs:{res}     1,000,000                          
{txt} vars:{res}             5                          
{txt} size:{res}    24,000,000                          
{txt}Sorted by: {res}firm  year
     Note: Dataset has changed since last saved.
{txt}
{com}. 
. //de
. //li in 1/10
. //drop mean_x
. //mata: ftools = hash1(st_data(., "_all"))
. //mata: ftools
. //mata: bench == ftools
. 
. drop *_*
{txt}
{com}. // this is overoptimistic b/c it doesnt sort back or count MVs...
. timer on 3
{txt}
{com}. bys `by': gen double mean_x = sum(x)
{txt}
{com}. bys `by': replace mean_x = mean_x[_N] / _N
{txt}(999997 real changes made)

{com}. timer off 3
{txt}
{com}. 
. drop *_*
{txt}
{com}. 
. timer list
{res}   1:      0.97 /        1 =       0.9740
   2:      0.58 /        1 =       0.5810
   3:      0.55 /        1 =       0.5450
   8:      0.56 /        1 =       0.5590
   9:      0.57 /        1 =       0.5670
{txt}
{com}. 
. 
. 
. exit

{txt}end of do-file


{com}. do demo_fcollapse_merge
{txt}
{com}. cap ado uninstall ftools
{txt}
{com}. net install ftools, from("C:/git/ftools/source")
checking {hilite:ftools} consistency and verifying not already installed...
installing into c:\ado\plus\...
installation complete.
{txt}
{com}. ftools compile
{txt}(compiling lftools.mlib for Stata 14.2)
(library saved in c:\ado\plus/l/lftools.mlib)

{com}. discard
{txt}
{com}. 
. clear all
{txt}
{com}. cls
{txt}
{com}. set more off
{txt}
{com}. 
. * benchmark
. sysuse auto
{txt}(1978 Automobile Data)

{com}. egen double sum_foreign = sum(foreign), by(turn)
{txt}
{com}. egen byte max_foreign = max(foreign), by(turn)
{txt}
{com}. egen int MAX_PRICE = max(price), by(turn)
{txt}
{com}. egen int _freq = count(turn), by(turn)
{txt}
{com}. 
. de *_*

              {txt}storage   display    value
variable name   type    format     label      variable label
{hline}
{p 0 48}{res}{bind:gear_ratio     }{txt}{bind: float   }{bind:{txt}%6.2f     }{space 1}{bind:         }{bind:  }{res}{res}Gear Ratio{p_end}
{p 0 48}{bind:sum_foreign    }{txt}{bind: double  }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:max_foreign    }{txt}{bind: byte    }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:MAX_PRICE      }{txt}{bind: int     }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:_freq          }{txt}{bind: int     }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{txt}
{com}. drop make
{txt}
{com}. mata: bench = hash1(st_data(., "_all"))
{res}{txt}
{com}. mata: bench
{res}  3965372940
{txt}
{com}. li in 1/10
{txt}
     {c TLC}{hline 8}{c -}{hline 5}{c -}{hline 7}{c -}{hline 10}{c -}{hline 7}{c -}{hline 8}{c -}{hline 8}{c -}{hline 6}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 7}{c TRC}
     {c |} {res} price   mpg   rep78   headroom   trunk   weight   length   turn   displa~t   gear_r~o    foreign   sum_fo~n   max_fo~n   MAX_PR~E   _freq {txt}{c |}
     {c LT}{hline 8}{c -}{hline 5}{c -}{hline 7}{c -}{hline 10}{c -}{hline 7}{c -}{hline 8}{c -}{hline 8}{c -}{hline 6}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 7}{c RT}
  1. {c |} {res} 4,099    22       3        2.5      11    2,930      186     40        121       3.58   Domestic          0          0       4816       6 {txt}{c |}
  2. {c |} {res} 4,749    17       3        3.0      11    3,350      173     40        258       2.53   Domestic          0          0       4816       6 {txt}{c |}
  3. {c |} {res} 3,799    22       .        3.0      12    2,640      168     35        121       3.08   Domestic          4          1       6229       6 {txt}{c |}
  4. {c |} {res} 4,816    20       3        4.5      16    3,250      196     40        196       2.93   Domestic          0          0       4816       6 {txt}{c |}
  5. {c |} {res} 7,827    15       4        4.0      20    4,080      222     43        350       2.41   Domestic          0          0      14500      12 {txt}{c |}
     {c LT}{hline 8}{c -}{hline 5}{c -}{hline 7}{c -}{hline 10}{c -}{hline 7}{c -}{hline 8}{c -}{hline 8}{c -}{hline 6}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 7}{c RT}
  6. {c |} {res} 5,788    18       3        4.0      21    3,670      218     43        231       2.73   Domestic          0          0      14500      12 {txt}{c |}
  7. {c |} {res} 4,453    26       .        3.0      10    2,230      170     34        304       2.87   Domestic          4          1       9735       6 {txt}{c |}
  8. {c |} {res} 5,189    20       3        2.0      16    3,280      200     42        196       2.93   Domestic          0          0       5798       7 {txt}{c |}
  9. {c |} {res}10,372    16       3        3.5      17    3,880      207     43        231       2.93   Domestic          0          0      14500      12 {txt}{c |}
 10. {c |} {res} 4,082    19       3        3.5      13    3,400      200     42        231       3.08   Domestic          0          0       5798       7 {txt}{c |}
     {c BLC}{hline 8}{c -}{hline 5}{c -}{hline 7}{c -}{hline 10}{c -}{hline 7}{c -}{hline 8}{c -}{hline 8}{c -}{hline 6}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 7}{c BRC}

{com}. 
. sysuse auto, clear
{txt}(1978 Automobile Data)

{com}. fcollapse (sum) foreign (max) MAX_PRICE=price foreign, by(turn) merge freq v
{res}{txt}(0 observations deleted)
{res}{txt}(obs: {res}74{txt}; levels: {res}18{txt};{txt} method: {res}hash0{txt}; dict size: {res}21{txt})
{res}  50:      0.08 /        1 =       0.0820
{txt}
{com}. 
. de *_*

              {txt}storage   display    value
variable name   type    format     label      variable label
{hline}
{p 0 48}{res}{bind:gear_ratio     }{txt}{bind: float   }{bind:{txt}%6.2f     }{space 1}{bind:         }{bind:  }{res}{res}Gear Ratio{p_end}
{p 0 48}{bind:sum_foreign    }{txt}{bind: double  }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}(sum) foreign{p_end}
{p 0 48}{bind:max_foreign    }{txt}{bind: byte    }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}(max) foreign{p_end}
{p 0 48}{bind:MAX_PRICE      }{txt}{bind: int     }{bind:{txt}%8.0gc    }{space 1}{bind:         }{bind:  }{res}{res}(max) price{p_end}
{p 0 48}{bind:_freq          }{txt}{bind: byte    }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}Frequency{p_end}
{txt}
{com}. drop make
{txt}
{com}. mata: ftools = hash1(st_data(., "_all"))
{res}{txt}
{com}. mata: ftools
{res}  3965372940
{txt}
{com}. mata: bench == ftools
{res}  1
{txt}
{com}. li in 1/10
{txt}
     {c TLC}{hline 8}{c -}{hline 5}{c -}{hline 7}{c -}{hline 10}{c -}{hline 7}{c -}{hline 8}{c -}{hline 8}{c -}{hline 6}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 7}{c TRC}
     {c |} {res} price   mpg   rep78   headroom   trunk   weight   length   turn   displa~t   gear_r~o    foreign   sum_fo~n   max_fo~n   MAX_PR~E   _freq {txt}{c |}
     {c LT}{hline 8}{c -}{hline 5}{c -}{hline 7}{c -}{hline 10}{c -}{hline 7}{c -}{hline 8}{c -}{hline 8}{c -}{hline 6}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 7}{c RT}
  1. {c |} {res} 4,099    22       3        2.5      11    2,930      186     40        121       3.58   Domestic          0          0      4,816       6 {txt}{c |}
  2. {c |} {res} 4,749    17       3        3.0      11    3,350      173     40        258       2.53   Domestic          0          0      4,816       6 {txt}{c |}
  3. {c |} {res} 3,799    22       .        3.0      12    2,640      168     35        121       3.08   Domestic          4          1      6,229       6 {txt}{c |}
  4. {c |} {res} 4,816    20       3        4.5      16    3,250      196     40        196       2.93   Domestic          0          0      4,816       6 {txt}{c |}
  5. {c |} {res} 7,827    15       4        4.0      20    4,080      222     43        350       2.41   Domestic          0          0     14,500      12 {txt}{c |}
     {c LT}{hline 8}{c -}{hline 5}{c -}{hline 7}{c -}{hline 10}{c -}{hline 7}{c -}{hline 8}{c -}{hline 8}{c -}{hline 6}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 7}{c RT}
  6. {c |} {res} 5,788    18       3        4.0      21    3,670      218     43        231       2.73   Domestic          0          0     14,500      12 {txt}{c |}
  7. {c |} {res} 4,453    26       .        3.0      10    2,230      170     34        304       2.87   Domestic          4          1      9,735       6 {txt}{c |}
  8. {c |} {res} 5,189    20       3        2.0      16    3,280      200     42        196       2.93   Domestic          0          0      5,798       7 {txt}{c |}
  9. {c |} {res}10,372    16       3        3.5      17    3,880      207     43        231       2.93   Domestic          0          0     14,500      12 {txt}{c |}
 10. {c |} {res} 4,082    19       3        3.5      13    3,400      200     42        231       3.08   Domestic          0          0      5,798       7 {txt}{c |}
     {c BLC}{hline 8}{c -}{hline 5}{c -}{hline 7}{c -}{hline 10}{c -}{hline 7}{c -}{hline 8}{c -}{hline 8}{c -}{hline 6}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 7}{c BRC}

{com}. 
. * TEST SPEED
. clear
{txt}
{com}. 
. set obs 1000000
{txt}{p}
number of observations (_N)  was 0,
now 1,000,000
{p_end}

{com}. gen long firm = ceil(runiform() * c(N) / 10)
{txt}
{com}. bys firm: gen int year = _n
{txt}
{com}. xtset firm year
{res}{txt}{col 8}panel variable:  {res}firm (unbalanced)
{txt}{col 9}time variable:  {res}{col 25}year, 1 to 29
{txt}{col 17}delta:  {res}1 unit
{txt}
{com}. gen double x = rnormal()
{txt}
{com}. gen int y = ceil(runiform() * 10)
{txt}
{com}. 
. // sort year
. loc by year // firm
{txt}
{com}. 
. 
. 
. timer clear
{txt}
{com}. 
. 
. /*preserve
> timer on 8
> fcollapse (mean) x /*(max) y*/, by(`by') fast verbose
> timer off 8
> restore
> 
> preserve
> timer on 9
> fcollapse (mean) x /*(max) y*/, by(`by') fast verbose
> timer off 9
> restore
> */
. 
. timer on 1
{txt}
{com}. egen double mean_x = mean(x), by(`by')
{txt}
{com}. //egen int max_y = max(y), by(`by')
. timer off 1
{txt}
{com}. 
. //de
. //li in 1/10
. //drop mean_x
. //mata: bench = hash1(st_data(., "_all"))
. //mata: bench
. 
. drop *_*
{txt}
{com}. 
. set trace off
{txt}
{com}. timer on 2
{txt}
{com}. fcollapse (mean) x /*(max) y*/, by(`by') merge fast verbose
{res}{txt}(0 observations deleted)
{res}{txt}(obs: {res}1000000{txt}; levels: {res}29{txt};{txt} method: {res}hash0{txt}; dict size: {res}29{txt})
{res}  50:      0.22 /        1 =       0.2170
{txt}
{com}. timer off 2
{txt}
{com}. de, short

{txt}Contains data
  obs:{res}     1,000,000                          
{txt} vars:{res}             5                          
{txt} size:{res}    24,000,000                          
{txt}Sorted by: {res}firm  year
     Note: Dataset has changed since last saved.
{txt}
{com}. 
. //de
. //li in 1/10
. //drop mean_x
. //mata: ftools = hash1(st_data(., "_all"))
. //mata: ftools
. //mata: bench == ftools
. 
. drop *_*
{txt}
{com}. // this is overoptimistic b/c it doesnt sort back or count MVs...
. timer on 3
{txt}
{com}. bys `by': gen double mean_x = sum(x)
{txt}
{com}. bys `by': replace mean_x = mean_x[_N] / _N
{txt}(999999 real changes made)

{com}. timer off 3
{txt}
{com}. 
. drop *_*
{txt}
{com}. 
. timer list
{res}   1:      0.99 /        1 =       0.9910
   2:      0.58 /        1 =       0.5840
   3:      0.53 /        1 =       0.5250
{txt}
{com}. 
. 
. 
. exit

{txt}end of do-file


{com}. do demo_fcollapse_merge
{txt}
{com}. cap ado uninstall ftools
{txt}
{com}. net install ftools, from("C:/git/ftools/source")
checking {hilite:ftools} consistency and verifying not already installed...
installing into c:\ado\plus\...
installation complete.
{txt}
{com}. ftools compile
{txt}(compiling lftools.mlib for Stata 14.2)
(library saved in c:\ado\plus/l/lftools.mlib)

{com}. discard
{txt}
{com}. 
. clear all
{txt}
{com}. cls
{txt}
{com}. set more off
{txt}
{com}. 
. * benchmark
. sysuse auto
{txt}(1978 Automobile Data)

{com}. egen double sum_foreign = sum(foreign), by(turn)
{txt}
{com}. egen byte max_foreign = max(foreign), by(turn)
{txt}
{com}. egen int MAX_PRICE = max(price), by(turn)
{txt}
{com}. egen int _freq = count(turn), by(turn)
{txt}
{com}. 
. de *_*

              {txt}storage   display    value
variable name   type    format     label      variable label
{hline}
{p 0 48}{res}{bind:gear_ratio     }{txt}{bind: float   }{bind:{txt}%6.2f     }{space 1}{bind:         }{bind:  }{res}{res}Gear Ratio{p_end}
{p 0 48}{bind:sum_foreign    }{txt}{bind: double  }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:max_foreign    }{txt}{bind: byte    }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:MAX_PRICE      }{txt}{bind: int     }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:_freq          }{txt}{bind: int     }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{txt}
{com}. drop make
{txt}
{com}. mata: bench = hash1(st_data(., "_all"))
{res}{txt}
{com}. mata: bench
{res}  3965372940
{txt}
{com}. li in 1/10
{txt}
     {c TLC}{hline 8}{c -}{hline 5}{c -}{hline 7}{c -}{hline 10}{c -}{hline 7}{c -}{hline 8}{c -}{hline 8}{c -}{hline 6}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 7}{c TRC}
     {c |} {res} price   mpg   rep78   headroom   trunk   weight   length   turn   displa~t   gear_r~o    foreign   sum_fo~n   max_fo~n   MAX_PR~E   _freq {txt}{c |}
     {c LT}{hline 8}{c -}{hline 5}{c -}{hline 7}{c -}{hline 10}{c -}{hline 7}{c -}{hline 8}{c -}{hline 8}{c -}{hline 6}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 7}{c RT}
  1. {c |} {res} 4,099    22       3        2.5      11    2,930      186     40        121       3.58   Domestic          0          0       4816       6 {txt}{c |}
  2. {c |} {res} 4,749    17       3        3.0      11    3,350      173     40        258       2.53   Domestic          0          0       4816       6 {txt}{c |}
  3. {c |} {res} 3,799    22       .        3.0      12    2,640      168     35        121       3.08   Domestic          4          1       6229       6 {txt}{c |}
  4. {c |} {res} 4,816    20       3        4.5      16    3,250      196     40        196       2.93   Domestic          0          0       4816       6 {txt}{c |}
  5. {c |} {res} 7,827    15       4        4.0      20    4,080      222     43        350       2.41   Domestic          0          0      14500      12 {txt}{c |}
     {c LT}{hline 8}{c -}{hline 5}{c -}{hline 7}{c -}{hline 10}{c -}{hline 7}{c -}{hline 8}{c -}{hline 8}{c -}{hline 6}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 7}{c RT}
  6. {c |} {res} 5,788    18       3        4.0      21    3,670      218     43        231       2.73   Domestic          0          0      14500      12 {txt}{c |}
  7. {c |} {res} 4,453    26       .        3.0      10    2,230      170     34        304       2.87   Domestic          4          1       9735       6 {txt}{c |}
  8. {c |} {res} 5,189    20       3        2.0      16    3,280      200     42        196       2.93   Domestic          0          0       5798       7 {txt}{c |}
  9. {c |} {res}10,372    16       3        3.5      17    3,880      207     43        231       2.93   Domestic          0          0      14500      12 {txt}{c |}
 10. {c |} {res} 4,082    19       3        3.5      13    3,400      200     42        231       3.08   Domestic          0          0       5798       7 {txt}{c |}
     {c BLC}{hline 8}{c -}{hline 5}{c -}{hline 7}{c -}{hline 10}{c -}{hline 7}{c -}{hline 8}{c -}{hline 8}{c -}{hline 6}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 7}{c BRC}

{com}. 
. sysuse auto, clear
{txt}(1978 Automobile Data)

{com}. fcollapse (sum) foreign (max) MAX_PRICE=price foreign, by(turn) merge freq v
{res}{txt}(0 observations deleted)
{res}{txt}(obs: {res}74{txt}; levels: {res}18{txt};{txt} method: {res}hash0{txt}; dict size: {res}21{txt})
{res}  50:      0.08 /        1 =       0.0820
{txt}
{com}. 
. de *_*

              {txt}storage   display    value
variable name   type    format     label      variable label
{hline}
{p 0 48}{res}{bind:gear_ratio     }{txt}{bind: float   }{bind:{txt}%6.2f     }{space 1}{bind:         }{bind:  }{res}{res}Gear Ratio{p_end}
{p 0 48}{bind:sum_foreign    }{txt}{bind: double  }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}(sum) foreign{p_end}
{p 0 48}{bind:max_foreign    }{txt}{bind: byte    }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}(max) foreign{p_end}
{p 0 48}{bind:MAX_PRICE      }{txt}{bind: int     }{bind:{txt}%8.0gc    }{space 1}{bind:         }{bind:  }{res}{res}(max) price{p_end}
{p 0 48}{bind:_freq          }{txt}{bind: byte    }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}Frequency{p_end}
{txt}
{com}. drop make
{txt}
{com}. mata: ftools = hash1(st_data(., "_all"))
{res}{txt}
{com}. mata: ftools
{res}  3965372940
{txt}
{com}. mata: bench == ftools
{res}  1
{txt}
{com}. li in 1/10
{txt}
     {c TLC}{hline 8}{c -}{hline 5}{c -}{hline 7}{c -}{hline 10}{c -}{hline 7}{c -}{hline 8}{c -}{hline 8}{c -}{hline 6}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 7}{c TRC}
     {c |} {res} price   mpg   rep78   headroom   trunk   weight   length   turn   displa~t   gear_r~o    foreign   sum_fo~n   max_fo~n   MAX_PR~E   _freq {txt}{c |}
     {c LT}{hline 8}{c -}{hline 5}{c -}{hline 7}{c -}{hline 10}{c -}{hline 7}{c -}{hline 8}{c -}{hline 8}{c -}{hline 6}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 7}{c RT}
  1. {c |} {res} 4,099    22       3        2.5      11    2,930      186     40        121       3.58   Domestic          0          0      4,816       6 {txt}{c |}
  2. {c |} {res} 4,749    17       3        3.0      11    3,350      173     40        258       2.53   Domestic          0          0      4,816       6 {txt}{c |}
  3. {c |} {res} 3,799    22       .        3.0      12    2,640      168     35        121       3.08   Domestic          4          1      6,229       6 {txt}{c |}
  4. {c |} {res} 4,816    20       3        4.5      16    3,250      196     40        196       2.93   Domestic          0          0      4,816       6 {txt}{c |}
  5. {c |} {res} 7,827    15       4        4.0      20    4,080      222     43        350       2.41   Domestic          0          0     14,500      12 {txt}{c |}
     {c LT}{hline 8}{c -}{hline 5}{c -}{hline 7}{c -}{hline 10}{c -}{hline 7}{c -}{hline 8}{c -}{hline 8}{c -}{hline 6}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 7}{c RT}
  6. {c |} {res} 5,788    18       3        4.0      21    3,670      218     43        231       2.73   Domestic          0          0     14,500      12 {txt}{c |}
  7. {c |} {res} 4,453    26       .        3.0      10    2,230      170     34        304       2.87   Domestic          4          1      9,735       6 {txt}{c |}
  8. {c |} {res} 5,189    20       3        2.0      16    3,280      200     42        196       2.93   Domestic          0          0      5,798       7 {txt}{c |}
  9. {c |} {res}10,372    16       3        3.5      17    3,880      207     43        231       2.93   Domestic          0          0     14,500      12 {txt}{c |}
 10. {c |} {res} 4,082    19       3        3.5      13    3,400      200     42        231       3.08   Domestic          0          0      5,798       7 {txt}{c |}
     {c BLC}{hline 8}{c -}{hline 5}{c -}{hline 7}{c -}{hline 10}{c -}{hline 7}{c -}{hline 8}{c -}{hline 8}{c -}{hline 6}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 7}{c BRC}

{com}. 
. * TEST SPEED
. clear
{txt}
{com}. 
. set obs 1000000
{txt}{p}
number of observations (_N)  was 0,
now 1,000,000
{p_end}

{com}. gen long firm = ceil(runiform() * c(N) / 10)
{txt}
{com}. bys firm: gen int year = _n
{txt}
{com}. xtset firm year
{res}{txt}{col 8}panel variable:  {res}firm (unbalanced)
{txt}{col 9}time variable:  {res}{col 25}year, 1 to 27
{txt}{col 17}delta:  {res}1 unit
{txt}
{com}. gen double x = rnormal()
{txt}
{com}. gen int y = ceil(runiform() * 10)
{txt}
{com}. 
. // sort year
. loc by year // firm
{txt}
{com}. 
. 
. 
. timer clear
{txt}
{com}. 
. 
. /*preserve
> timer on 8
> fcollapse (mean) x /*(max) y*/, by(`by') fast verbose
> timer off 8
> restore
> 
> preserve
> timer on 9
> fcollapse (mean) x /*(max) y*/, by(`by') fast verbose
> timer off 9
> restore
> */
. 
. timer on 1
{txt}
{com}. egen double mean_x = mean(x), by(`by')
{txt}
{com}. //egen int max_y = max(y), by(`by')
. timer off 1
{txt}
{com}. 
. //de
. //li in 1/10
. //drop mean_x
. //mata: bench = hash1(st_data(., "_all"))
. //mata: bench
. 
. drop *_*
{txt}
{com}. 
. set trace off
{txt}
{com}. timer on 2
{txt}
{com}. fcollapse (mean) x /*(max) y*/, by(`by') merge fast verbose
{res}{txt}(0 observations deleted)
{res}{txt}(obs: {res}1000000{txt}; levels: {res}27{txt};{txt} method: {res}hash0{txt}; dict size: {res}27{txt})
{res}  50:      0.21 /        1 =       0.2130
{txt}
{com}. timer off 2
{txt}
{com}. de, short

{txt}Contains data
  obs:{res}     1,000,000                          
{txt} vars:{res}             5                          
{txt} size:{res}    24,000,000                          
{txt}Sorted by: {res}firm  year
     Note: Dataset has changed since last saved.
{txt}
{com}. 
. //de
. //li in 1/10
. //drop mean_x
. //mata: ftools = hash1(st_data(., "_all"))
. //mata: ftools
. //mata: bench == ftools
. 
. drop *_*
{txt}
{com}. // this is overoptimistic b/c it doesnt sort back or count MVs...
. timer on 3
{txt}
{com}. bys `by': gen double mean_x = sum(x)
{txt}
{com}. bys `by': replace mean_x = mean_x[_N] / _N
{txt}(999999 real changes made)

{com}. timer off 3
{txt}
{com}. 
. drop *_*
{txt}
{com}. 
. timer list
{res}   1:      1.02 /        1 =       1.0160
   2:      0.59 /        1 =       0.5930
   3:      0.51 /        1 =       0.5140
{txt}
{com}. di as text "1 egen 2 fcollapse+merge 3 bysort"
{res}{txt}1 egen 2 fcollapse+merge 3 bysort

{com}. 
. 
. exit

{txt}end of do-file


{com}. do demo_fcollapse_merge
{txt}
{com}. cap ado uninstall ftools
{txt}
{com}. net install ftools, from("C:/git/ftools/source")
checking {hilite:ftools} consistency and verifying not already installed...
installing into c:\ado\plus\...
installation complete.
{txt}
{com}. ftools compile
{txt}(compiling lftools.mlib for Stata 14.2)
(library saved in c:\ado\plus/l/lftools.mlib)

{com}. discard
{txt}
{com}. 
. clear all
{txt}
{com}. cls
{txt}
{com}. set more off
{txt}
{com}. 
. cap pr drop Bysort
{txt}
{com}. pr Bysort
{txt}  1{com}.         loc by `0'
{txt}  2{com}.         bys `by': gen double mean_x = sum(x)
{txt}  3{com}.         bys `by': replace mean_x = mean_x[_N] / _N
{txt}  4{com}. end
{txt}
{com}. 
. * benchmark
. sysuse auto
{txt}(1978 Automobile Data)

{com}. egen double sum_foreign = sum(foreign), by(turn)
{txt}
{com}. egen byte max_foreign = max(foreign), by(turn)
{txt}
{com}. egen int MAX_PRICE = max(price), by(turn)
{txt}
{com}. egen int _freq = count(turn), by(turn)
{txt}
{com}. 
. de *_*

              {txt}storage   display    value
variable name   type    format     label      variable label
{hline}
{p 0 48}{res}{bind:gear_ratio     }{txt}{bind: float   }{bind:{txt}%6.2f     }{space 1}{bind:         }{bind:  }{res}{res}Gear Ratio{p_end}
{p 0 48}{bind:sum_foreign    }{txt}{bind: double  }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:max_foreign    }{txt}{bind: byte    }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:MAX_PRICE      }{txt}{bind: int     }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:_freq          }{txt}{bind: int     }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{txt}
{com}. drop make
{txt}
{com}. mata: bench = hash1(st_data(., "_all"))
{res}{txt}
{com}. mata: bench
{res}  3965372940
{txt}
{com}. li in 1/10
{txt}
     {c TLC}{hline 8}{c -}{hline 5}{c -}{hline 7}{c -}{hline 10}{c -}{hline 7}{c -}{hline 8}{c -}{hline 8}{c -}{hline 6}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 7}{c TRC}
     {c |} {res} price   mpg   rep78   headroom   trunk   weight   length   turn   displa~t   gear_r~o    foreign   sum_fo~n   max_fo~n   MAX_PR~E   _freq {txt}{c |}
     {c LT}{hline 8}{c -}{hline 5}{c -}{hline 7}{c -}{hline 10}{c -}{hline 7}{c -}{hline 8}{c -}{hline 8}{c -}{hline 6}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 7}{c RT}
  1. {c |} {res} 4,099    22       3        2.5      11    2,930      186     40        121       3.58   Domestic          0          0       4816       6 {txt}{c |}
  2. {c |} {res} 4,749    17       3        3.0      11    3,350      173     40        258       2.53   Domestic          0          0       4816       6 {txt}{c |}
  3. {c |} {res} 3,799    22       .        3.0      12    2,640      168     35        121       3.08   Domestic          4          1       6229       6 {txt}{c |}
  4. {c |} {res} 4,816    20       3        4.5      16    3,250      196     40        196       2.93   Domestic          0          0       4816       6 {txt}{c |}
  5. {c |} {res} 7,827    15       4        4.0      20    4,080      222     43        350       2.41   Domestic          0          0      14500      12 {txt}{c |}
     {c LT}{hline 8}{c -}{hline 5}{c -}{hline 7}{c -}{hline 10}{c -}{hline 7}{c -}{hline 8}{c -}{hline 8}{c -}{hline 6}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 7}{c RT}
  6. {c |} {res} 5,788    18       3        4.0      21    3,670      218     43        231       2.73   Domestic          0          0      14500      12 {txt}{c |}
  7. {c |} {res} 4,453    26       .        3.0      10    2,230      170     34        304       2.87   Domestic          4          1       9735       6 {txt}{c |}
  8. {c |} {res} 5,189    20       3        2.0      16    3,280      200     42        196       2.93   Domestic          0          0       5798       7 {txt}{c |}
  9. {c |} {res}10,372    16       3        3.5      17    3,880      207     43        231       2.93   Domestic          0          0      14500      12 {txt}{c |}
 10. {c |} {res} 4,082    19       3        3.5      13    3,400      200     42        231       3.08   Domestic          0          0       5798       7 {txt}{c |}
     {c BLC}{hline 8}{c -}{hline 5}{c -}{hline 7}{c -}{hline 10}{c -}{hline 7}{c -}{hline 8}{c -}{hline 8}{c -}{hline 6}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 7}{c BRC}

{com}. 
. sysuse auto, clear
{txt}(1978 Automobile Data)

{com}. fcollapse (sum) foreign (max) MAX_PRICE=price foreign, by(turn) merge freq v
{res}{txt}(0 observations deleted)
{res}{txt}(obs: {res}74{txt}; levels: {res}18{txt};{txt} method: {res}hash0{txt}; dict size: {res}21{txt})
{res}  50:      0.08 /        1 =       0.0810
{txt}
{com}. 
. de *_*

              {txt}storage   display    value
variable name   type    format     label      variable label
{hline}
{p 0 48}{res}{bind:gear_ratio     }{txt}{bind: float   }{bind:{txt}%6.2f     }{space 1}{bind:         }{bind:  }{res}{res}Gear Ratio{p_end}
{p 0 48}{bind:sum_foreign    }{txt}{bind: double  }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}(sum) foreign{p_end}
{p 0 48}{bind:max_foreign    }{txt}{bind: byte    }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}(max) foreign{p_end}
{p 0 48}{bind:MAX_PRICE      }{txt}{bind: int     }{bind:{txt}%8.0gc    }{space 1}{bind:         }{bind:  }{res}{res}(max) price{p_end}
{p 0 48}{bind:_freq          }{txt}{bind: byte    }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}Frequency{p_end}
{txt}
{com}. drop make
{txt}
{com}. mata: ftools = hash1(st_data(., "_all"))
{res}{txt}
{com}. mata: ftools
{res}  3965372940
{txt}
{com}. mata: bench == ftools
{res}  1
{txt}
{com}. li in 1/10
{txt}
     {c TLC}{hline 8}{c -}{hline 5}{c -}{hline 7}{c -}{hline 10}{c -}{hline 7}{c -}{hline 8}{c -}{hline 8}{c -}{hline 6}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 7}{c TRC}
     {c |} {res} price   mpg   rep78   headroom   trunk   weight   length   turn   displa~t   gear_r~o    foreign   sum_fo~n   max_fo~n   MAX_PR~E   _freq {txt}{c |}
     {c LT}{hline 8}{c -}{hline 5}{c -}{hline 7}{c -}{hline 10}{c -}{hline 7}{c -}{hline 8}{c -}{hline 8}{c -}{hline 6}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 7}{c RT}
  1. {c |} {res} 4,099    22       3        2.5      11    2,930      186     40        121       3.58   Domestic          0          0      4,816       6 {txt}{c |}
  2. {c |} {res} 4,749    17       3        3.0      11    3,350      173     40        258       2.53   Domestic          0          0      4,816       6 {txt}{c |}
  3. {c |} {res} 3,799    22       .        3.0      12    2,640      168     35        121       3.08   Domestic          4          1      6,229       6 {txt}{c |}
  4. {c |} {res} 4,816    20       3        4.5      16    3,250      196     40        196       2.93   Domestic          0          0      4,816       6 {txt}{c |}
  5. {c |} {res} 7,827    15       4        4.0      20    4,080      222     43        350       2.41   Domestic          0          0     14,500      12 {txt}{c |}
     {c LT}{hline 8}{c -}{hline 5}{c -}{hline 7}{c -}{hline 10}{c -}{hline 7}{c -}{hline 8}{c -}{hline 8}{c -}{hline 6}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 7}{c RT}
  6. {c |} {res} 5,788    18       3        4.0      21    3,670      218     43        231       2.73   Domestic          0          0     14,500      12 {txt}{c |}
  7. {c |} {res} 4,453    26       .        3.0      10    2,230      170     34        304       2.87   Domestic          4          1      9,735       6 {txt}{c |}
  8. {c |} {res} 5,189    20       3        2.0      16    3,280      200     42        196       2.93   Domestic          0          0      5,798       7 {txt}{c |}
  9. {c |} {res}10,372    16       3        3.5      17    3,880      207     43        231       2.93   Domestic          0          0     14,500      12 {txt}{c |}
 10. {c |} {res} 4,082    19       3        3.5      13    3,400      200     42        231       3.08   Domestic          0          0      5,798       7 {txt}{c |}
     {c BLC}{hline 8}{c -}{hline 5}{c -}{hline 7}{c -}{hline 10}{c -}{hline 7}{c -}{hline 8}{c -}{hline 8}{c -}{hline 6}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 7}{c BRC}

{com}. 
. * TEST SPEED
. clear
{txt}
{com}. 
. set obs 1000000
{txt}{p}
number of observations (_N)  was 0,
now 1,000,000
{p_end}

{com}. gen long firm = ceil(runiform() * c(N) / 10)
{txt}
{com}. bys firm: gen int year = _n
{txt}
{com}. xtset firm year
{res}{txt}{col 8}panel variable:  {res}firm (unbalanced)
{txt}{col 9}time variable:  {res}{col 25}year, 1 to 27
{txt}{col 17}delta:  {res}1 unit
{txt}
{com}. gen double x = rnormal()
{txt}
{com}. gen int y = ceil(runiform() * 10)
{txt}
{com}. 
. // sort year
. loc by year // firm
{txt}
{com}. 
. 
. 
. timer clear
{txt}
{com}. 
. 
. /*preserve
> timer on 8
> fcollapse (mean) x /*(max) y*/, by(`by') fast verbose
> timer off 8
> restore
> 
> preserve
> timer on 9
> fcollapse (mean) x /*(max) y*/, by(`by') fast verbose
> timer off 9
> restore
> */
. 
. timer on 1
{txt}
{com}. egen double mean_x = mean(x), by(`by')
{txt}
{com}. //egen int max_y = max(y), by(`by')
. timer off 1
{txt}
{com}. 
. //de
. //li in 1/10
. //drop mean_x
. //mata: bench = hash1(st_data(., "_all"))
. //mata: bench
. 
. drop *_*
{txt}
{com}. 
. set trace off
{txt}
{com}. timer on 2
{txt}
{com}. fcollapse (mean) x /*(max) y*/, by(`by') merge fast verbose
{res}{txt}(0 observations deleted)
{res}{txt}(obs: {res}1000000{txt}; levels: {res}27{txt};{txt} method: {res}hash0{txt}; dict size: {res}27{txt})
{res}  50:      0.25 /        1 =       0.2530
{txt}
{com}. timer off 2
{txt}
{com}. de, short

{txt}Contains data
  obs:{res}     1,000,000                          
{txt} vars:{res}             5                          
{txt} size:{res}    24,000,000                          
{txt}Sorted by: {res}firm  year
     Note: Dataset has changed since last saved.
{txt}
{com}. 
. //de
. //li in 1/10
. //drop mean_x
. //mata: ftools = hash1(st_data(., "_all"))
. //mata: ftools
. //mata: bench == ftools
. 
. drop *_*
{txt}
{com}. // this is overoptimistic b/c it doesnt sort back or count MVs...
. timer on 3
{txt}
{com}. Bysort `by'
{txt}(999999 real changes made)

{com}. timer off 3
{txt}
{com}. 
. drop *_*
{txt}
{com}. 
. timer list
{res}   1:      1.01 /        1 =       1.0140
   2:      0.68 /        1 =       0.6810
   3:      0.58 /        1 =       0.5850
{txt}
{com}. di as text "1 egen 2 fcollapse+merge 3 bysort"
{res}{txt}1 egen 2 fcollapse+merge 3 bysort

{com}. 
. 
. exit

{txt}end of do-file


{com}. do demo_fcollapse_merge
{txt}
{com}. cap ado uninstall ftools
{txt}
{com}. net install ftools, from("C:/git/ftools/source")
checking {hilite:ftools} consistency and verifying not already installed...
installing into c:\ado\plus\...
installation complete.
{txt}
{com}. ftools compile
{txt}(compiling lftools.mlib for Stata 14.2)
(library saved in c:\ado\plus/l/lftools.mlib)

{com}. discard
{txt}
{com}. 
. clear all
{txt}
{com}. cls
{txt}
{com}. set more off
{txt}
{com}. 
. cap pr drop Bysort
{txt}
{com}. pr Bysort, sortpreserve
{txt}  1{com}.         loc by `0'
{txt}  2{com}.         bys `by': gen double mean_x = sum(x)
{txt}  3{com}.         bys `by': replace mean_x = mean_x[_N] / _N
{txt}  4{com}. end
{txt}
{com}. 
. * benchmark
. sysuse auto
{txt}(1978 Automobile Data)

{com}. egen double sum_foreign = sum(foreign), by(turn)
{txt}
{com}. egen byte max_foreign = max(foreign), by(turn)
{txt}
{com}. egen int MAX_PRICE = max(price), by(turn)
{txt}
{com}. egen int _freq = count(turn), by(turn)
{txt}
{com}. 
. de *_*

              {txt}storage   display    value
variable name   type    format     label      variable label
{hline}
{p 0 48}{res}{bind:gear_ratio     }{txt}{bind: float   }{bind:{txt}%6.2f     }{space 1}{bind:         }{bind:  }{res}{res}Gear Ratio{p_end}
{p 0 48}{bind:sum_foreign    }{txt}{bind: double  }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:max_foreign    }{txt}{bind: byte    }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:MAX_PRICE      }{txt}{bind: int     }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:_freq          }{txt}{bind: int     }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{txt}
{com}. drop make
{txt}
{com}. mata: bench = hash1(st_data(., "_all"))
{res}{txt}
{com}. mata: bench
{res}  3965372940
{txt}
{com}. li in 1/10
{txt}
     {c TLC}{hline 8}{c -}{hline 5}{c -}{hline 7}{c -}{hline 10}{c -}{hline 7}{c -}{hline 8}{c -}{hline 8}{c -}{hline 6}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 7}{c TRC}
     {c |} {res} price   mpg   rep78   headroom   trunk   weight   length   turn   displa~t   gear_r~o    foreign   sum_fo~n   max_fo~n   MAX_PR~E   _freq {txt}{c |}
     {c LT}{hline 8}{c -}{hline 5}{c -}{hline 7}{c -}{hline 10}{c -}{hline 7}{c -}{hline 8}{c -}{hline 8}{c -}{hline 6}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 7}{c RT}
  1. {c |} {res} 4,099    22       3        2.5      11    2,930      186     40        121       3.58   Domestic          0          0       4816       6 {txt}{c |}
  2. {c |} {res} 4,749    17       3        3.0      11    3,350      173     40        258       2.53   Domestic          0          0       4816       6 {txt}{c |}
  3. {c |} {res} 3,799    22       .        3.0      12    2,640      168     35        121       3.08   Domestic          4          1       6229       6 {txt}{c |}
  4. {c |} {res} 4,816    20       3        4.5      16    3,250      196     40        196       2.93   Domestic          0          0       4816       6 {txt}{c |}
  5. {c |} {res} 7,827    15       4        4.0      20    4,080      222     43        350       2.41   Domestic          0          0      14500      12 {txt}{c |}
     {c LT}{hline 8}{c -}{hline 5}{c -}{hline 7}{c -}{hline 10}{c -}{hline 7}{c -}{hline 8}{c -}{hline 8}{c -}{hline 6}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 7}{c RT}
  6. {c |} {res} 5,788    18       3        4.0      21    3,670      218     43        231       2.73   Domestic          0          0      14500      12 {txt}{c |}
  7. {c |} {res} 4,453    26       .        3.0      10    2,230      170     34        304       2.87   Domestic          4          1       9735       6 {txt}{c |}
  8. {c |} {res} 5,189    20       3        2.0      16    3,280      200     42        196       2.93   Domestic          0          0       5798       7 {txt}{c |}
  9. {c |} {res}10,372    16       3        3.5      17    3,880      207     43        231       2.93   Domestic          0          0      14500      12 {txt}{c |}
 10. {c |} {res} 4,082    19       3        3.5      13    3,400      200     42        231       3.08   Domestic          0          0       5798       7 {txt}{c |}
     {c BLC}{hline 8}{c -}{hline 5}{c -}{hline 7}{c -}{hline 10}{c -}{hline 7}{c -}{hline 8}{c -}{hline 8}{c -}{hline 6}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 7}{c BRC}

{com}. 
. sysuse auto, clear
{txt}(1978 Automobile Data)

{com}. fcollapse (sum) foreign (max) MAX_PRICE=price foreign, by(turn) merge freq v
{res}{txt}(0 observations deleted)
{res}{txt}(obs: {res}74{txt}; levels: {res}18{txt};{txt} method: {res}hash0{txt}; dict size: {res}21{txt})
{res}  50:      0.08 /        1 =       0.0810
{txt}
{com}. 
. de *_*

              {txt}storage   display    value
variable name   type    format     label      variable label
{hline}
{p 0 48}{res}{bind:gear_ratio     }{txt}{bind: float   }{bind:{txt}%6.2f     }{space 1}{bind:         }{bind:  }{res}{res}Gear Ratio{p_end}
{p 0 48}{bind:sum_foreign    }{txt}{bind: double  }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}(sum) foreign{p_end}
{p 0 48}{bind:max_foreign    }{txt}{bind: byte    }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}(max) foreign{p_end}
{p 0 48}{bind:MAX_PRICE      }{txt}{bind: int     }{bind:{txt}%8.0gc    }{space 1}{bind:         }{bind:  }{res}{res}(max) price{p_end}
{p 0 48}{bind:_freq          }{txt}{bind: byte    }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}Frequency{p_end}
{txt}
{com}. drop make
{txt}
{com}. mata: ftools = hash1(st_data(., "_all"))
{res}{txt}
{com}. mata: ftools
{res}  3965372940
{txt}
{com}. mata: bench == ftools
{res}  1
{txt}
{com}. li in 1/10
{txt}
     {c TLC}{hline 8}{c -}{hline 5}{c -}{hline 7}{c -}{hline 10}{c -}{hline 7}{c -}{hline 8}{c -}{hline 8}{c -}{hline 6}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 7}{c TRC}
     {c |} {res} price   mpg   rep78   headroom   trunk   weight   length   turn   displa~t   gear_r~o    foreign   sum_fo~n   max_fo~n   MAX_PR~E   _freq {txt}{c |}
     {c LT}{hline 8}{c -}{hline 5}{c -}{hline 7}{c -}{hline 10}{c -}{hline 7}{c -}{hline 8}{c -}{hline 8}{c -}{hline 6}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 7}{c RT}
  1. {c |} {res} 4,099    22       3        2.5      11    2,930      186     40        121       3.58   Domestic          0          0      4,816       6 {txt}{c |}
  2. {c |} {res} 4,749    17       3        3.0      11    3,350      173     40        258       2.53   Domestic          0          0      4,816       6 {txt}{c |}
  3. {c |} {res} 3,799    22       .        3.0      12    2,640      168     35        121       3.08   Domestic          4          1      6,229       6 {txt}{c |}
  4. {c |} {res} 4,816    20       3        4.5      16    3,250      196     40        196       2.93   Domestic          0          0      4,816       6 {txt}{c |}
  5. {c |} {res} 7,827    15       4        4.0      20    4,080      222     43        350       2.41   Domestic          0          0     14,500      12 {txt}{c |}
     {c LT}{hline 8}{c -}{hline 5}{c -}{hline 7}{c -}{hline 10}{c -}{hline 7}{c -}{hline 8}{c -}{hline 8}{c -}{hline 6}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 7}{c RT}
  6. {c |} {res} 5,788    18       3        4.0      21    3,670      218     43        231       2.73   Domestic          0          0     14,500      12 {txt}{c |}
  7. {c |} {res} 4,453    26       .        3.0      10    2,230      170     34        304       2.87   Domestic          4          1      9,735       6 {txt}{c |}
  8. {c |} {res} 5,189    20       3        2.0      16    3,280      200     42        196       2.93   Domestic          0          0      5,798       7 {txt}{c |}
  9. {c |} {res}10,372    16       3        3.5      17    3,880      207     43        231       2.93   Domestic          0          0     14,500      12 {txt}{c |}
 10. {c |} {res} 4,082    19       3        3.5      13    3,400      200     42        231       3.08   Domestic          0          0      5,798       7 {txt}{c |}
     {c BLC}{hline 8}{c -}{hline 5}{c -}{hline 7}{c -}{hline 10}{c -}{hline 7}{c -}{hline 8}{c -}{hline 8}{c -}{hline 6}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 7}{c BRC}

{com}. 
. * TEST SPEED
. clear
{txt}
{com}. 
. set obs 1000000
{txt}{p}
number of observations (_N)  was 0,
now 1,000,000
{p_end}

{com}. gen long firm = ceil(runiform() * c(N) / 10)
{txt}
{com}. bys firm: gen int year = _n
{txt}
{com}. xtset firm year
{res}{txt}{col 8}panel variable:  {res}firm (unbalanced)
{txt}{col 9}time variable:  {res}{col 25}year, 1 to 26
{txt}{col 17}delta:  {res}1 unit
{txt}
{com}. gen double x = rnormal()
{txt}
{com}. gen int y = ceil(runiform() * 10)
{txt}
{com}. 
. // sort year
. loc by year // firm
{txt}
{com}. 
. 
. 
. timer clear
{txt}
{com}. 
. 
. /*preserve
> timer on 8
> fcollapse (mean) x /*(max) y*/, by(`by') fast verbose
> timer off 8
> restore
> 
> preserve
> timer on 9
> fcollapse (mean) x /*(max) y*/, by(`by') fast verbose
> timer off 9
> restore
> */
. 
. timer on 1
{txt}
{com}. egen double mean_x = mean(x), by(`by')
{txt}
{com}. //egen int max_y = max(y), by(`by')
. timer off 1
{txt}
{com}. 
. //de
. //li in 1/10
. //drop mean_x
. //mata: bench = hash1(st_data(., "_all"))
. //mata: bench
. 
. drop *_*
{txt}
{com}. 
. set trace off
{txt}
{com}. timer on 2
{txt}
{com}. fcollapse (mean) x /*(max) y*/, by(`by') merge fast verbose
{res}{txt}(0 observations deleted)
{res}{txt}(obs: {res}1000000{txt}; levels: {res}26{txt};{txt} method: {res}hash0{txt}; dict size: {res}26{txt})
{res}  50:      0.21 /        1 =       0.2140
{txt}
{com}. timer off 2
{txt}
{com}. de, short

{txt}Contains data
  obs:{res}     1,000,000                          
{txt} vars:{res}             5                          
{txt} size:{res}    24,000,000                          
{txt}Sorted by: {res}firm  year
     Note: Dataset has changed since last saved.
{txt}
{com}. 
. //de
. //li in 1/10
. //drop mean_x
. //mata: ftools = hash1(st_data(., "_all"))
. //mata: ftools
. //mata: bench == ftools
. 
. drop *_*
{txt}
{com}. // this is overoptimistic b/c it doesnt sort back or count MVs...
. timer on 3
{txt}
{com}. Bysort `by'
{txt}(999999 real changes made)

{com}. timer off 3
{txt}
{com}. 
. drop *_*
{txt}
{com}. 
. timer list
{res}   1:      0.98 /        1 =       0.9830
   2:      0.61 /        1 =       0.6060
   3:      0.80 /        1 =       0.7950
{txt}
{com}. di as text "1 egen 2 fcollapse+merge 3 bysort"
{res}{txt}1 egen 2 fcollapse+merge 3 bysort

{com}. 
. 
. exit

{txt}end of do-file


{com}. do demo_fcollapse_merge
{txt}
{com}. cap ado uninstall ftools
{txt}
{com}. net install ftools, from("C:/git/ftools/source")
checking {hilite:ftools} consistency and verifying not already installed...
installing into c:\ado\plus\...
installation complete.
{txt}
{com}. ftools compile
{txt}(compiling lftools.mlib for Stata 14.2)
(library saved in c:\ado\plus/l/lftools.mlib)

{com}. discard
{txt}
{com}. 
. clear all
{txt}
{com}. cls
{txt}
{com}. set more off
{txt}
{com}. 
. cap pr drop Bysort
{txt}
{com}. pr Bysort, sortpreserve
{txt}  1{com}.         loc by `0'
{txt}  2{com}.         bys `by': gen double mean_x = sum(x)
{txt}  3{com}.         tempvar N
{txt}  4{com}.         bys `by': gen long `N' = (x != .)
{txt}  5{com}.         bys `by': replace `N' = sum(`N')
{txt}  6{com}.         bys `by': replace mean_x = mean_x[_N] / _N
{txt}  7{com}. end
{txt}
{com}. 
. * benchmark
. sysuse auto
{txt}(1978 Automobile Data)

{com}. egen double sum_foreign = sum(foreign), by(turn)
{txt}
{com}. egen byte max_foreign = max(foreign), by(turn)
{txt}
{com}. egen int MAX_PRICE = max(price), by(turn)
{txt}
{com}. egen int _freq = count(turn), by(turn)
{txt}
{com}. 
. de *_*

              {txt}storage   display    value
variable name   type    format     label      variable label
{hline}
{p 0 48}{res}{bind:gear_ratio     }{txt}{bind: float   }{bind:{txt}%6.2f     }{space 1}{bind:         }{bind:  }{res}{res}Gear Ratio{p_end}
{p 0 48}{bind:sum_foreign    }{txt}{bind: double  }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:max_foreign    }{txt}{bind: byte    }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:MAX_PRICE      }{txt}{bind: int     }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:_freq          }{txt}{bind: int     }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{txt}
{com}. drop make
{txt}
{com}. mata: bench = hash1(st_data(., "_all"))
{res}{txt}
{com}. mata: bench
{res}  3965372940
{txt}
{com}. li in 1/10
{txt}
     {c TLC}{hline 8}{c -}{hline 5}{c -}{hline 7}{c -}{hline 10}{c -}{hline 7}{c -}{hline 8}{c -}{hline 8}{c -}{hline 6}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 7}{c TRC}
     {c |} {res} price   mpg   rep78   headroom   trunk   weight   length   turn   displa~t   gear_r~o    foreign   sum_fo~n   max_fo~n   MAX_PR~E   _freq {txt}{c |}
     {c LT}{hline 8}{c -}{hline 5}{c -}{hline 7}{c -}{hline 10}{c -}{hline 7}{c -}{hline 8}{c -}{hline 8}{c -}{hline 6}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 7}{c RT}
  1. {c |} {res} 4,099    22       3        2.5      11    2,930      186     40        121       3.58   Domestic          0          0       4816       6 {txt}{c |}
  2. {c |} {res} 4,749    17       3        3.0      11    3,350      173     40        258       2.53   Domestic          0          0       4816       6 {txt}{c |}
  3. {c |} {res} 3,799    22       .        3.0      12    2,640      168     35        121       3.08   Domestic          4          1       6229       6 {txt}{c |}
  4. {c |} {res} 4,816    20       3        4.5      16    3,250      196     40        196       2.93   Domestic          0          0       4816       6 {txt}{c |}
  5. {c |} {res} 7,827    15       4        4.0      20    4,080      222     43        350       2.41   Domestic          0          0      14500      12 {txt}{c |}
     {c LT}{hline 8}{c -}{hline 5}{c -}{hline 7}{c -}{hline 10}{c -}{hline 7}{c -}{hline 8}{c -}{hline 8}{c -}{hline 6}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 7}{c RT}
  6. {c |} {res} 5,788    18       3        4.0      21    3,670      218     43        231       2.73   Domestic          0          0      14500      12 {txt}{c |}
  7. {c |} {res} 4,453    26       .        3.0      10    2,230      170     34        304       2.87   Domestic          4          1       9735       6 {txt}{c |}
  8. {c |} {res} 5,189    20       3        2.0      16    3,280      200     42        196       2.93   Domestic          0          0       5798       7 {txt}{c |}
  9. {c |} {res}10,372    16       3        3.5      17    3,880      207     43        231       2.93   Domestic          0          0      14500      12 {txt}{c |}
 10. {c |} {res} 4,082    19       3        3.5      13    3,400      200     42        231       3.08   Domestic          0          0       5798       7 {txt}{c |}
     {c BLC}{hline 8}{c -}{hline 5}{c -}{hline 7}{c -}{hline 10}{c -}{hline 7}{c -}{hline 8}{c -}{hline 8}{c -}{hline 6}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 7}{c BRC}

{com}. 
. sysuse auto, clear
{txt}(1978 Automobile Data)

{com}. fcollapse (sum) foreign (max) MAX_PRICE=price foreign, by(turn) merge freq v
{res}{txt}(0 observations deleted)
{res}{txt}(obs: {res}74{txt}; levels: {res}18{txt};{txt} method: {res}hash0{txt}; dict size: {res}21{txt})
{res}  50:      0.09 /        1 =       0.0900
{txt}
{com}. 
. de *_*

              {txt}storage   display    value
variable name   type    format     label      variable label
{hline}
{p 0 48}{res}{bind:gear_ratio     }{txt}{bind: float   }{bind:{txt}%6.2f     }{space 1}{bind:         }{bind:  }{res}{res}Gear Ratio{p_end}
{p 0 48}{bind:sum_foreign    }{txt}{bind: double  }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}(sum) foreign{p_end}
{p 0 48}{bind:max_foreign    }{txt}{bind: byte    }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}(max) foreign{p_end}
{p 0 48}{bind:MAX_PRICE      }{txt}{bind: int     }{bind:{txt}%8.0gc    }{space 1}{bind:         }{bind:  }{res}{res}(max) price{p_end}
{p 0 48}{bind:_freq          }{txt}{bind: byte    }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}Frequency{p_end}
{txt}
{com}. drop make
{txt}
{com}. mata: ftools = hash1(st_data(., "_all"))
{res}{txt}
{com}. mata: ftools
{res}  3965372940
{txt}
{com}. mata: bench == ftools
{res}  1
{txt}
{com}. li in 1/10
{txt}
     {c TLC}{hline 8}{c -}{hline 5}{c -}{hline 7}{c -}{hline 10}{c -}{hline 7}{c -}{hline 8}{c -}{hline 8}{c -}{hline 6}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 7}{c TRC}
     {c |} {res} price   mpg   rep78   headroom   trunk   weight   length   turn   displa~t   gear_r~o    foreign   sum_fo~n   max_fo~n   MAX_PR~E   _freq {txt}{c |}
     {c LT}{hline 8}{c -}{hline 5}{c -}{hline 7}{c -}{hline 10}{c -}{hline 7}{c -}{hline 8}{c -}{hline 8}{c -}{hline 6}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 7}{c RT}
  1. {c |} {res} 4,099    22       3        2.5      11    2,930      186     40        121       3.58   Domestic          0          0      4,816       6 {txt}{c |}
  2. {c |} {res} 4,749    17       3        3.0      11    3,350      173     40        258       2.53   Domestic          0          0      4,816       6 {txt}{c |}
  3. {c |} {res} 3,799    22       .        3.0      12    2,640      168     35        121       3.08   Domestic          4          1      6,229       6 {txt}{c |}
  4. {c |} {res} 4,816    20       3        4.5      16    3,250      196     40        196       2.93   Domestic          0          0      4,816       6 {txt}{c |}
  5. {c |} {res} 7,827    15       4        4.0      20    4,080      222     43        350       2.41   Domestic          0          0     14,500      12 {txt}{c |}
     {c LT}{hline 8}{c -}{hline 5}{c -}{hline 7}{c -}{hline 10}{c -}{hline 7}{c -}{hline 8}{c -}{hline 8}{c -}{hline 6}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 7}{c RT}
  6. {c |} {res} 5,788    18       3        4.0      21    3,670      218     43        231       2.73   Domestic          0          0     14,500      12 {txt}{c |}
  7. {c |} {res} 4,453    26       .        3.0      10    2,230      170     34        304       2.87   Domestic          4          1      9,735       6 {txt}{c |}
  8. {c |} {res} 5,189    20       3        2.0      16    3,280      200     42        196       2.93   Domestic          0          0      5,798       7 {txt}{c |}
  9. {c |} {res}10,372    16       3        3.5      17    3,880      207     43        231       2.93   Domestic          0          0     14,500      12 {txt}{c |}
 10. {c |} {res} 4,082    19       3        3.5      13    3,400      200     42        231       3.08   Domestic          0          0      5,798       7 {txt}{c |}
     {c BLC}{hline 8}{c -}{hline 5}{c -}{hline 7}{c -}{hline 10}{c -}{hline 7}{c -}{hline 8}{c -}{hline 8}{c -}{hline 6}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 7}{c BRC}

{com}. 
. * TEST SPEED
. clear
{txt}
{com}. 
. set obs 1000000
{txt}{p}
number of observations (_N)  was 0,
now 1,000,000
{p_end}

{com}. gen long firm = ceil(runiform() * c(N) / 10)
{txt}
{com}. bys firm: gen int year = _n
{txt}
{com}. xtset firm year
{res}{txt}{col 8}panel variable:  {res}firm (unbalanced)
{txt}{col 9}time variable:  {res}{col 25}year, 1 to 28
{txt}{col 17}delta:  {res}1 unit
{txt}
{com}. gen double x = rnormal()
{txt}
{com}. gen int y = ceil(runiform() * 10)
{txt}
{com}. 
. // sort year
. loc by year // firm
{txt}
{com}. 
. 
. 
. timer clear
{txt}
{com}. 
. 
. /*preserve
> timer on 8
> fcollapse (mean) x /*(max) y*/, by(`by') fast verbose
> timer off 8
> restore
> 
> preserve
> timer on 9
> fcollapse (mean) x /*(max) y*/, by(`by') fast verbose
> timer off 9
> restore
> */
. 
. timer on 1
{txt}
{com}. egen double mean_x = mean(x), by(`by')
{txt}
{com}. //egen int max_y = max(y), by(`by')
. timer off 1
{txt}
{com}. 
. //de
. //li in 1/10
. //drop mean_x
. //mata: bench = hash1(st_data(., "_all"))
. //mata: bench
. 
. drop *_*
{txt}
{com}. 
. set trace off
{txt}
{com}. timer on 2
{txt}
{com}. fcollapse (mean) x /*(max) y*/, by(`by') merge fast verbose
{res}{txt}(0 observations deleted)
{res}{txt}(obs: {res}1000000{txt}; levels: {res}28{txt};{txt} method: {res}hash0{txt}; dict size: {res}28{txt})
{res}  50:      0.22 /        1 =       0.2160
{txt}
{com}. timer off 2
{txt}
{com}. de, short

{txt}Contains data
  obs:{res}     1,000,000                          
{txt} vars:{res}             5                          
{txt} size:{res}    24,000,000                          
{txt}Sorted by: {res}firm  year
     Note: Dataset has changed since last saved.
{txt}
{com}. 
. //de
. //li in 1/10
. //drop mean_x
. //mata: ftools = hash1(st_data(., "_all"))
. //mata: ftools
. //mata: bench == ftools
. 
. drop *_*
{txt}
{com}. timer on 3
{txt}
{com}. Bysort `by'
{txt}(999,972 real changes made)
(999998 real changes made)

{com}. timer off 3
{txt}
{com}. 
. drop *_*
{txt}
{com}. 
. timer list
{res}   1:      1.00 /        1 =       1.0030
   2:      0.60 /        1 =       0.5960
   3:      0.91 /        1 =       0.9090
{txt}
{com}. di as text "1 egen 2 fcollapse+merge 3 bysort"
{res}{txt}1 egen 2 fcollapse+merge 3 bysort

{com}. 
. 
. exit

{txt}end of do-file


{com}. do demo_fcollapse_merge
{txt}
{com}. cap ado uninstall ftools
{txt}
{com}. net install ftools, from("C:/git/ftools/source")
checking {hilite:ftools} consistency and verifying not already installed...
installing into c:\ado\plus\...
installation complete.
{txt}
{com}. ftools compile
{txt}(compiling lftools.mlib for Stata 14.2)
(library saved in c:\ado\plus/l/lftools.mlib)

{com}. discard
{txt}
{com}. 
. clear all
{txt}
{com}. cls
{txt}
{com}. set more off
{txt}
{com}. 
. cap pr drop Bysort
{txt}
{com}. pr Bysort, sortpreserve
{txt}  1{com}.         loc by `0'
{txt}  2{com}.         bys `by': gen double sum_x = sum(x)
{txt}  3{com}.         
.         //bys `by': gen double mean_x = sum(x)
.         //tempvar N
.         //bys `by': gen long `N' = (x != .)
.         //bys `by': replace `N' = sum(`N')
.         //bys `by': replace mean_x = mean_x[_N] / _N
. end
{txt}
{com}. 
. * benchmark
. sysuse auto
{txt}(1978 Automobile Data)

{com}. egen double sum_foreign = sum(foreign), by(turn)
{txt}
{com}. egen byte max_foreign = max(foreign), by(turn)
{txt}
{com}. egen int MAX_PRICE = max(price), by(turn)
{txt}
{com}. egen int _freq = count(turn), by(turn)
{txt}
{com}. 
. de *_*

              {txt}storage   display    value
variable name   type    format     label      variable label
{hline}
{p 0 48}{res}{bind:gear_ratio     }{txt}{bind: float   }{bind:{txt}%6.2f     }{space 1}{bind:         }{bind:  }{res}{res}Gear Ratio{p_end}
{p 0 48}{bind:sum_foreign    }{txt}{bind: double  }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:max_foreign    }{txt}{bind: byte    }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:MAX_PRICE      }{txt}{bind: int     }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:_freq          }{txt}{bind: int     }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{txt}
{com}. drop make
{txt}
{com}. mata: bench = hash1(st_data(., "_all"))
{res}{txt}
{com}. mata: bench
{res}  3965372940
{txt}
{com}. li in 1/10
{txt}
     {c TLC}{hline 8}{c -}{hline 5}{c -}{hline 7}{c -}{hline 10}{c -}{hline 7}{c -}{hline 8}{c -}{hline 8}{c -}{hline 6}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 7}{c TRC}
     {c |} {res} price   mpg   rep78   headroom   trunk   weight   length   turn   displa~t   gear_r~o    foreign   sum_fo~n   max_fo~n   MAX_PR~E   _freq {txt}{c |}
     {c LT}{hline 8}{c -}{hline 5}{c -}{hline 7}{c -}{hline 10}{c -}{hline 7}{c -}{hline 8}{c -}{hline 8}{c -}{hline 6}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 7}{c RT}
  1. {c |} {res} 4,099    22       3        2.5      11    2,930      186     40        121       3.58   Domestic          0          0       4816       6 {txt}{c |}
  2. {c |} {res} 4,749    17       3        3.0      11    3,350      173     40        258       2.53   Domestic          0          0       4816       6 {txt}{c |}
  3. {c |} {res} 3,799    22       .        3.0      12    2,640      168     35        121       3.08   Domestic          4          1       6229       6 {txt}{c |}
  4. {c |} {res} 4,816    20       3        4.5      16    3,250      196     40        196       2.93   Domestic          0          0       4816       6 {txt}{c |}
  5. {c |} {res} 7,827    15       4        4.0      20    4,080      222     43        350       2.41   Domestic          0          0      14500      12 {txt}{c |}
     {c LT}{hline 8}{c -}{hline 5}{c -}{hline 7}{c -}{hline 10}{c -}{hline 7}{c -}{hline 8}{c -}{hline 8}{c -}{hline 6}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 7}{c RT}
  6. {c |} {res} 5,788    18       3        4.0      21    3,670      218     43        231       2.73   Domestic          0          0      14500      12 {txt}{c |}
  7. {c |} {res} 4,453    26       .        3.0      10    2,230      170     34        304       2.87   Domestic          4          1       9735       6 {txt}{c |}
  8. {c |} {res} 5,189    20       3        2.0      16    3,280      200     42        196       2.93   Domestic          0          0       5798       7 {txt}{c |}
  9. {c |} {res}10,372    16       3        3.5      17    3,880      207     43        231       2.93   Domestic          0          0      14500      12 {txt}{c |}
 10. {c |} {res} 4,082    19       3        3.5      13    3,400      200     42        231       3.08   Domestic          0          0       5798       7 {txt}{c |}
     {c BLC}{hline 8}{c -}{hline 5}{c -}{hline 7}{c -}{hline 10}{c -}{hline 7}{c -}{hline 8}{c -}{hline 8}{c -}{hline 6}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 7}{c BRC}

{com}. 
. sysuse auto, clear
{txt}(1978 Automobile Data)

{com}. fcollapse (sum) foreign (max) MAX_PRICE=price foreign, by(turn) merge freq v
{res}{txt}(0 observations deleted)
{res}{txt}(obs: {res}74{txt}; levels: {res}18{txt};{txt} method: {res}hash0{txt}; dict size: {res}21{txt})
{res}  50:      0.10 /        1 =       0.0950
{txt}
{com}. 
. de *_*

              {txt}storage   display    value
variable name   type    format     label      variable label
{hline}
{p 0 48}{res}{bind:gear_ratio     }{txt}{bind: float   }{bind:{txt}%6.2f     }{space 1}{bind:         }{bind:  }{res}{res}Gear Ratio{p_end}
{p 0 48}{bind:sum_foreign    }{txt}{bind: double  }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}(sum) foreign{p_end}
{p 0 48}{bind:max_foreign    }{txt}{bind: byte    }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}(max) foreign{p_end}
{p 0 48}{bind:MAX_PRICE      }{txt}{bind: int     }{bind:{txt}%8.0gc    }{space 1}{bind:         }{bind:  }{res}{res}(max) price{p_end}
{p 0 48}{bind:_freq          }{txt}{bind: byte    }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}Frequency{p_end}
{txt}
{com}. drop make
{txt}
{com}. mata: ftools = hash1(st_data(., "_all"))
{res}{txt}
{com}. mata: ftools
{res}  3965372940
{txt}
{com}. mata: bench == ftools
{res}  1
{txt}
{com}. li in 1/10
{txt}
     {c TLC}{hline 8}{c -}{hline 5}{c -}{hline 7}{c -}{hline 10}{c -}{hline 7}{c -}{hline 8}{c -}{hline 8}{c -}{hline 6}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 7}{c TRC}
     {c |} {res} price   mpg   rep78   headroom   trunk   weight   length   turn   displa~t   gear_r~o    foreign   sum_fo~n   max_fo~n   MAX_PR~E   _freq {txt}{c |}
     {c LT}{hline 8}{c -}{hline 5}{c -}{hline 7}{c -}{hline 10}{c -}{hline 7}{c -}{hline 8}{c -}{hline 8}{c -}{hline 6}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 7}{c RT}
  1. {c |} {res} 4,099    22       3        2.5      11    2,930      186     40        121       3.58   Domestic          0          0      4,816       6 {txt}{c |}
  2. {c |} {res} 4,749    17       3        3.0      11    3,350      173     40        258       2.53   Domestic          0          0      4,816       6 {txt}{c |}
  3. {c |} {res} 3,799    22       .        3.0      12    2,640      168     35        121       3.08   Domestic          4          1      6,229       6 {txt}{c |}
  4. {c |} {res} 4,816    20       3        4.5      16    3,250      196     40        196       2.93   Domestic          0          0      4,816       6 {txt}{c |}
  5. {c |} {res} 7,827    15       4        4.0      20    4,080      222     43        350       2.41   Domestic          0          0     14,500      12 {txt}{c |}
     {c LT}{hline 8}{c -}{hline 5}{c -}{hline 7}{c -}{hline 10}{c -}{hline 7}{c -}{hline 8}{c -}{hline 8}{c -}{hline 6}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 7}{c RT}
  6. {c |} {res} 5,788    18       3        4.0      21    3,670      218     43        231       2.73   Domestic          0          0     14,500      12 {txt}{c |}
  7. {c |} {res} 4,453    26       .        3.0      10    2,230      170     34        304       2.87   Domestic          4          1      9,735       6 {txt}{c |}
  8. {c |} {res} 5,189    20       3        2.0      16    3,280      200     42        196       2.93   Domestic          0          0      5,798       7 {txt}{c |}
  9. {c |} {res}10,372    16       3        3.5      17    3,880      207     43        231       2.93   Domestic          0          0     14,500      12 {txt}{c |}
 10. {c |} {res} 4,082    19       3        3.5      13    3,400      200     42        231       3.08   Domestic          0          0      5,798       7 {txt}{c |}
     {c BLC}{hline 8}{c -}{hline 5}{c -}{hline 7}{c -}{hline 10}{c -}{hline 7}{c -}{hline 8}{c -}{hline 8}{c -}{hline 6}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 7}{c BRC}

{com}. 
. * TEST SPEED
. clear
{txt}
{com}. 
. set obs 1000000
{txt}{p}
number of observations (_N)  was 0,
now 1,000,000
{p_end}

{com}. gen long firm = ceil(runiform() * c(N) / 10)
{txt}
{com}. bys firm: gen int year = _n
{txt}
{com}. xtset firm year
{res}{txt}{col 8}panel variable:  {res}firm (unbalanced)
{txt}{col 9}time variable:  {res}{col 25}year, 1 to 27
{txt}{col 17}delta:  {res}1 unit
{txt}
{com}. gen double x = rnormal()
{txt}
{com}. gen int y = ceil(runiform() * 10)
{txt}
{com}. 
. // sort year
. loc by year // firm
{txt}
{com}. 
. 
. 
. timer clear
{txt}
{com}. 
. timer on 1
{txt}
{com}. egen double sum_x = sum(x), by(`by')
{txt}
{com}. //egen int max_y = max(y), by(`by')
. timer off 1
{txt}
{com}. 
. //de
. //li in 1/10
. //drop sum_x
. //mata: bench = hash1(st_data(., "_all"))
. //mata: bench
. 
. drop *_*
{txt}
{com}. 
. set trace off
{txt}
{com}. timer on 2
{txt}
{com}. fcollapse (sum) x /*(max) y*/, by(`by') merge fast verbose
{res}{txt}(0 observations deleted)
{res}{txt}(obs: {res}1000000{txt}; levels: {res}27{txt};{txt} method: {res}hash0{txt}; dict size: {res}27{txt})
{res}  50:      0.23 /        1 =       0.2260
{txt}
{com}. timer off 2
{txt}
{com}. de, short

{txt}Contains data
  obs:{res}     1,000,000                          
{txt} vars:{res}             5                          
{txt} size:{res}    24,000,000                          
{txt}Sorted by: {res}firm  year
     Note: Dataset has changed since last saved.
{txt}
{com}. 
. //de
. //li in 1/10
. //drop sum_x
. //mata: ftools = hash1(st_data(., "_all"))
. //mata: ftools
. //mata: bench == ftools
. 
. drop *_*
{txt}
{com}. timer on 3
{txt}
{com}. Bysort `by'
{txt}
{com}. timer off 3
{txt}
{com}. 
. drop *_*
{txt}
{com}. 
. timer list
{res}   1:      1.07 /        1 =       1.0720
   2:      0.58 /        1 =       0.5800
   3:      0.74 /        1 =       0.7430
{txt}
{com}. di as text "1 egen 2 fcollapse+merge 3 bysort"
{res}{txt}1 egen 2 fcollapse+merge 3 bysort

{com}. 
. 
. exit

{txt}end of do-file


{com}. de

{txt}Contains data
  obs:{res}     1,000,000                          
{txt} vars:{res}             4                          
{txt} size:{res}    16,000,000                          
{txt}{hline}
              storage   display    value
variable name   type    format     label      variable label
{hline}
{p 0 48}{res}{bind:firm           }{txt}{bind: long    }{bind:{txt}%12.0g    }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:year           }{txt}{bind: int     }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:x              }{txt}{bind: double  }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:y              }{txt}{bind: int     }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{txt}{hline}
Sorted by: {res}firm  year
     Note: Dataset has changed since last saved.

{com}. di 58/107
{res}.54205607

{com}. do demo_fcollapse_merge
{txt}
{com}. cap ado uninstall ftools
{txt}
{com}. net install ftools, from("C:/git/ftools/source")
checking {hilite:ftools} consistency and verifying not already installed...
installing into c:\ado\plus\...
installation complete.
{txt}
{com}. ftools compile
{txt}(compiling lftools.mlib for Stata 14.2)
(library saved in c:\ado\plus/l/lftools.mlib)

{com}. discard
{txt}
{com}. 
. clear all
{txt}
{com}. cls
{txt}
{com}. set more off
{txt}
{com}. 
. cap pr drop Bysort
{txt}
{com}. pr Bysort, sortpreserve
{txt}  1{com}.         loc by `0'
{txt}  2{com}.         bys `by': gen double sum_x = sum(x)
{txt}  3{com}.         
.         //bys `by': gen double mean_x = sum(x)
.         //tempvar N
.         //bys `by': gen long `N' = (x != .)
.         //bys `by': replace `N' = sum(`N')
.         //bys `by': replace mean_x = mean_x[_N] / _N
. end
{txt}
{com}. 
. * benchmark
. sysuse auto
{txt}(1978 Automobile Data)

{com}. egen double sum_foreign = sum(foreign), by(turn)
{txt}
{com}. egen byte max_foreign = max(foreign), by(turn)
{txt}
{com}. egen int MAX_PRICE = max(price), by(turn)
{txt}
{com}. egen int _freq = count(turn), by(turn)
{txt}
{com}. 
. de *_*

              {txt}storage   display    value
variable name   type    format     label      variable label
{hline}
{p 0 48}{res}{bind:gear_ratio     }{txt}{bind: float   }{bind:{txt}%6.2f     }{space 1}{bind:         }{bind:  }{res}{res}Gear Ratio{p_end}
{p 0 48}{bind:sum_foreign    }{txt}{bind: double  }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:max_foreign    }{txt}{bind: byte    }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:MAX_PRICE      }{txt}{bind: int     }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:_freq          }{txt}{bind: int     }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{txt}
{com}. drop make
{txt}
{com}. mata: bench = hash1(st_data(., "_all"))
{res}{txt}
{com}. mata: bench
{res}  3965372940
{txt}
{com}. li in 1/10
{txt}
     {c TLC}{hline 8}{c -}{hline 5}{c -}{hline 7}{c -}{hline 10}{c -}{hline 7}{c -}{hline 8}{c -}{hline 8}{c -}{hline 6}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 7}{c TRC}
     {c |} {res} price   mpg   rep78   headroom   trunk   weight   length   turn   displa~t   gear_r~o    foreign   sum_fo~n   max_fo~n   MAX_PR~E   _freq {txt}{c |}
     {c LT}{hline 8}{c -}{hline 5}{c -}{hline 7}{c -}{hline 10}{c -}{hline 7}{c -}{hline 8}{c -}{hline 8}{c -}{hline 6}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 7}{c RT}
  1. {c |} {res} 4,099    22       3        2.5      11    2,930      186     40        121       3.58   Domestic          0          0       4816       6 {txt}{c |}
  2. {c |} {res} 4,749    17       3        3.0      11    3,350      173     40        258       2.53   Domestic          0          0       4816       6 {txt}{c |}
  3. {c |} {res} 3,799    22       .        3.0      12    2,640      168     35        121       3.08   Domestic          4          1       6229       6 {txt}{c |}
  4. {c |} {res} 4,816    20       3        4.5      16    3,250      196     40        196       2.93   Domestic          0          0       4816       6 {txt}{c |}
  5. {c |} {res} 7,827    15       4        4.0      20    4,080      222     43        350       2.41   Domestic          0          0      14500      12 {txt}{c |}
     {c LT}{hline 8}{c -}{hline 5}{c -}{hline 7}{c -}{hline 10}{c -}{hline 7}{c -}{hline 8}{c -}{hline 8}{c -}{hline 6}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 7}{c RT}
  6. {c |} {res} 5,788    18       3        4.0      21    3,670      218     43        231       2.73   Domestic          0          0      14500      12 {txt}{c |}
  7. {c |} {res} 4,453    26       .        3.0      10    2,230      170     34        304       2.87   Domestic          4          1       9735       6 {txt}{c |}
  8. {c |} {res} 5,189    20       3        2.0      16    3,280      200     42        196       2.93   Domestic          0          0       5798       7 {txt}{c |}
  9. {c |} {res}10,372    16       3        3.5      17    3,880      207     43        231       2.93   Domestic          0          0      14500      12 {txt}{c |}
 10. {c |} {res} 4,082    19       3        3.5      13    3,400      200     42        231       3.08   Domestic          0          0       5798       7 {txt}{c |}
     {c BLC}{hline 8}{c -}{hline 5}{c -}{hline 7}{c -}{hline 10}{c -}{hline 7}{c -}{hline 8}{c -}{hline 8}{c -}{hline 6}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 7}{c BRC}

{com}. 
. sysuse auto, clear
{txt}(1978 Automobile Data)

{com}. fcollapse (sum) foreign (max) MAX_PRICE=price foreign, by(turn) merge freq v
{res}{txt}(0 observations deleted)
{res}{txt}(obs: {res}74{txt}; levels: {res}18{txt};{txt} method: {res}hash0{txt}; dict size: {res}21{txt})
{res}  50:      0.10 /        1 =       0.1000
{txt}
{com}. 
. de *_*

              {txt}storage   display    value
variable name   type    format     label      variable label
{hline}
{p 0 48}{res}{bind:gear_ratio     }{txt}{bind: float   }{bind:{txt}%6.2f     }{space 1}{bind:         }{bind:  }{res}{res}Gear Ratio{p_end}
{p 0 48}{bind:sum_foreign    }{txt}{bind: double  }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}(sum) foreign{p_end}
{p 0 48}{bind:max_foreign    }{txt}{bind: byte    }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}(max) foreign{p_end}
{p 0 48}{bind:MAX_PRICE      }{txt}{bind: int     }{bind:{txt}%8.0gc    }{space 1}{bind:         }{bind:  }{res}{res}(max) price{p_end}
{p 0 48}{bind:_freq          }{txt}{bind: byte    }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}Frequency{p_end}
{txt}
{com}. drop make
{txt}
{com}. mata: ftools = hash1(st_data(., "_all"))
{res}{txt}
{com}. mata: ftools
{res}  3965372940
{txt}
{com}. mata: bench == ftools
{res}  1
{txt}
{com}. li in 1/10
{txt}
     {c TLC}{hline 8}{c -}{hline 5}{c -}{hline 7}{c -}{hline 10}{c -}{hline 7}{c -}{hline 8}{c -}{hline 8}{c -}{hline 6}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 7}{c TRC}
     {c |} {res} price   mpg   rep78   headroom   trunk   weight   length   turn   displa~t   gear_r~o    foreign   sum_fo~n   max_fo~n   MAX_PR~E   _freq {txt}{c |}
     {c LT}{hline 8}{c -}{hline 5}{c -}{hline 7}{c -}{hline 10}{c -}{hline 7}{c -}{hline 8}{c -}{hline 8}{c -}{hline 6}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 7}{c RT}
  1. {c |} {res} 4,099    22       3        2.5      11    2,930      186     40        121       3.58   Domestic          0          0      4,816       6 {txt}{c |}
  2. {c |} {res} 4,749    17       3        3.0      11    3,350      173     40        258       2.53   Domestic          0          0      4,816       6 {txt}{c |}
  3. {c |} {res} 3,799    22       .        3.0      12    2,640      168     35        121       3.08   Domestic          4          1      6,229       6 {txt}{c |}
  4. {c |} {res} 4,816    20       3        4.5      16    3,250      196     40        196       2.93   Domestic          0          0      4,816       6 {txt}{c |}
  5. {c |} {res} 7,827    15       4        4.0      20    4,080      222     43        350       2.41   Domestic          0          0     14,500      12 {txt}{c |}
     {c LT}{hline 8}{c -}{hline 5}{c -}{hline 7}{c -}{hline 10}{c -}{hline 7}{c -}{hline 8}{c -}{hline 8}{c -}{hline 6}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 7}{c RT}
  6. {c |} {res} 5,788    18       3        4.0      21    3,670      218     43        231       2.73   Domestic          0          0     14,500      12 {txt}{c |}
  7. {c |} {res} 4,453    26       .        3.0      10    2,230      170     34        304       2.87   Domestic          4          1      9,735       6 {txt}{c |}
  8. {c |} {res} 5,189    20       3        2.0      16    3,280      200     42        196       2.93   Domestic          0          0      5,798       7 {txt}{c |}
  9. {c |} {res}10,372    16       3        3.5      17    3,880      207     43        231       2.93   Domestic          0          0     14,500      12 {txt}{c |}
 10. {c |} {res} 4,082    19       3        3.5      13    3,400      200     42        231       3.08   Domestic          0          0      5,798       7 {txt}{c |}
     {c BLC}{hline 8}{c -}{hline 5}{c -}{hline 7}{c -}{hline 10}{c -}{hline 7}{c -}{hline 8}{c -}{hline 8}{c -}{hline 6}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 7}{c BRC}

{com}. 
. * TEST SPEED
. clear
{txt}
{com}. 
. set obs 10000000
{txt}{p}
number of observations (_N)  was 0,
now 10,000,000
{p_end}

{com}. gen long firm = ceil(runiform() * c(N) / 10)
{txt}
{com}. bys firm: gen int year = _n
{txt}
{com}. xtset firm year
{res}{txt}{col 8}panel variable:  {res}firm (unbalanced)
{txt}{col 9}time variable:  {res}{col 25}year, 1 to 29
{txt}{col 17}delta:  {res}1 unit
{txt}
{com}. gen double x = rnormal()
{txt}
{com}. gen int y = ceil(runiform() * 10)
{txt}
{com}. 
. // sort year
. loc by year // firm
{txt}
{com}. 
. 
. 
. timer clear
{txt}
{com}. 
. timer on 1
{txt}
{com}. egen double sum_x = sum(x), by(`by')
{txt}
{com}. //egen int max_y = max(y), by(`by')
. timer off 1
{txt}
{com}. 
. //de
. //li in 1/10
. //drop sum_x
. //mata: bench = hash1(st_data(., "_all"))
. //mata: bench
. 
. drop *_*
{txt}
{com}. 
. set trace off
{txt}
{com}. timer on 2
{txt}
{com}. fcollapse (sum) x /*(max) y*/, by(`by') merge fast verbose
{res}{txt}(0 observations deleted)
{res}{txt}(obs: {res}10000000{txt}; levels: {res}29{txt};{txt} method: {res}hash0{txt}; dict size: {res}29{txt})
{res}  50:      2.06 /        1 =       2.0600
{txt}
{com}. timer off 2
{txt}
{com}. de, short

{txt}Contains data
  obs:{res}    10,000,000                          
{txt} vars:{res}             5                          
{txt} size:{res}   240,000,000                          
{txt}Sorted by: {res}firm  year
     Note: Dataset has changed since last saved.
{txt}
{com}. 
. //de
. //li in 1/10
. //drop sum_x
. //mata: ftools = hash1(st_data(., "_all"))
. //mata: ftools
. //mata: bench == ftools
. 
. drop *_*
{txt}
{com}. timer on 3
{txt}
{com}. Bysort `by'
{txt}
{com}. timer off 3
{txt}
{com}. 
. drop *_*
{txt}
{com}. 
. timer list
{res}   1:     11.59 /        1 =      11.5930
   2:      5.37 /        1 =       5.3700
   3:      8.58 /        1 =       8.5780
{txt}
{com}. di as text "1 egen 2 fcollapse+merge 3 bysort"
{res}{txt}1 egen 2 fcollapse+merge 3 bysort

{com}. 
. 
. exit

{txt}end of do-file


{com}. di 537/1159
{res}.46333046

{com}. do demo_fcollapse_merge
{txt}
{com}. cap ado uninstall ftools
{txt}
{com}. net install ftools, from("C:/git/ftools/source")
checking {hilite:ftools} consistency and verifying not already installed...
installing into c:\ado\plus\...
installation complete.
{txt}
{com}. ftools compile
{txt}(compiling lftools.mlib for Stata 14.2)
(library saved in c:\ado\plus/l/lftools.mlib)

{com}. discard
{txt}
{com}. 
. clear all
{txt}
{com}. cls
{txt}
{com}. set more off
{txt}
{com}. 
. cap pr drop Bysort
{txt}
{com}. pr Bysort, sortpreserve
{txt}  1{com}.         loc by `0'
{txt}  2{com}.         bys `by': gen double sum_x = sum(x)
{txt}  3{com}.         
.         //bys `by': gen double mean_x = sum(x)
.         //tempvar N
.         //bys `by': gen long `N' = (x != .)
.         //bys `by': replace `N' = sum(`N')
.         //bys `by': replace mean_x = mean_x[_N] / _N
. end
{txt}
{com}. 
. * benchmark
. sysuse auto
{txt}(1978 Automobile Data)

{com}. egen double sum_foreign = sum(foreign), by(turn)
{txt}
{com}. egen byte max_foreign = max(foreign), by(turn)
{txt}
{com}. egen int MAX_PRICE = max(price), by(turn)
{txt}
{com}. egen int _freq = count(turn), by(turn)
{txt}
{com}. 
. de *_*

              {txt}storage   display    value
variable name   type    format     label      variable label
{hline}
{p 0 48}{res}{bind:gear_ratio     }{txt}{bind: float   }{bind:{txt}%6.2f     }{space 1}{bind:         }{bind:  }{res}{res}Gear Ratio{p_end}
{p 0 48}{bind:sum_foreign    }{txt}{bind: double  }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:max_foreign    }{txt}{bind: byte    }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:MAX_PRICE      }{txt}{bind: int     }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:_freq          }{txt}{bind: int     }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{txt}
{com}. drop make
{txt}
{com}. mata: bench = hash1(st_data(., "_all"))
{res}{txt}
{com}. mata: bench
{res}  3965372940
{txt}
{com}. li in 1/10
{txt}
     {c TLC}{hline 8}{c -}{hline 5}{c -}{hline 7}{c -}{hline 10}{c -}{hline 7}{c -}{hline 8}{c -}{hline 8}{c -}{hline 6}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 7}{c TRC}
     {c |} {res} price   mpg   rep78   headroom   trunk   weight   length   turn   displa~t   gear_r~o    foreign   sum_fo~n   max_fo~n   MAX_PR~E   _freq {txt}{c |}
     {c LT}{hline 8}{c -}{hline 5}{c -}{hline 7}{c -}{hline 10}{c -}{hline 7}{c -}{hline 8}{c -}{hline 8}{c -}{hline 6}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 7}{c RT}
  1. {c |} {res} 4,099    22       3        2.5      11    2,930      186     40        121       3.58   Domestic          0          0       4816       6 {txt}{c |}
  2. {c |} {res} 4,749    17       3        3.0      11    3,350      173     40        258       2.53   Domestic          0          0       4816       6 {txt}{c |}
  3. {c |} {res} 3,799    22       .        3.0      12    2,640      168     35        121       3.08   Domestic          4          1       6229       6 {txt}{c |}
  4. {c |} {res} 4,816    20       3        4.5      16    3,250      196     40        196       2.93   Domestic          0          0       4816       6 {txt}{c |}
  5. {c |} {res} 7,827    15       4        4.0      20    4,080      222     43        350       2.41   Domestic          0          0      14500      12 {txt}{c |}
     {c LT}{hline 8}{c -}{hline 5}{c -}{hline 7}{c -}{hline 10}{c -}{hline 7}{c -}{hline 8}{c -}{hline 8}{c -}{hline 6}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 7}{c RT}
  6. {c |} {res} 5,788    18       3        4.0      21    3,670      218     43        231       2.73   Domestic          0          0      14500      12 {txt}{c |}
  7. {c |} {res} 4,453    26       .        3.0      10    2,230      170     34        304       2.87   Domestic          4          1       9735       6 {txt}{c |}
  8. {c |} {res} 5,189    20       3        2.0      16    3,280      200     42        196       2.93   Domestic          0          0       5798       7 {txt}{c |}
  9. {c |} {res}10,372    16       3        3.5      17    3,880      207     43        231       2.93   Domestic          0          0      14500      12 {txt}{c |}
 10. {c |} {res} 4,082    19       3        3.5      13    3,400      200     42        231       3.08   Domestic          0          0       5798       7 {txt}{c |}
     {c BLC}{hline 8}{c -}{hline 5}{c -}{hline 7}{c -}{hline 10}{c -}{hline 7}{c -}{hline 8}{c -}{hline 8}{c -}{hline 6}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 7}{c BRC}

{com}. 
. sysuse auto, clear
{txt}(1978 Automobile Data)

{com}. fcollapse (sum) foreign (max) MAX_PRICE=price foreign, by(turn) merge freq v
{res}{txt}(0 observations deleted)
{res}{txt}(obs: {res}74{txt}; levels: {res}18{txt};{txt} method: {res}hash0{txt}; dict size: {res}21{txt})
{res}  50:      0.09 /        1 =       0.0850
{txt}
{com}. 
. de *_*

              {txt}storage   display    value
variable name   type    format     label      variable label
{hline}
{p 0 48}{res}{bind:gear_ratio     }{txt}{bind: float   }{bind:{txt}%6.2f     }{space 1}{bind:         }{bind:  }{res}{res}Gear Ratio{p_end}
{p 0 48}{bind:sum_foreign    }{txt}{bind: double  }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}(sum) foreign{p_end}
{p 0 48}{bind:max_foreign    }{txt}{bind: byte    }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}(max) foreign{p_end}
{p 0 48}{bind:MAX_PRICE      }{txt}{bind: int     }{bind:{txt}%8.0gc    }{space 1}{bind:         }{bind:  }{res}{res}(max) price{p_end}
{p 0 48}{bind:_freq          }{txt}{bind: byte    }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}Frequency{p_end}
{txt}
{com}. drop make
{txt}
{com}. mata: ftools = hash1(st_data(., "_all"))
{res}{txt}
{com}. mata: ftools
{res}  3965372940
{txt}
{com}. mata: bench == ftools
{res}  1
{txt}
{com}. li in 1/10
{txt}
     {c TLC}{hline 8}{c -}{hline 5}{c -}{hline 7}{c -}{hline 10}{c -}{hline 7}{c -}{hline 8}{c -}{hline 8}{c -}{hline 6}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 7}{c TRC}
     {c |} {res} price   mpg   rep78   headroom   trunk   weight   length   turn   displa~t   gear_r~o    foreign   sum_fo~n   max_fo~n   MAX_PR~E   _freq {txt}{c |}
     {c LT}{hline 8}{c -}{hline 5}{c -}{hline 7}{c -}{hline 10}{c -}{hline 7}{c -}{hline 8}{c -}{hline 8}{c -}{hline 6}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 7}{c RT}
  1. {c |} {res} 4,099    22       3        2.5      11    2,930      186     40        121       3.58   Domestic          0          0      4,816       6 {txt}{c |}
  2. {c |} {res} 4,749    17       3        3.0      11    3,350      173     40        258       2.53   Domestic          0          0      4,816       6 {txt}{c |}
  3. {c |} {res} 3,799    22       .        3.0      12    2,640      168     35        121       3.08   Domestic          4          1      6,229       6 {txt}{c |}
  4. {c |} {res} 4,816    20       3        4.5      16    3,250      196     40        196       2.93   Domestic          0          0      4,816       6 {txt}{c |}
  5. {c |} {res} 7,827    15       4        4.0      20    4,080      222     43        350       2.41   Domestic          0          0     14,500      12 {txt}{c |}
     {c LT}{hline 8}{c -}{hline 5}{c -}{hline 7}{c -}{hline 10}{c -}{hline 7}{c -}{hline 8}{c -}{hline 8}{c -}{hline 6}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 7}{c RT}
  6. {c |} {res} 5,788    18       3        4.0      21    3,670      218     43        231       2.73   Domestic          0          0     14,500      12 {txt}{c |}
  7. {c |} {res} 4,453    26       .        3.0      10    2,230      170     34        304       2.87   Domestic          4          1      9,735       6 {txt}{c |}
  8. {c |} {res} 5,189    20       3        2.0      16    3,280      200     42        196       2.93   Domestic          0          0      5,798       7 {txt}{c |}
  9. {c |} {res}10,372    16       3        3.5      17    3,880      207     43        231       2.93   Domestic          0          0     14,500      12 {txt}{c |}
 10. {c |} {res} 4,082    19       3        3.5      13    3,400      200     42        231       3.08   Domestic          0          0      5,798       7 {txt}{c |}
     {c BLC}{hline 8}{c -}{hline 5}{c -}{hline 7}{c -}{hline 10}{c -}{hline 7}{c -}{hline 8}{c -}{hline 8}{c -}{hline 6}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c -}{hline 7}{c BRC}

{com}. 
. * TEST SPEED
. clear
{txt}
{com}. 
. set obs 10000000
{txt}{p}
number of observations (_N)  was 0,
now 10,000,000
{p_end}

{com}. gen long firm = ceil(runiform() * c(N) / 10)
{txt}
{com}. bys firm: gen int year = _n
{txt}
{com}. xtset firm year
{res}{txt}{col 8}panel variable:  {res}firm (unbalanced)
{txt}{col 9}time variable:  {res}{col 25}year, 1 to 29
{txt}{col 17}delta:  {res}1 unit
{txt}
{com}. gen double x = rnormal()
{txt}
{com}. gen int y = ceil(runiform() * 10)
{txt}
{com}. 
. // sort year
. loc by firm
{txt}
{com}. 
. 
. 
. timer clear
{txt}
{com}. 
. timer on 1
{txt}
{com}. egen double sum_x = sum(x), by(`by')
{txt}
{com}. //egen int max_y = max(y), by(`by')
. timer off 1
{txt}
{com}. 
. //de
. //li in 1/10
. //drop sum_x
. //mata: bench = hash1(st_data(., "_all"))
. //mata: bench
. 
. drop *_*
{txt}
{com}. 
. set trace off
{txt}
{com}. timer on 2
{txt}
{com}. fcollapse (sum) x /*(max) y*/, by(`by') merge fast verbose
{res}{txt}(0 observations deleted)
{res}{txt}(obs: {res}10000000{txt}; levels: {res}999958{txt};{txt} method: {res}hash0{txt}; dict size: {res}1000000{txt})
{res}  50:      2.14 /        1 =       2.1370
{txt}
{com}. timer off 2
{txt}
{com}. de, short

{txt}Contains data
  obs:{res}    10,000,000                          
{txt} vars:{res}             5                          
{txt} size:{res}   240,000,000                          
{txt}Sorted by: {res}firm  year
     Note: Dataset has changed since last saved.
{txt}
{com}. 
. //de
. //li in 1/10
. //drop sum_x
. //mata: ftools = hash1(st_data(., "_all"))
. //mata: ftools
. //mata: bench == ftools
. 
. drop *_*
{txt}
{com}. timer on 3
{txt}
{com}. Bysort `by'
{txt}
{com}. timer off 3
{txt}
{com}. 
. drop *_*
{txt}
{com}. 
. timer list
{res}   1:      3.31 /        1 =       3.3110
   2:      9.59 /        1 =       9.5920
   3:      0.83 /        1 =       0.8290
{txt}
{com}. di as text "1 egen 2 fcollapse+merge 3 bysort"
{res}{txt}1 egen 2 fcollapse+merge 3 bysort

{com}. 
. 
. exit

{txt}end of do-file


{com}. 